[
    {
        "projectUrl": "/projects/magic",
        "projectTitle": "Markov Affinity-based Graph Imputation of Cells",
        "projectAbbreviation": "MAGIC",
        "projectListDescription": "an algorithm that uses graph signal processing for denoising and missing transcript recovery in single cell RNA sequencing. MAGIC successfully recovers gene-gene relationships from data and allows for the prediction of transcription targets.",
        "heroBlurb": "Recovering Gene Interactions from Single-Cell Data Using Data Diffusion",
        "heroImage": "/images/projects/magic_hero.jpg",
        "authors": [
            {
                "name": "David van Dijk"
            },
            {
                "name": "Roshan Sharma"
            },
            {
                "name": "Juozas Nainys"
            },
            {
                "name": "Kristina Yim"
            },
            {
                "name": "Pooja Kathail"
            },
            {
                "name": "Ambrose J. Carr"
            },
            {
                "name": "Cassandra Burdziak"
            },
            {
                "name": "Kevin R Moon"
            },
            {
                "name": "Christine L. Chaffer"
            },
            {
                "name": "Diwakar Pattabiraman"
            },
            {
                "name": "Brian Bierie"
            },
            {
                "name": "Linas Mazutis"
            },
            {
                "name": "Guy Wolf"
            },
            {
                "name": "Smita Krishnaswamy"
            },
            {
                "name": "Dana Pe'er"
            }
        ],
        "journal": "Cell Press",
        "journalImage": "/images/journals/cell_press.png",
        "githubLink": "https://github.com/KrishnaswamyLab/MAGIC",
        "publicationLink": "https://www.cell.com/cell/fulltext/S0092-8674(18)30724-4",
        "publicationImage": "/images/projects/magic_image.jpg",
        "publicationTitle": "MAGIC: Recovering Gene Interactions from Single-Cell Data Using Data Diffusion",
        "publicationAbstract": "Single-cell RNA-sequencing is fast becoming a major technology that is  revolutionizing biological discovery in fields such as development, immunology and cancer. The ability to simultaneously measure thousands of genes at single cell resolution allows, among other prospects, for the possibility of learning gene regulatory networks at large scales. However, scRNA-seq technologies suffer from many sources of significant technical noise, the most prominent of which is dropout due to inefficient mRNA capture. This results in data that has a high degree of sparsity, with typically only 10% non-zero values.\nTo address this, we developed MAGIC (Markov Affinity-based Graph Imputation of Cells), a method for imputing missing values, and restoring the structure of the data. After MAGIC, we find that two- and three-dimensional gene interactions are restored and that MAGIC is able to impute complex and non-linear shapes of interactions. MAGIC also retains cluster structure, enhances cluster-specific gene interactions and restores trajectories, as demonstrated in mouse retinal bipolar cells, hematopoiesis, and our newly generated epithelial-to-mesenchymal transition dataset.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/phate",
        "projectTitle": "Potential of Heat-diffusion Affinity-based Transition Embedding",
        "projectAbbreviation": "PHATE",
        "projectListDescription": "a visualization and dimensionality reduction technique that is sensitive to local and global relationships and successfully preserves structures of interest in biological data including cluster structure and branching trajectory structure.",
        "heroBlurb": "Visualizing Transitions and Structure for Biological Data Exploration",
        "heroImage": "/images/projects/phate_hero.jpg",
        "authors": [
            {
                "name": "Kevin R Moon"
            },
            {
                "name": "David van Dijk"
            },
            {
                "name": "Zheng Wang"
            },
            {
                "name": "Daniel B Burkhardt"
            },
            {
                "name": "William S Chen"
            },
            {
                "name": "Antonia van den Elzen"
            },
            {
                "name": "Matthew J Hirn"
            },
            {
                "name": "Ronald R Coifman"
            },
            {
                "name": "Natalia B Ivanova"
            },
            {
                "name": "Smita Krishnaswamy"
            }
        ],
        "journal": "Nature Biotechnology",
        "journalImage": "/images/journals/nature_biotech.jpg",
        "githubLink": "https://github.com/KrishnaswamyLab/PHATE",
        "publicationLink": "https://www.nature.com/articles/s41587-019-0336-3",
        "publicationImage": "/images/projects/phate_image.jpg",
        "publicationTitle": "PHATE: Visualizing Transitions and Structure for Biological Data Exploration",
        "publicationAbstract": "In the era of 'Big Data' there is a pressing need for tools that provide human interpretable visualizations of emergent patterns in high-throughput high-dimensional data. Further, to enable insightful data exploration, such visualizations should faithfully capture and emphasize emergent structures and patterns without enforcing prior assumptions on the shape or form of the data.\nIn this paper, we present PHATE (Potential of Heat-diffusion for Affinity-based Transition Embedding) - an unsupervised low-dimensional embedding for visualization of data that is aimed at solving these issues. Unlike previous methods that are commonly used for visualization, such as PCA and tSNE, PHATE is able to capture and highlight both local and global structure in the data.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/saucie",
        "projectTitle": "Sparse AutoEncoders for Clustering Imputation and Embedding",
        "projectAbbreviation": "SAUCIE",
        "projectListDescription": "a deep autoencoder architecture that allows for unsupervised exploration of data, and has novel regularizations that allow for data denoising, batch normalization, clustering and visualization simultaneously  in various layers of the network.",
        "heroBlurb": "Exploring Single-Cell Data with Deep Multitasking Neural Networks",
        "heroImage": "/images/saucie_hero.jpg",
        "authors": [
            {
                "name": "Matthew Amodio"
            },
            {
                "name": "Krishnan Srinivasan"
            },
            {
                "name": "David van Dijk"
            },
            {
                "name": "Hussein Mohsen"
            },
            {
                "name": "Kristina Yim"
            },
            {
                "name": "Rebecca Muhle"
            },
            {
                "name": "Kevin R Moon"
            },
            {
                "name": "Susan Kaech"
            },
            {
                "name": "Ryan Sowell"
            },
            {
                "name": "Ruth Montgomery"
            },
            {
                "name": "James Noonan"
            },
            {
                "name": "Guy Wolf"
            },
            {
                "name": "Smita Krishnaswamy"
            }
        ],
        "journal": "bioRxiv",
        "journalImage": "/images/projects/journals/bioarchives.png",
        "githubLink": "https://github.com/KrishnaswamyLab/SAUCIE",
        "publicationLink": "https://www.biorxiv.org/content/early/2018/08/27/237065.1",
        "publicationImage": "/images/projects/saucie_image.jpg",
        "publicationTitle": "SAUCIE: Exploring Single-Cell Data with Deep Multitasking Neural Networks",
        "publicationAbstract": "Handling the vast amounts of single-cell RNA-sequencing and CyTOF data, which are now being generated in patient cohorts, presents a computational challenge due to the noise, complexity, sparsity and batch effects present. Here, we propose a unified deep neural network-based approach to automatically process and extract structure from these massive datasets.\nOur unsupervised architecture, called SAUCIE (Sparse Autoencoder for Unsupervised Clustering, Imputation, and Embedding), simultaneously performs several key tasks for single-cell data analysis including 1) clustering, 2) batch correction, 3) visualization, and 4) denoising/imputation. SAUCIE is trained to recreate its own input after reducing its dimensionality in a 2-D embedding layer which can be used to visualize the data.\nAdditionally, SAUCIE uses two novel regularizations: (1) an information dimension regularization to penalize entropy as computed on normalized activation values of the layer, and thereby encourage binary-like encodings that are amenable to clustering and (2) a Maximal Mean Discrepancy penalty to correct batch effects. Thus SAUCIE has a single architecture that denoises, batch-corrects, visualizes and clusters data using a unified representation. We show results on artificial data where ground truth is known, as well as mass cytometry data from dengue patients, and single-cell RNA-sequencing data from embryonic mouse brain.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/meld",
        "projectTitle": "Manifold Enhancement of Latent Dimensions",
        "projectAbbreviation": "MELD",
        "projectListDescription": "a graph signal processing tool to analyze multiple scRNA-seq samples from two or more conditions.",
        "heroBlurb": "Quantifying the effect of perturbations in single cell RNA-sequencing data",
        "heroImage": "/images/projects/meld_hero.png",
        "authors": [
            {
                "name": "Daniel B Burkhardt"
            },
            {
                "name": "Jay S Stanley"
            },
            {
                "name": "Alexander Tong"
            },
            {
                "name": "Ana Luisa Perdigoto"
            },
            {
                "name": "Scott A Gigante"
            },
            {
                "name": "Kevan C Herold"
            },
            {
                "name": "Guy Wolf"
            },
            {
                "name": "Antonio J Giraldez"
            },
            {
                "name": "David van Dijk"
            },
            {
                "name": "Smita Krishnaswamy"
            }
        ],
        "journal": "Nature Biotechnology",
        "journalImage": "/images/journals/nature_biotech.jpg",
        "githubLink": null,
        "publicationLink": "https://www.nature.com/articles/s41587-020-00803-5",
        "publicationImage": null,
        "publicationTitle": "MELD: Graph signal processing identifies cell populations affected by an experimental treatment",
        "publicationAbstract": "Current methods for comparing single-cell RNA sequencing datasets collected in multiple conditions focus on discrete regions of the transcriptional state space, such as clusters of cells. Here we quantify the effects of perturbations at the single-cell level using a continuous measure of the effect of a perturbation across the transcriptomic space. We describe this space as a manifold and develop a relative likelihood estimate of observing each cell in each of the experimental conditions using graph signal processing. This likelihood estimate can be used to identify cell populations specifically affected by a perturbation. We also develop vertex frequency clustering to extract populations of affected cells at the level of granularity that matches the perturbation response. The accuracy of our algorithm at identifying clusters of cells that are enriched or depleted in each condition is, on average, 57% higher than the next-best-performing algorithm tested. Gene signatures derived from these clusters are more accurate than those of six alternative algorithms in ground truth comparisons.",
        "publicationPoster": null,
        "publicationYear": 2021,
        "youtube": null
    },
    {
        "projectUrl": "/projects/phemd",
        "projectTitle": "Phenotypic Earth Mover's Distance",
        "projectAbbreviation": "PhEMD",
        "projectListDescription": "a computational method to quantify relationships between drug perturbations on dozens to hundreds of single cell samples.",
        "heroBlurb": "Single cell analysis of drug perturbations",
        "heroImage": "/images/projects/phemd_hero.jpeg",
        "authors": [
            {
                "name": "William S Chen"
            },
            {
                "name": "Nevena Zivanovic"
            },
            {
                "name": "David van Dijk"
            },
            {
                "name": "Guy Wolf"
            },
            {
                "name": "Bernd Bodenmiller"
            },
            {
                "name": "Smita Krishnaswamy"
            }
        ],
        "journal": "bioRxiv",
        "journalImage": "/images/projects/journals/bioarchives.png",
        "githubLink": null,
        "publicationLink": "https://www.biorxiv.org/content/early/2018/12/31/455436",
        "publicationImage": "/images/projects/phemd_image.png",
        "publicationTitle": "PhEMD: comparing drug perturbations by their effect on single cell populations",
        "publicationAbstract": "Previously, the effect of a drug on a cell population was measured based on simple metrics such as cell viability. However, as single-cell technologies are becoming more advanced, drug screen experiments can now be conducted with more complex readouts such as gene expression profiles of individual cells. The increasing complexity of measurements from these multi-sample experiments calls for more sophisticated analytical approaches than are currently available.\nWe develop a novel method called PhEMD (Phenotypic Earth Mover's Distance) and show that it can be used to embed the space of drug perturbations on the basis of the drugs' effects on cell populations. When testing PhEMD on a newly-generated, 300-sample CyTOF kinase inhibition screen experiment, we find that the state space of the perturbation conditions is surprisingly low-dimensional and that the network of drugs demonstrates manifold structure.\nWe show that because of the fairly simple manifold geometry of the 300 samples, we can accurately capture the full range of drug effects using a dictionary of only 30 experimental conditions. We also show that new drugs can be added to our PhEMD embedding using similarities inferred from other characterizations of drugs using a technique called Nystrom extension.\nOur findings suggest that large-scale drug screens can be conducted by measuring only a small fraction of the drugs using the most expensive high-throughput single-cell technologies -- the effects of other drugs may be inferred by mapping and extending the perturbation space. We additionally show that PhEMD can be useful for analyzing other types of single-cell samples, such as patient tumor biopsies, by mapping the patient state space in a similar way as the drug state space.\nWe demonstrate that PhEMD is highly scalable, compatible with leading batch effect correction techniques, and generalizable to multiple experimental designs. Altogether, our analyses suggest that PhEMD may facilitate drug discovery efforts and help uncover the network geometry of a collection of single-cell samples.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/dremi",
        "projectTitle": "conditional Density-based Resampled Estimate of Mutual Information",
        "projectAbbreviation": "DREMI",
        "projectListDescription": "a computational method based on established statistical concepts, to characterize signaling network relationships by quantifying the strengths of network edges and deriving signaling response functions.",
        "heroBlurb": "Learning time-varying information flow from single-cell EMT data",
        "heroImage": "/images/projects/dremi_hero.jpg",
        "authors": [
            {
                "name": "Smita Krishnaswamy"
            },
            {
                "name": "Matthew H Spitzer"
            },
            {
                "name": "Michael Mingueneau"
            },
            {
                "name": "Sean C Bendall"
            },
            {
                "name": "Oren Litvin"
            },
            {
                "name": "Erica Stone"
            },
            {
                "name": "Dana Pe'er"
            },
            {
                "name": "Garry P Nolan"
            }
        ],
        "journal": "Science AAAS",
        "journalImage": "/images/projects/journals/science_aaas.png",
        "githubLink": "https://github.com/KrishnaswamyLab/scprep/blob/master/python/scprep/stats.py#L82",
        "publicationLink": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4334155/",
        "publicationImage": "/images/projects/dremi_image.jpg",
        "publicationTitle": "DREMI: Conditional Density-based Analysis of T cell Signaling in Single Cell Data",
        "publicationAbstract": "Cellular circuits sense the environment, process signals, and compute decisions using networks of interacting proteins. To model such a system, the abundance of each activated protein species can be described as a stochastic function of the abundance of other proteins. High-dimensional single-cell technologies, like mass cytometry, offer an opportunity to characterize signaling circuit-wide. However, the challenge of developing and applying computational approaches to interpret such complex data remains.\nHere, we developed computational methods, based on established statistical concepts, to characterize signaling network relationships by quantifying the strengths of network edges and deriving signaling response functions. In comparing signaling between naïve and antigen-exposed CD4+ T-lymphocytes, we find that although these two cell subtypes had similarly-wired networks, naïve cells transmitted more information along a key signaling cascade than did antigen-exposed cells.\nWe validated our characterization on mice lacking the extracellular-regulated MAP kinase (ERK2), which showed stronger influence of pERK on pS6 (phosphorylated-ribosomal protein S6), in naïve cells compared to antigen-exposed cells, as predicted. We demonstrate that by using cell-to-cell variation inherent in single cell data, we can algorithmically derive response functions underlying molecular circuits and drive the understanding of how cells process signals.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/tides",
        "projectTitle": "Trajectory Interpolated DREMI Scores",
        "projectAbbreviation": "TIDES",
        "projectListDescription": null,
        "heroBlurb": "Learning time-varying information flow form single-cell epithelial to mesenchymal transition data",
        "heroImage": null,
        "authors": [
            {
                "name": "Smita Krishnaswamy"
            },
            {
                "name": "Nevena Zivanovic"
            },
            {
                "name": "Roshan Sharma"
            },
            {
                "name": "Dana Pe'er"
            },
            {
                "name": "Bernd Bodenmiller"
            }
        ],
        "journal": "PLOS ONE",
        "journalImage": "/images/projects/journals/plos_one.png",
        "githubLink": null,
        "publicationLink": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0203389",
        "publicationImage": "/images/projects/tides_image.png",
        "publicationTitle": "TIDES: Learning time-varying information flow from single-cell epithelial to mesenchymal transition data",
        "publicationAbstract": "TIDES or ( Trajectory Interpolated DREMI Scores) is an extension of our earlier Density Resampled Estimate of Mutual Information which quantifies  time-varying edge behavior over a developmental trajectory. In particular it tracks times during development in which a regulatory relationship is strong (high mutual information) vs times when regulatory relationships are inactive (low mutual information) due  to regulatory network rewiring that underlies differentiation.  We also predict an overall metric of edge dynamism, which combined with TIDES allows us to predict the effect of drug perturbations on the Epithelial-to-Mesenchymal transition in breast cancer cells.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/dymon",
        "projectTitle": "Dynamics Modeling Networks",
        "projectAbbreviation": "DyMoN",
        "projectListDescription": "A neural network framework for learning stochastic dynamics for generative and embedding purposes. DyMoN serves as a deep model that itself embodies a dynamic system such that the gene logic and features driving the system can be studied.",
        "heroBlurb": "Modeling Dynamics of Biological Systems with Deep Generative Neural Networks",
        "heroImage": "/images/projects/dymon_hero.jpeg",
        "authors": [
            {"name": "David van Dijk"},
            {"name": "Scott A Gigante"},
            {"name": "Kevin R Moon"},
            {"name": "Alexander Strzalkowski"},
            {"name": "Katie Ferguson"},
            {"name": "Jess Cardin"},
            {"name": "Guy Wolf"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "arXiv",
        "journalImage": "/images/projects/journals/arxiv.png",
        "githubLink": null,
        "publicationLink": "https://arxiv.org/abs/1802.03497",
        "publicationImage": "/images/projects/dymon_image.jpg",
        "publicationTitle": "Dynamics Modeling Networks: Modeling Dynamics of Biological Systems with Deep Generative Neural Networks",
        "publicationAbstract": "Biological data often contains measurements of dynamic entities such as cells or organisms in various states of progression. However, biological systems are notoriously difficult to describe analytically due to their many interacting components, and in many cases, the technical challenge of taking longitudinal measurements.\nThis leads to difficulties in studying the features of the dynamics, for examples the drivers of the transition. To address this problem, we present a deep neural network framework we call Dynamics Modeling Network or DyMoN. DyMoN is a neural network framework trained as a deep generative Markov model whose next state is a probability distribution based on the current state.\nDyMoN is well-suited to the idiosyncrasies of biological data, including noise, sparsity, and the lack of longitudinal measurements in many types of systems. Thus, DyMoN can be trained using probability distributions derived from the data in any way, such as trajectories derived via dimensionality reduction methods, and does not require longitudinal measurements.\nWe show the advantage of learning deep models over shallow models such as Kalman filters and hidden Markov models that do not learn representations of the data, both in terms of learning embeddings of the data and also in terms training efficiency, accuracy and ability to multitask. We perform three case studies of applying DyMoN to different types of biological systems and extracting features of the dynamics in each case by examining the learned model.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/sugar",
        "projectTitle": "Synthesis Using Geometrically Aligned Random-walks",
        "projectAbbreviation": "SUGAR",
        "projectListDescription": "A new kind of data generation algorithm that generates of data geometry rather than density and is able to generate data in sparse regions and predicts hypothetical data points.",
        "heroBlurb": "Geometry-Based Data Generation",
        "heroImage": "/images/projects/sugar_hero.jpg",
        "authors": [
            {"name": "Ofir Lindenbaum"},
            {"name": "Jay S Stanley"},
            {"name": "Guy Wolf"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "arXiv",
        "journalImage": "/images/projects/journals/arxiv.png",
        "githubLink": null,
        "publicationLink": "https://arxiv.org/abs/1802.04927",
        "publicationImage": "/images/projects/sugar_image.png",
        "publicationTitle": "SUGAR: Geometry-Based Data Generation",
        "publicationAbstract": "Many generative models attempt to replicate the density of their input data. However, this approach is often undesirable, since data density is highly affected by sampling biases, noise, and artifacts. We propose a method called SUGAR (Synthesis Using Geometrically Aligned Random-walks) that uses a diffusion process to learn a manifold geometry from the data. Then, it generates new points evenly along the manifold by pulling randomly generated points into its intrinsic structure using a diffusion kernel.\nSUGAR equalizes the density along the manifold by selectively generating points in sparse areas of the manifold. We demonstrate how the approach corrects sampling biases and artifacts, while also revealing intrinsic patterns (e.g. progression) and relations in the data. The method is applicable for correcting missing data, finding hypothetical data points, and learning relationships between data features.",
        "publicationPoster": "https://static1.squarespace.com/static/58fba552f7e0ab0af45cd6fb/t/5bf8ebb64ae237e15d457661/1543039928671/SUGAR_poster.pdf",
        "publicationYear": null,
        "youtube": "https://youtu.be/VAbUs_nXbs0"
    },
    {
        "projectUrl": "/projects/magan",
        "projectTitle": "Manifold Alignment Generative Adversarial Network",
        "projectAbbreviation": "MAGAN",
        "projectListDescription": "a dual GAN (generative adversarial network) framework that can find correspondences between two data modalities measuring the same system to create an integrated dataset",
        "heroBlurb": "Aligning Biological Manifolds",
        "heroImage": "/images/projects/magan_hero.jpeg",
        "authors": [
            {"name": "Matthew Amodio"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "PMLR",
        "journalImage": "/images/projects/journals/pmlr.png",
        "githubLink": null,
        "publicationLink": "http://proceedings.mlr.press/v80/amodio18a.html",
        "publicationImage": "/images/projects/magan_image.png",
        "publicationTitle": "MAGAN: Aligning Biological Manifolds",
        "publicationAbstract": "It is increasingly common in many types of natural and physical systems (especially biological systems) to have different types of measurements  performed on the same underlying system. In such settings, it is important to align the manifolds arising from each measurement in order  to integrate such data and gain an improved picture of the system; we tackle this problem using generative adversarial networks (GANs). Recent attempts to use GANs to find correspondences between sets of samples do not explicitly perform proper alignment of manifolds.\nWe present the new Manifold Aligning GAN (MAGAN) that aligns two manifolds such that related points in each measurement space are aligned. We demonstrate  applications of MAGAN in single-cell biology in integrating two different measurement types together: cells from the same tissue are measured with both genomic (single-cell RNA-sequencing) and proteomic (mass cytometry) technologies. We show that MAGAN successfully aligns manifolds such that known correlations between measured markers are improved compared to other recently proposed models.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/neuron_editing",
        "projectTitle": "Neuron Editing",
        "projectAbbreviation": null,
        "projectListDescription": "a neural network inference method which maps between datasets with the signal learned on a subset of the data, for example when a drug perturbation is applied to one cell type neuron editing can be used to apply it in silico to another cell type.",
        "heroBlurb": "Out-of-Sample Extrapolation",
        "heroImage": "/images/projects/neuron_editing_hero.jpeg",
        "authors": [
            {"name": "Matthew Amodio"},
            {"name": "David van Dijk"},
            {"name": "Ruth Montgomery"},
            {"name": "Guy Wolf"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "arXiv",
        "journalImage": "/images/projects/journals/arxiv.png",
        "githubLink": null,
        "publicationLink": "https://arxiv.org/abs/1805.12198",
        "publicationImage": "/image/projects/neuron_editing_image.png",
        "publicationTitle": "Out-of-Sample Extrapolation with Neuron Editing",
        "publicationAbstract": "While neural networks can be trained to map from one specific dataset to another, they usually do not learn a generalized transformation that can extrapolate accurately outside the space of training. For instance, a generative adversarial network (GAN) exclusively trained to transform images of cars from light to dark might not have the same effect on images of horses. This is because neural networks are good at generation within the manifold of the data that they are trained on. However, generating new samples outside of the manifold or extrapolating \"out-of-sample\" is a much harder problem that has been less well studied.\nTo address this, we introduce a technique called neuron editing that learns how neurons encode an edit for a particular transformation in a latent space. We use an autoencoder to decompose the variation within the dataset into activations of different neurons and generate transformed data by defining an editing transformation on those neurons.\nBy performing the transformation in a latent trained space, we encode fairly complex and non-linear transformations to the data with much simpler distribution shifts to the neuron's activations. We showcase our technique on image domain/style transfer and two biological applications: removal of batch artifacts representing unwanted noise and modeling the effect of drug treatments to predict synergy between drugs.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/trajectory_net",
        "projectTitle": "TrajectoryNet",
        "projectAbbreviation": null,
        "projectListDescription": "Relates continuous normalizing flows with the Breiner formulation of dynamic optimal transport to perform continuous optimal transport in high dimensions in the neural network framework. Uses dynamic optimal transport to infer continuous cell trajectories over time.",
        "heroBlurb": "A Dynamic Optimal Transport Network for Modeling Cellular Dynamics",
        "heroImage": "/iamges/projects/trajectory_net_hero.png",
        "authors": [
            {"name": "Alexander Tong"},
            {"name": "Jessie Huang"},
            {"name": "Guy Wolf"},
            {"name": "David van Dijk"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "ICML",
        "journalImage": "/images/projects/journals/icml.jpeg",
        "githubLink": "https://github.com/KrishnaswamyLab/TrajectoryNet",
        "publicationLink": "http://proceedings.mlr.press/v119/tong20a/tong20a-supp.pdf",
        "publicationImage": "/images/projects/trajectory_net_image.gif",
        "publicationTitle": "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics",
        "publicationAbstract": "It is increasingly common to encounter data from dynamic processes captured by static cross-sectional measurements over time, particularly in biomedical settings. Recent attempts to model individual trajectories from this data use optimal transport to create pairwise matchings between time points. However, these methods cannot model continuous dynamics and non-linear paths that entities can take in these systems. To address this issue, we establish a link between continuous normalizing flows and dynamic optimal transport, that allows us to model the expected paths of points over time. Continuous normalizing flows are generally under constrained, as they are allowed to take an arbitrary path from the source to the target distribution. We present {TrajectoryNet}, which controls the continuous paths taken between distributions to produce dynamic optimal transport. We show how this is particularly applicable for studying cellular dynamics in data from single-cell RNA sequencing (scRNA-seq) technologies, and that TrajectoryNet improves upon recently proposed static optimal transport-based models that can be used for interpolating cellular distributions.",
        "publicationPoster": null,
        "publicationYear": 2020,
        "youtube": "https://www.youtube.com/watch?v=uEEbC3KI8RM"
    },
    {
        "projectUrl": "/projects/topological_fmri_analysis",
        "projectTitle": "Topological fMRI Analysis",
        "projectAbbreviation": null,
        "projectListDescription": "A novel fMRI analysis method based on the concepts of cubical persistent homology, which analyzes functions on structured data sets at different scales.",
        "heroBlurb": "Understanding the topology of fMRI activation functions for data analysis",
        "heroImage": null,
        "authors": [
            {"name": "Bastian Rieck"},
            {"name": "Tristan Yates"},
            {"name": "Christian Bock"},
            {"name": "Karsten Borgwardt"},
            {"name": "Guy Wolf"},
            {"name": "Nicholas Turk-Browne"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "arXiv",
        "journalImage": "/images/projects/journals/arxiv.png",
        "githubLink": null,
        "publicationLink": "https://arxiv.org/abs/2006.07882",
        "publicationImage": "/images/projects/topological_fmri_analysis_image.png",
        "publicationTitle": "Uncovering the Topology of Time-Varying fMRI Data using Cubical Persistence",
        "publicationAbstract": "Functional magnetic resonance imaging (fMRI) is a crucial technology for gaining insights into cognitive processes in humans. Data amassed from fMRI measurements result in volumetric data sets that vary over time. However, analysing such data presents a challenge due to the large degree of noise and person-to-person variation in how information is represented in the brain.\nTo address this challenge, we present a novel topological approach that encodes each time point in an fMRI data set as a persistence diagram of topological features, i.e. high-dimensional voids present in the data. This representation naturally does not rely on voxel-by-voxel correspondence and is robust towards noise. We show that these time-varying persistence diagrams can be clustered to find meaningful groupings between participants, and that they are also useful in studying within-subject brain state trajectories of subjects performing a particular task.\nIn our preprint, we apply both clustering and trajectory analysis techniques to a group of participants watching the movie 'Partly Cloudy'. We observe significant differences in both brain state trajectories and overall topological activity between adults and children watching the same movie.\nSee below for an overview of our workflow.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/gsae",
        "projectTitle": "Geometric Scattering Autoencoder",
        "projectAbbreviation": "GSAE",
        "projectListDescription": "Here we combine the flexibility of deep learning with the representational power of graph scattering transforms to study thermodynamic landscapes within RNA folding.",
        "heroBlurb": "Combining the flexibility of deep learning with the represenational power of graph scattering transforms to study thermodynamic landscapes within RNA folding",
        "heroImage": "/images/projects/gsae_hero.jpg",
        "authors": [
            {"name": "Egbert Castro"},
            {"name": "Andrew Benz"},
            {"name": "Alexander Tong"},
            {"name": "Guy Wolf"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "IEEE",
        "journalImage": "/images/projects/journals/ieee.jpg",
        "githubLink": null,
        "publicationLink": "https://ieeexplore.ieee.org/document/9378305",
        "publicationImage": "/images/projects/gsae_image.gif",
        "publicationTitle": "Uncovering the Folding Landscape of RNA Secondary Structure with Deep Graph Embeddings",
        "publicationAbstract": "Biomolecular graph analysis has recently gained much attention in the emerging field of geometric deep learning. Here we focus on organizing biomolecular graphs in ways that expose meaningful relations and variations between them. We propose a geometric scattering autoencoder (GSAE) network for learning such graph embeddings. Our embedding network first extracts rich graph features using the recently proposed geometric scattering transform. Then, it leverages a semi-supervised variational autoencoder to extract a low-dimensional embedding that retains the information in these features that enable prediction of molecular properties as well as characterize graphs. We show that GSAE organizes RNA graphs both by structure and energy, accurately reflecting bistable RNA structures. Also, the model is generative and can sample new folding trajectories.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": null,
        "projectTitle": "Multiscale PHATE",
        "projectAbbreviation": null,
        "projectListDescription": "Capturing meaningful biological signals in high-dimensional data using a continuous coarse-graining process which can be used to produce both a high-level summarization and more detailed representations of the data.",
        "heroBlurb": null,
        "heroImage": null,
        "authors": [],
        "journal": null,
        "journalImage": null,
        "githubLink": null,
        "publicationLink": null,
        "publicationImage": null,
        "publicationTitle": null,
        "publicationAbstract": null,
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": null,
        "projectTitle": "Integrated Diffusion",
        "projectAbbreviation": null,
        "projectListDescription": "Combining multi-modal datasets by learning an integrated diffusion operator to effectively visualize the relationships between them.",
        "heroBlurb": null,
        "heroImage": null,
        "authors": [],
        "journal": null,
        "journalImage": null,
        "githubLink": null,
        "publicationLink": null,
        "publicationImage": null,
        "publicationTitle": null,
        "publicationAbstract": null,
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null        
    },
    {
        "projectUrl": null,
        "projectTitle": "[Unbalanced] Diffusion Earth Mover's Distance",
        "projectAbbreviation": "[U]DEMD",
        "projectListDescription": "a fast multi-scale approximation of the Earth Mover's Distance with manifold geodesics as a ground distance between distributions on a manifold.",
        "heroBlurb": "Fast approximations for earth mover's distance between distributions on a manifold",        
        "heroImage": "/images/projects/udemd_hero.jpg",
        "authors": [],
        "journal": null,
        "journalImage": null,
        "githubLink": null,
        "publicationLink": null,
        "publicationImage": null,
        "publicationTitle": null,
        "publicationAbstract": null,
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    },
    {
        "projectUrl": "/projects/demd",
        "projectTitle": "Diffusion Earth Mover's Distance and Distribution Embeddings",
        "projectAbbreviation": "DEMD",
        "projectListDescription": "a fast multi-scale approximation of the Earth Mover's Distance with manifold geodesics as a ground distance between distributions on a manifold.",
        "heroBlurb": "Fast approximations for earth mover's distance between distributions on a manifold",
        "heroImage": null,
        "authors": [
            {"name": "Alexander Tong"},
            {"name": "Guillaume Huguet"},
            {"name": "Amine Natik"},
            {"name": "Kincaid MacDonald"},
            {"name": "Manik Kuchroo"},
            {"name": "Ronald R Coifman"},
            {"name": "Guy Wolf"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "ICML",
        "journalImage": "/images/projects/journals/icml.jpeg",
        "githubLink": "https://github.com/KrishnaswamyLab/DiffusionEMD",
        "publicationLink": "http://proceedings.mlr.press/v139/tong21a/tong21a-supp.pdf",
        "publicationImage": null,
        "publicationTitle": null,
        "publicationAbstract": "We propose a new fast method of measuring distances between large numbers of related high dimensional datasets called the Diffusion Earth Mover's Distance (EMD). We model the datasets as distributions supported on common data graph that is derived from the affinity matrix computed on the combined data. In such cases where the graph is a discretization of an underlying Riemannian closed manifold, we prove that Diffusion EMD is topologically equivalent to the standard EMD with a geodesic ground distance. Diffusion EMD can be computed in $\tilde{O}(n)$ time and is more accurate than similarly fast algorithms such as tree-based EMDs. We also show Diffusion EMD is fully differentiable, making it amenable to future uses in gradient-descent frameworks such as deep neural networks. Finally, we demonstrate an application of Diffusion EMD to single cell data collected from 210 COVID-19 patient samples at Yale New Haven Hospital. Here, Diffusion EMD can derive distances between patients on the manifold of cells at least two orders of magnitude faster than equally accurate methods. This distance matrix between patients can be embedded into a higher level patient manifold which uncovers structure and heterogeneity in patients. More generally, Diffusion EMD is applicable to all datasets that are massively collected in parallel in many medical and biological systems.",
        "publicationPoster": null,
        "publicationYear": 2021,
        "youtube": "https://youtu.be/3Lwi_nYsmDs"
    },
    {
        "projectUrl": null,
        "projectTitle": "Embedding Signals on Knowledge Graphs with Unbalanced Diffusion Earth Mover's Distance",
        "projectAbbreviation": null,
        "projectListDescription": "a fast multi-scale approximation of the Earth Mover's Distance with manifold geodesics as a ground distance between distributions on a manifold.",
        "heroBlurb": "Fast approximations for earth mover's distance between distributions on a manifold",
        "heroImage": null,
        "authors": [
            {"name": "Alexander Tong"},
            {"name": "Guillaume Huguet"},
            {"name": "Dennis Shung"},
            {"name": "Amine Natik"},
            {"name": "Manik Kuchroo"},
            {"name": "Guillaume Lajoie"},
            {"name": "Guy Wolf"},
            {"name": "Smita Krishnaswamy"}
        ],
        "journal": "ICASSP",
        "journalImage": "/images/projects/journals/arxiv.png",
        "githubLink": "https://github.com/KrishnaswamyLab/DiffusionEMD",
        "publicationLink": "https://arxiv.org/abs/2107.12334",
        "publicationImage": "/images/projects/udemd_signal_graphs_image.png",
        "publicationTitle": null,
        "publicationAbstract": "In modern relational machine learning it is common to encounter large graphs that arise via interactions or similarities between observations in many domains. Further, in many cases the target entities for analysis are actually signals on such graphs. We propose to compare and organize such datasets of graph signals by using an earth mover's distance (EMD) with a geodesic cost over the underlying graph. Typically, EMD is computed by optimizing over the cost of transporting one probability distribution to another over an underlying metric space. However, this is inefficient when computing the EMD between many signals. Here, we propose an unbalanced graph earth mover's distance that efficiently embeds the unbalanced EMD on an underlying graph into an L1 space, whose metric we call unbalanced diffusion earth mover's distance (UDEMD). This leads us to an efficient nearest neighbors kernel over many signals defined on a large graph. Next, we show how this gives distances between graph signals that are robust to noise. Finally, we apply this to organizing patients based on clinical notes who are modelled as signals on the SNOMED-CT medical knowledge graph, embedding lymphoblast cells modeled as signals on a gene graph, and organizing genes modeled as signals over a large peripheral blood mononuclear (PBMC) cell graph. In each case, we show that UDEMD-based embeddings find accurate distances that are highly efficient compared to other methods.",
        "publicationPoster": null,
        "publicationYear": null,
        "youtube": null
    }
]