[{"title": "Design for Robustness", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Igor", "L.", "Markov"]}, {"name": ["John", "P.", "Hayes"]}], "year": "2013", "month": null, "pages": "93-113", "abstract": "We develop several design techniques to improve circuit SER with low area and performance overhead. Our techniques are based on the careful analysis of the interplay between signal probability, observability, and masking mechanisms. The first technique, called SiDeR,...", "publisher": "Springer, Dordrecht", "periodical": null, "keywords": [], "urls": [{"href": "https://link.springer.com/chapter/10.1007/978-90-481-9644-9_6"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:Se3iqnhoufwC", "journal_source": "Design, Analysis and Test of Logic Circuits Under Uncertainty", "cites": 0}, {"title": "Summary and Extensions", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Igor", "L.", "Markov"]}, {"name": ["John", "P.", "Hayes"]}], "year": "2013", "month": null, "pages": "115-120", "abstract": "This chapter summarizes the research presented in the preceding chapters and suggests some possible ways in which it might be extended further for new applications, such as the analysis of process variations in logic circuits, and the analysis of biological networks.", "publisher": "Springer, Dordrecht", "periodical": null, "keywords": [], "urls": [{"href": "https://link.springer.com/chapter/10.1007/978-90-481-9644-9_7"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:UebtZRa9Y70C", "journal_source": "Design, Analysis and Test of Logic Circuits Under Uncertainty", "cites": 0}, {"title": "Computing with Probabilistic Transfer Matrices", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Igor", "L.", "Markov"]}, {"name": ["John", "P.", "Hayes"]}], "year": "2013", "month": null, "pages": "37-52", "abstract": "We demonstrate the compressed encoding of probabilistic transfer matrices as algebraic decision diagrams (ADDs) and develop equivalent ADD algorithms for PTM operations that can operate directly on the compressed forms and compute circuit error probabilities. We also...", "publisher": "Springer, Dordrecht", "periodical": null, "keywords": [], "urls": [{"href": "https://link.springer.com/chapter/10.1007/978-90-481-9644-9_3"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:8k81kl-MbHgC", "journal_source": "Design, Analysis and Test of Logic Circuits Under Uncertainty", "cites": 0}, {"title": "PD-1 marks dysfunctional regulatory T cells in malignant gliomas", "type": "Journal Article", "authors": [{"name": ["Daniel", "E.", "Lowther"]}, {"name": ["Brittany", "A.", "Goods"]}, {"name": ["Liliana", "E.", "Lucca"]}, {"name": ["Benjamin", "A.", "Lerner"]}, {"name": ["Khadir", "Raddassi"]}, {"name": ["David", "van Dijk"]}, {"name": ["Amanda", "L.", "Hernandez"]}, {"name": ["Xiangguo", "Duan"]}, {"name": ["Murat", "Gunel"]}, {"name": ["Vlad", "Coric"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["J.", "Christopher", "Love"]}, {"name": ["David", "A.", "Hafler"]}], "year": "2016", "month": "4", "pages": null, "abstract": "Immunotherapies targeting the immune checkpoint receptor programmed cell death protein 1 (PD-1) have shown remarkable efficacy in treating cancer. CD4+CD25hiFoxP3+ Tregs are critical regulators of immune responses in autoimmunity and malignancies, but the functional status of human Tregs expressing PD-1 remains unclear. We examined functional and molecular features of PD-1hi Tregs in healthy subjects and patients with glioblastoma multiforme (GBM), combining functional assays, RNA sequencing, and cytometry by time of flight (CyTOF). In both patients with GBM and healthy subjects, circulating PD-1hi Tregs displayed reduced suppression of CD4+ effector T cells, production of IFN-γ, and molecular signatures of exhaustion. Transcriptional profiling of tumor-resident Tregs revealed that several genes coexpressed with PD-1 and associated with IFN-γ production and exhaustion as well as enrichment in exhaustion signatures compared with circulating PD-1hi Tregs. CyTOF analysis of circulating and tumor-infiltrating Tregs from patients with GBM treated with PD-1-blocking antibodies revealed that treatment shifts the profile of circulating Tregs toward a more exhausted phenotype reminiscent of that of tumor-infiltrating Tregs, further increasing IFN-γ production. Thus, high PD-1 expression on human Tregs identifies dysfunctional, exhausted Tregs secreting IFN-γ that exist in healthy individuals and are enriched in tumor infiltrates, possibly losing function as they attempt to modulate the antitumoral immune responses.", "publisher": "American Society for Clinical Investigation", "periodical": "JCI Insight", "keywords": [], "urls": [{"href": "/pmc/articles/PMC4864991/"}, {"href": "/pmc/articles/PMC4864991/?report=abstract"}, {"href": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4864991/"}], "volume": 1, "issue": "5", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:SjuI4pbJlxcC", "journal_source": "JCI insight", "cites": 195}, {"title": "Normalization of mass cytometry data with bead standards", "type": "Journal Article", "authors": [{"name": ["Rachel", "Finck"]}, {"name": ["Erin", "F.", "Simonds"]}, {"name": ["Astraea", "Jager"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Karen", "Sachs"]}, {"name": ["Wendy", "Fantl"]}, {"name": ["Dana", "Pe'er"]}, {"name": ["Garry", "P.", "Nolan"]}, {"name": ["Sean", "C.", "Bendall"]}], "year": "2013", "month": "5", "pages": "483-494", "abstract": "Mass cytometry uses atomic mass spectrometry combined with isotopically pure reporter elements to currently measure as many as 40 parameters per single cell. As with any quantitative technology, there is a fundamental need for quality assurance and normalization protocols. In the case of mass cytometry, the signal variation over time due to changes in instrument performance combined with intervals between scheduled maintenance must be accounted for and then normalized. Here, samples were mixed with polystyrene beads embedded with metal lanthanides, allowing monitoring of mass cytometry instrument performance over multiple days of data acquisition. The protocol described here includes simultaneous measurements of beads and cells on the mass cytometer, subsequent extraction of the bead-based signature, and the application of an algorithm enabling correction of both short- and long-term signal fluctuations. The variation in the intensity of the beads that remains after normalization may also be used to determine data quality. Application of the algorithm to a one-month longitudinal analysis of a human peripheral blood sample reduced the range of median signal fluctuation from 4.9-fold to 1.3-fold. © 2013 International Society for Advancement of Cytometry.", "publisher": "John Wiley & Sons, Ltd", "periodical": "Cytometry Part A", "keywords": ["CyTOF", "PBMC", "blood", "flow cytometry", "internal standards", "mass cytometry", "normalization", "phenotype"], "urls": [{"href": "https://onlinelibrary.wiley.com/doi/full/10.1002/cyto.a.22271"}, {"href": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cyto.a.22271"}, {"href": "https://onlinelibrary.wiley.com/doi/10.1002/cyto.a.22271"}], "volume": 83, "issue": "5", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:kNdYIx-mwKoC", "journal_source": "Cytometry Part A", "cites": 600}, {"title": "Intuitive ECO synthesis for high performance circuits", "type": "Journal Article", "authors": [{"name": ["Haoxing", "Ren"]}, {"name": ["Ruchir", "Puri"]}, {"name": ["Lakshmi", "Reddy"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Cindy", "Washburn"]}, {"name": ["Joel", "Earl"]}, {"name": ["Joachim", "Keinert"]}], "year": "2013", "month": null, "pages": "1002-1007", "abstract": "In the IC industry, chip design cycles are becoming more compressed, while designs themselves are growing in complexity. These trends necessitate efficient methods to handle late-stage engineering change orders (ECOs) to the functional specification, often in response to errors discovered after much of the implementation is finished. Past ECO synthesis algorithms have typically treated ECOs as functional errors and applied error diagnosis techniques to solve them. However, error diagnosis methods are primarily geared towards finding a single change, and moreover, tend to be computationally complex. In this paper, we propose a unique methodology that can systematically incorporate human intuition into the ECO process. Our methodology involves finding a set of directly substitutable points known as functional correspondences between the original implementation and the new specification by using name-preserving synthesis and user hints, to diminish the size of the ECO problem. On average, our approach can reduce the size of logic changes by 94% from those reported in current literature. We then incorporate our logic ECO changes into an incremental physical synthesis flow to demonstrate its usability in an industrial setting. Our ECO synthesis methodology is evaluated on high-performance industrial designs. Results indicate that post-ECO worst negative slack (WNS) improved 14% and total negative slack (TNS) improved 46% over pre-ECO. © 2013 EDAA.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings -Design, Automation and Test in Europe, DATE", "keywords": ["Engineering Change Order", "Logic Synthesis", "Physical Synthesis"], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:MXK_kJrjxJIC", "journal_source": "2013 Design, Automation &Test in Europe Conference &Exhibition (DATE …", "cites": 8}, {"title": "Can CAD cure cancer?", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Bernd", "Bodenmiller"]}, {"name": ["Dana", "Pe'er"]}], "year": "2013", "month": null, "pages": null, "abstract": "Eukaryotic cells have complex regulatory systems that sense adversity (e.g. DNA damage, heat shock, external deathinduction signals) and respond by invoking programmed celldeath or apoptosis. Cancer cells have evolved the ability to thwart such sensory information and associated regulation. As biologists begin to understand cells in circuit-like terms, we can also begin to derive and simulate druggable targets of cellular networks that cause a cancerous cell to kill its self. Towards this goal, we have performed preliminary experiments that test the impact of siRNA (RNA silencing) on diverse cellular signaling pathways, at unprecedented single-cell resolution. We propose ways in which a CAD system can process such data to automatically derive drug targets. Copyright © 2013 ACM.", "publisher": null, "periodical": "Proceedings - Design Automation Conference", "keywords": [], "urls": [{"href": "https://dl.acm.org/doi/10.1145/2463209.2488910"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:hqOjcs7Dif8C", "journal_source": "Proceedings of the 50th Annual Design Automation Conference", "cites": 1}, {"title": "viSNE enables visualization of high dimensional single-cell data and reveals phenotypic heterogeneity of leukemia", "type": "Journal Article", "authors": [{"name": ["El", "Ad", "David", "Amir"]}, {"name": ["Kara", "L.", "Davis"]}, {"name": ["Michelle", "D.", "Tadmor"]}, {"name": ["Erin", "F.", "Simonds"]}, {"name": ["Jacob", "H.", "Levine"]}, {"name": ["Sean", "C.", "Bendall"]}, {"name": ["Daniel", "K.", "Shenfeld"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Garry", "P.", "Nolan"]}, {"name": ["Dana", "Pe'Er"]}], "year": "2013", "month": "5", "pages": "545-552", "abstract": "A new tool to visualize high-dimensional single-cell data, when integrated with mass cytometry, reveals phenotypic heterogeneity of human leukemia. New high-dimensional, single-cell technologies offer unprecedented resolution in the analysis of heterogeneous tissues. However, because these technologies can measure dozens of parameters simultaneously in individual cells, data interpretation can be challenging. Here we present viSNE, a tool that allows one to map high-dimensional cytometry data onto two dimensions, yet conserve the high-dimensional structure of the data. viSNE plots individual cells in a visual similar to a scatter plot, while using all pairwise distances in high dimension to determine each cell's location in the plot. We integrated mass cytometry with viSNE to map healthy and cancerous bone marrow samples. Healthy bone marrow automatically maps into a consistent shape, whereas leukemia samples map into malformed shapes that are distinct from healthy bone marrow and from each other. We also use viSNE and mass cytometry to compare leukemia diagnosis and relapse samples, and to identify a rare leukemia population reminiscent of minimal residual disease. viSNE can be applied to any multi-dimensional single-cell technology.", "publisher": "Nature Publishing Group", "periodical": "Nature Biotechnology 2013 31:6", "keywords": ["Cancer", "Computational biology and bioinformatics", "Flow cytometry", "Haematopoiesis"], "urls": [{"href": "https://www.nature.com/articles/nbt.2594"}], "volume": 31, "issue": "6", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:Zph67rFs4hoC", "journal_source": "Nature biotechnology", "cites": 1438}, {"title": "Palladium-based mass tag cell barcoding with a doublet-filtering scheme and single-cell deconvolution algorithm", "type": "Journal Article", "authors": [{"name": ["Eli", "R.", "Zunder"]}, {"name": ["Rachel", "Finck"]}, {"name": ["Gregory", "K.", "Behbehani"]}, {"name": ["El", "Ad", "D.", "Amir"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Veronica", "D.", "Gonzalez"]}, {"name": ["Cynthia", "G.", "Lorang"]}, {"name": ["Zach", "Bjornson"]}, {"name": ["Matthew", "H.", "Spitzer"]}, {"name": ["Bernd", "Bodenmiller"]}, {"name": ["Wendy", "J.", "Fantl"]}, {"name": ["Dana", "Pe'Er"]}, {"name": ["Garry", "P.", "Nolan"]}], "year": "2015", "month": "1", "pages": "316-333", "abstract": "This protocol describes how to use mass-tag cell barcoding to label individual cell samples with unique combinatorial barcodes. The samples can then be pooled for processing and measurement on a mass cytometer. Mass-tag cell barcoding (MCB) labels individual cell samples with unique combinatorial barcodes, after which they are pooled for processing and measurement as a single multiplexed sample. The MCB method eliminates variability between samples in antibody staining and instrument sensitivity, reduces antibody consumption and shortens instrument measurement time. Here we present an optimized MCB protocol. The use of palladium-based labeling reagents expands the number of measurement channels available for mass cytometry and reduces interference with lanthanide-based antibody measurement. An error-detecting combinatorial barcoding scheme allows cell doublets to be identified and removed from the analysis. A debarcoding algorithm that is single cell–based rather than population-based improves the accuracy and efficiency of sample deconvolution. This debarcoding algorithm has been packaged into software that allows rapid and unbiased sample deconvolution. The MCB procedure takes 3–4 h, not including sample acquisition time of ∼1 h per million cells.", "publisher": "Nature Publishing Group", "periodical": "Nature Protocols 2014 10:2", "keywords": ["Computational biology and bioinformatics", "Flow cytometry", "Isolation", "Sensors and probes", "separation and purification"], "urls": [{"href": "https://www.nature.com/articles/nprot.2015.020"}], "volume": 10, "issue": "2", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:aqlVkmm33-oC", "journal_source": "Nature protocols", "cites": 424}, {"title": "Single-cell mass cytometry of TCR signaling: Amplification of small initial differences results in low ERK activation in NOD mice", "type": "Journal Article", "authors": [{"name": ["Michael", "Mingueneau"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Matthew", "H.", "Spitzer"]}, {"name": ["Sean", "C.", "Bendall"]}, {"name": ["Erica", "L.", "Stone"]}, {"name": ["Stephen", "M.", "Hedrick"]}, {"name": ["Dana", "Pe'er"]}, {"name": ["Diane", "Mathis"]}, {"name": ["Garry", "P.", "Nolan"]}, {"name": ["Christophe", "Benoist"]}], "year": "2014", "month": "11", "pages": "16466-16471", "abstract": "Signaling from the T-cell receptor (TCR) conditions T-cell differentiation and activation, requiring exquisite sensitivity and discrimination. Using mass cytometry, a high-dimensional technique that can probe multiple signaling nodes at the single-cell level, we interrogate TCR signaling dynamics in control C57BL/6 and autoimmunity-prone nonobese diabetic (NOD) mice, which show ineffective ERK activation after TCR triggering. By quantitating signals at multiple steps along the signaling cascade and parsing the phosphorylation level of each node as a function of its predecessors, we show that a small impairment in initial pCD3Ζ activation resonates farther down the signaling cascade and results in larger defects in activation of the ERK1/2-S6 and IκBα modules. This nonlinear property of TCR signaling networks, which magnifies small initial differences during signal propagation, also applies in cells from B6 mice activated at different levels of intensity. Impairment in pCD3Ζ and pSLP76 is not a feedback consequence of a primary deficiency in ERK activation because no proximal signaling defect was observed in Erk2 KO T cells. These defects, which were manifest at all stages of T-cell differentiation from early thymic pre-T cells to memory T cells, may condition the imbalanced immunoregulation and tolerance in NOD T cells. More generally, this amplification of small initial differences in signal intensity may explain how T cells discriminate between closely related ligands and adopt strongly delineated cell fates.", "publisher": "National Academy of Sciences", "periodical": "Proceedings of the National Academy of Sciences of the United States of America", "keywords": ["CyTOF", "Diabetes", "NOD", "Signaling", "Single-cell"], "urls": [{"href": "https://www.pnas.org/doi/abs/10.1073/pnas.1419337111"}], "volume": 111, "issue": "46", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:qxL8FJ1GzNcC", "journal_source": "Proceedings of the National Academy of Sciences", "cites": 63}, {"title": "2013 Reviewers", "type": "Journal Article", "authors": [{"name": ["Abdellatif", "Abu-Issa"]}, {"name": ["Miguel", "Angel", "Aguirre"]}, {"name": ["Waleed", "Al-Assadi"]}, {"name": ["Yousra", "Alkabani"]}, {"name": ["Himyanshu", "Anand"]}, {"name": ["Lorena", "Anghel"]}, {"name": ["Daniel", "Arumi"]}, {"name": ["Nicholas", "Axelos"]}, {"name": ["Florence", "Azais"]}, {"name": ["Jose", "Rodrigo", "Azambuja"]}, {"name": ["Luz", "Balado"]}, {"name": ["Lars", "Bauer"]}, {"name": ["Jayanta", "Bhadra"]}, {"name": ["Sanjukta", "Bhanja"]}, {"name": ["Swarup", "Bhunia"]}, {"name": ["Shawn", "Blanton"]}, {"name": ["Christophe", "Bobda"]}, {"name": ["Cristiana", "Bolchini"]}, {"name": ["Alberto", "Bosio"]}, {"name": ["Alex", "Brodsky"]}, {"name": ["Luigi", "Carro"]}, {"name": ["Amlan", "Chakrabarti"]}, {"name": ["Rajat", "Chakraborty"]}, {"name": ["Santanu", "Chattopadhyay"]}, {"name": ["Jwu-E", "Chen"]}, {"name": ["Min", "Chen"]}, {"name": ["Mingsong", "Chen"]}, {"name": ["Mingjing", "Chen"]}, {"name": ["Minsu", "Choi"]}, {"name": ["Lukasz", "Chruszczyk"]}, {"name": ["Bruce", "Cockburn"]}, {"name": ["Edmond", "Cooley"]}, {"name": ["Enrico", "Costenaro"]}, {"name": ["Erika", "Cota"]}, {"name": ["Jerzy", "Dabrowski"]}, {"name": ["D", "K", "Das"]}, {"name": ["Shamik", "Das"]}, {"name": ["Pallab", "Dasgupta"]}, {"name": ["Stefano", "Di"]}, {"name": ["Carlo", "Luigi", "Dilillo"]}, {"name": ["Michael", "Dimopoulos"]}, {"name": ["Jennifer", "Dworak"]}, {"name": ["Stephan", "Eggersglues"]}, {"name": ["Osman", "Ekekon"]}, {"name": ["Luis", "Entrena"]}, {"name": ["Yaniv", "Fais"]}, {"name": ["Hongxia", "Fang"]}, {"name": ["Bernhard", "Fechner"]}, {"name": ["Shaun", "Feng"]}, {"name": ["Goerschwin", "Fey"]}, {"name": ["Jose", "Garcia-Gervacio"]}, {"name": ["Valentin", "Gherman"]}, {"name": ["Dimitris", "Gizopoulos"]}, {"name": ["Michael", "Goessel"]}, {"name": ["Elena", "Gramatova"]}, {"name": ["Cristian", "Grecu", "Said"]}, {"name": ["Hamdioui", "Han"]}, {"name": ["Han", "Jie"]}, {"name": ["Han", "Kecheng"]}, {"name": ["Hao", "K", "Hatayama"]}, {"name": ["John", "Hayes"]}, {"name": ["Sybille", "Hellebrand"]}, {"name": ["Yoshinobu", "Higami"]}, {"name": ["Jim", "Holt"]}, {"name": ["Hao-Chiao", "Hong"]}, {"name": ["Ke", "Huang"]}, {"name": ["Yu", "Huang"]}, {"name": ["Xinming", "Huang"]}, {"name": ["Jiun-Lang", "Huang"]}, {"name": ["William", "Hung"]}, {"name": ["Maksim", "Jenihhin"]}, {"name": ["Emmanouil", "Kalligeros"]}, {"name": ["Sungho", "Kang"]}, {"name": ["Sukeshwar", "Kannan"]}, {"name": ["Fernanda", "Kastensmidt"]}, {"name": ["Hans", "Kerkhoff"]}, {"name": ["Nektarios", "Kranitis"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Bram", "Kruseman"]}, {"name": ["Kemal", "Kulovic"]}, {"name": ["Erik", "Larsson"]}, {"name": ["Gildas", "Leger"]}, {"name": ["Regis", "Leveugle"]}, {"name": ["Min", "Li"]}, {"name": ["Juncao", "Li"]}, {"name": ["Baohu", "Li"]}, {"name": ["Huawei", "Li"]}, {"name": ["Mike", "Peng", "Li"]}, {"name": ["Xijiang", "Lin"]}, {"name": ["John", "Liobe"]}, {"name": ["Scott", "Little"]}, {"name": ["Bing", "Long"]}, {"name": ["Celia", "Lopez-Ongil"]}, {"name": ["Abdallah", "Louay"]}, {"name": ["Junxia", "Ma"]}, {"name": ["Yiorgos", "Makris"]}, {"name": ["Samed", "Maltabas"]}, {"name": ["Mar", "Martinez"]}, {"name": ["Elmar", "Melcher"]}, {"name": ["Cecilia", "Metra"]}, {"name": ["Spencer", "Millican"]}], "year": "2014", "month": "2", "pages": "5-6", "abstract": "Lists the reviewers of IEEE Transactions on Learning Technologies in 2013.", "publisher": "Springer", "periodical": "Journal of Electronic Testing 2014 30:1", "keywords": ["CAE) and Design", "Circuits and Systems", "Computer-Aided Engineering (CAD", "Electrical Engineering"], "urls": [{"href": "https://link.springer.com/article/10.1007/s10836-014-5437-9"}], "volume": null, "issue": "1"}, {"title": "Conditional density-based analysis of T cell signaling in single-cell data", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Matthew", "H.", "Spitzer"]}, {"name": ["Michael", "Mingueneau"]}, {"name": ["Sean", "C.", "Bendall"]}, {"name": ["Oren", "Litvin"]}, {"name": ["Erica", "Stone"]}, {"name": ["Dana", "Pe'Er"]}, {"name": ["Garry", "P.", "Nolan"]}], "year": "2014", "month": "11", "pages": "1250689", "abstract": "Cellular circuits sense the environment, process signals, and compute decisions using networks of interacting proteins. To model such a system, the abundance of each activated protein species can be described as a stochastic function of the abundance of other proteins. High-dimensional single-cell technologies, such as mass cytometry, offer an opportunity to characterize signaling circuit-wide. However, the challenge of developing and applying computational approaches to interpret such complex data remains. Here, we developed computational methods, based on established statistical concepts, to characterize signaling network relationships by quantifying the strengths of network edges and deriving signaling response functions. In comparing signaling between naïve and antigen-exposed CD4+ T lymphocytes, we find that although these two cell subtypes had similarly wired networks, naïve cells transmitted more information along a key signaling cascade than did antigen-exposed cells. We validated our characterization on mice lacking the extracellular-regulated mitogen-activated protein kinase (MAPK) ERK2, which showed stronger influence of pERK on pS6 (phosphorylated-ribosomal protein S6), in naïve cells as compared with antigen-exposed cells, as predicted. We demonstrate that by using cell-to-cell variation inherent in single-cell data, we can derive response functions underlying molecular circuits and drive the understanding of how cells process signals.", "publisher": "American Association for the Advancement of Science", "periodical": "Science", "keywords": [], "urls": [{"href": "https://www.science.org/doi/10.1126/science.1250689"}], "volume": 346, "issue": "6213", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:M3ejUd6NZC8C", "journal_source": "Science", "cites": 220}, {"title": "Multiparameter Single Cell Profiling of Airway Inflammatory Cells", "type": "Journal Article", "authors": [{"name": ["Yi", "Yao"]}, {"name": ["Tobias", "Welp"]}, {"name": ["Qing", "Liu"]}, {"name": ["Naiqian", "Niu"]}, {"name": ["Xiaomei", "Wang"]}, {"name": ["Clemente", "J.", "Britto"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Geoffrey", "L.", "Chupp"]}, {"name": ["Ruth", "R.", "Montgomery"]}], "year": "2017", "month": "1", "pages": "12-20", "abstract": "Airway diseases affect over 7% of the U.S. population and millions of patients worldwide. Asthmatic patients have wide variation in clinical severity with different clinical and physiologic manifestations of disease that may be driven by distinct biologic mechanisms. Further, the immunologic underpinnings of this complex trait disease are heterogeneous and treatment success depends on defining subgroups of asthmatics. Because of the limited availability and number of cells from the lung, the active site, in-depth investigation has been challenging. Recent advances in technology support transcriptional analysis of cells from induced sputum. Flow cytometry studies have described cells present in the sputum but a detailed analysis of these subsets is lacking. Mass cytometry or CyTOF (Cytometry by Time-Of-Flight) offers tremendous opportunities for multiparameter single cell analysis. Experiments can now allow detection of up to ∼40 markers to facilitate unprecedented multidimensional cellular analyses. Here we demonstrate the use of CyTOF on primary airway samples obtained from well-characterized patients with asthma and cystic fibrosis. Using this technology, we quantify cellular frequency and functional status of defined cell subsets. Our studies provide a blueprint to define the heterogeneity among subjects and underscore the power of this single cell method to characterize airway immune status. © 2016 International Clinical Cytometry Society.", "publisher": "John Wiley & Sons, Ltd", "periodical": "Cytometry Part B: Clinical Cytometry", "keywords": ["CyTOF", "asthma", "cystic fibrosis", "eosinophil", "immune response", "lung disease", "mass cytometry", "neutrophils", "sputum"], "urls": [{"href": "https://onlinelibrary.wiley.com/doi/full/10.1002/cyto.b.21491"}, {"href": "https://onlinelibrary.wiley.com/doi/abs/10.1002/cyto.b.21491"}, {"href": "https://onlinelibrary.wiley.com/doi/10.1002/cyto.b.21491"}], "volume": null, "issue": "1"}, {"title": "Learning Edge Rewiring in EMT From Single Cell Data", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Nevena", "Zivanovic"]}, {"name": ["Roshan", "Sharma"]}, {"name": ["Dana", "Pe’er"]}, {"name": ["Bernd", "Bodenmiller"]}], "year": "2017", "month": "6", "pages": "155028", "abstract": "Cellular regulatory networks are not static, but continuously reconfigure in response to stimuli via alterations in gene expression and protein confirmations. However, typical computational approaches treat them as static interaction networks derived from a single experimental time point. Here, we provide a method for learning the dynamic modulation, or rewiring of pairwise relationships (edges) from a static single-cell data. We use the epithelial-to-mesenchymal transition (EMT) in murine breast cancer cells as a model system, and measure mass cytometry data three days after induction of the transition by TGFβ. We take advantage of transitional rate variability between cells in the data by deriving a pseudo-time EMT trajectory. Then we propose methods for visualizing and quantifying time-varying edge behavior over the trajectory and use these methods: TIDES (Trajectory Imputed DREMI scores), and measure of edge dynamism (3DDREMI) to predict and validate the effect of drug perturbations on EMT.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/155028v1"}, {"href": "https://www.biorxiv.org/content/10.1101/155028v1.abstract"}], "volume": null, "issue": null}, {"title": "Mapping Regulatory Networks of Autism Risk at Cellular Resolution During Neurodevelopment", "type": "generic", "authors": [{"name": ["Rebecca", "Muhle"]}, {"name": ["Wei", "Niu"]}, {"name": ["Guillermina", "Hill-Teran"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Martina", "Krenzer"]}, {"name": ["Sarah", "Abdallah"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["James", "Noonan"]}], "year": "2017", "month": "10", "pages": null, "abstract": null, "publisher": "AACAP", "periodical": null, "keywords": [], "urls": [{"href": "https://aacap-old.confex.com/aacap/2017/meetingapp.cgi/Paper/30340"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:1Ye0OR6EYb4C", "journal_source": "64th Annual Meeting", "cites": 1}, {"title": "Abstract 977: Phenotypic analysis of single-cell breast cancer inhibition data reveals insights into EMT", "type": "Journal Article", "authors": [{"name": ["William", "S.", "Chen"]}, {"name": ["Nevena", "Zivanovic"]}, {"name": ["Dana", "Pe'er"]}, {"name": ["Bernd", "Bodenmiller"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2017", "month": "7", "pages": "977-977", "abstract": "Background: A leading model of cancer metastasis is epithelial-to-mesenchymal transition (EMT). We sought to determine whether single-cell inhibition data targeting potential mediators of EMT could uncover mechanistic insights into the EMT process.Methods: EMT was artificially induced on Py2T murine breast cancer cells by TGFb treatment. Additionally, a unique drug inhibitor was added to each well of a multiplexed CyTOF experiment. 37 transcription factors and cell surface markers were measured in each cell to assess epithelial and mesenchymal states, SMAD, AKT, and MAPK signaling activity, cell cycle regulation, and apoptosis pathway activation. The final single-cell dataset consisted of 300 inhibition and control conditions (cell populations), which we aimed to characterize in relation to one another with respect to effect on EMT.Analyzing the similarity between drug inhibitions amounts to a novel type of clustering problem that involves computing the similarity between diverse cell populations generated by each inhibitor. Traditional methods for comparing cell populations are not robust to the intra-population heterogeneity we observed amongst cells undergoing EMT. Thus, we developed Phenotypic Earth Mover’s Distance (PhEMD). This method for comparing cell populations leverages the insight that only a limited number of “cell subtypes” (e.g. mesenchymal, epithelial, transitional) are observed in unperturbed and perturbed EMT. By classifying each cell as one of these distinct subtypes using community-detection based clustering, PhEMD represents an inhibition or control condition as its relative abundance of each cell subtype. It then uses Earth Mover’s Distance (EMD) to compare two relative abundance distributions (i.e. heterogeneous cell populations). PhEMD thus derives a single value representing the dissimilarity between two inhibition conditions. Using PhEMD as measure of dissimilarity between each pair of inhibition and control conditions, we constructed an inhibitor-inhibitor graph and used graph clustering to identify groups of inhibitors that had similar effects to one another.Results: PhEMD analysis revealed that MEK, EGFR and Src inhibitors significantly halted EMT by generating far fewer mesenchymal cells and maintaining a large epithelial cell subpopulation. PhEMD also revealed that different mTOR, PI3K, and Akt inhibitors tended to have similar effects to one another and collectively generated a distinct, transitional cell subpopulation with altered pS6 expression. The pS6 dysregulation may be explained by the fact that ribosomal protein S6 is downstream of PI3K/AKT/mTOR, and the intermediate levels of both E-cadherin and vimentin suggest that this subset of cells may have been halted mid-transition. Finally, several Aurora Kinase and CDK inhibitors resulted in a relatively high percentage of apoptotic cells, suggesting these kinases may be important cell cycle regulators in the context of EMT.Citation Format: William S. Chen, Nevena Zivanovic, Dana Pe'er, Bernd Bodenmiller, Smita Krishnaswamy. Phenotypic analysis of single-cell breast cancer inhibition data reveals insights into EMT [abstract]. In: Proceedings of the American Association for Cancer Research Annual Meeting 2017; 2017 Apr 1-5; Washington, DC. Philadelphia (PA): AACR; Cancer Res 2017;77(13 Suppl):Abstract nr 977. doi:10.1158/1538-7445.AM2017-977", "publisher": "American Association for Cancer Research", "periodical": "Cancer Research", "keywords": [], "urls": [{"href": "https://aacrjournals.org/cancerres/article/77/13_Supplement/977/622124/Abstract-977-Phenotypic-analysis-of-single-cell"}], "volume": null, "issue": "13_Supplement"}, {"title": "Geometry Based Data Generation", "type": "Journal Article", "authors": [{"name": ["Ofir", "Lindenbaum"]}, {"name": ["Jay", "S", "Stanley"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2018", "month": null, "pages": null, "abstract": "We propose a new type of generative model for high-dimensional data that learns a manifold geometry of the data, rather than density, and can generate points evenly along this manifold. This is in contrast to existing generative models that represent data density, and are strongly affected by noise and other artifacts of data collection. We demonstrate how this approach corrects sampling biases and artifacts, thus improves several downstream data analysis tasks, such as clustering and classification. Finally, we demonstrate that this approach is especially useful in biology where, despite the advent of single-cell technologies, rare subpopulations and gene-interaction relationships are affected by biased sampling. We show that SUGAR can generate hypothetical populations, and it is able to reveal intrinsic patterns and mutual-information relationships between genes on a single-cell RNA sequencing dataset of hematopoiesis.", "publisher": null, "periodical": "Advances in Neural Information Processing Systems", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Data Generation Based on Diffusion Geometry", "type": "generic", "authors": [{"name": ["Ofir", "Lindenbaum"]}, {"name": ["Jay", "S.", "Stanley", "III"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2018", "month": "6", "pages": null, "abstract": "Many generative models attempt to replicate the density of their input data. However, this approach is often undesirable, since data density is highly affected by sampling biases, noise, and artifacts. We propose a method called SUGAR (Synthesis Using Geometrically Aligned Random-walks) that uses a diffusion process to learn a manifold geometry from the data. Then, it generates new points evenly along the manifold by pulling randomly generated points into its intrinsic structure using a diffusion kernel. SUGAR equalizes the density along the manifold by selectively generating points in sparse areas of the manifold. We demonstrate how the approach corrects sampling biases and artifacts, while also revealing intrinsic patterns (e.g. progression) and relations in the data.", "publisher": null, "periodical": null, "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Deep Neural Networks: A New Framework for Modeling Biological Vision and Brain Information Processing", "type": "Journal Article", "authors": [{"name": ["Nikolaus", "Kriegeskorte"]}], "year": "2015", "month": "11", "pages": "417-446", "abstract": "Recent advances in neural network modeling have enabled major strides in computer vision and other artificial intelligence applications. Human-level visual recognition abilities are coming within reach of artificial systems. Artificial neural networks are inspired by the brain, and their computations could be implemented in biological neurons. Convolutional feedforward networks, which now dominate computer vision, take further inspiration from the architecture of the primate visual hierarchy. However, the current models are designed with engineering goals, not to model brain computations. Nevertheless, initial studies comparing internal representations between these models and primate brains find surprisingly similar representational spaces. With human-level performance no longer out of reach, we are entering an exciting new era, in which we will be able to build biologically faithful feedforward and recurrent computational models of how biological brains perform high-level feats of intelligence, including vision.", "publisher": "Annual Reviews", "periodical": "Annual Review of Vision Science", "keywords": [], "urls": [], "volume": null, "issue": "1"}, {"title": "Manifold learning-based methods for analyzing single-cell RNA-sequencing data", "type": "Journal Article", "authors": [{"name": ["Kevin", "R.", "Moon"]}, {"name": ["Jay", "S.", "Stanley"]}, {"name": ["Daniel", "Burkhardt"]}, {"name": ["David", "v.", "van Dijk"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2018", "month": "2", "pages": "36-46", "abstract": "Recent advances in single-cell RNA sequencing technologies enable deep insights into cellular development, gene regulation, and phenotypic diversity by measuring gene expression for thousands of cells in a single experiment. While these technologies hold great potential for improving our understanding of cellular states and progression, they also pose new challenges and require advanced mathematical and algorithmic tools to extract underlying biological signals. In this review, we cover one of the most promising avenues of research into unlocking the potential of scRNA-seq data: the field of manifold learning, and the related manifold assumption in data analysis. Manifold learning provides a powerful structure for algorithmic approaches to process the data, extract its dynamics, and infer patterns in it. In particular, we cover manifold learning-based methods for denoising the data, revealing gene interactions, extracting pseudotime progressions with model fitting, visualizing the cellular state space via dimensionality reduction, and clustering the data.", "publisher": "Elsevier", "periodical": "Current Opinion in Systems Biology", "keywords": ["Data mining", "Gene regulatory networks", "Imputation", "Manifold learning", "Pseudotime trends", "Single cell RNA sequencing"], "urls": [], "volume": 7, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:-7ulzOJl1JYC", "journal_source": "Current Opinion in Systems Biology", "cites": 105}, {"title": "Out-of-Sample Extrapolation with Neuron Editing", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["David", "van Dijk"]}, {"name": ["Ruth", "Montgomery"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2018", "month": "5", "pages": null, "abstract": "While neural networks can be trained to map from one specific dataset to\nanother, they usually do not learn a generalized transformation that can\nextrapolate accurately outside the space of training. For instance, a\ngenerative adversarial network (GAN) exclusively trained to transform images of\nblack-haired men to blond-haired men might not have the same effect on images\nof black-haired women. This is because neural networks are good at generation\nwithin the manifold of the data that they are trained on. However, generating\nnew samples outside of the manifold or extrapolating \"out-of-sample\" is a much\nharder problem that has been less well studied. To address this, we introduce a\ntechnique called neuron editing that learns how neurons encode an edit for a\nparticular transformation in a latent space. We use an autoencoder to decompose\nthe variation within the dataset into activations of different neurons and\ngenerate transformed data by defining an editing transformation on those\nneurons. By performing the transformation in a latent trained space, we encode\nfairly complex and non-linear transformations to the data with much simpler\ndistribution shifts to the neuron's activations. We motivate our technique on\nan image domain and then move to our two main biological applications: removal\nof batch artifacts representing unwanted noise and modeling the effect of drug\ntreatments to predict synergy between drugs.", "publisher": null, "periodical": null, "keywords": [], "urls": [{"href": "https://arxiv.org/abs/1805.12198v4"}], "volume": null, "issue": null}, {"title": "Abstract 5306: SAUCIE: Sparse autoencoder for unsupervised clustering, imputation, and embedding", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Krishnan", "Srinivasan"]}, {"name": ["David", "van", "Dijk"]}, {"name": ["Hussein", "Mohsen"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Rebecca", "Muhle"]}, {"name": ["Kevin", "Moon"]}, {"name": ["Ruth", "Montgomery"]}, {"name": ["James", "Noonan"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2018", "month": "7", "pages": "5306-5306", "abstract": "Handling the vast amounts of single-cell RNA-sequencing and CyTOF data, now being generated in patient cohorts, presents a computational challenge due to the noise, complexity, sparsity and batch effects present. Here, we propose a unified deep neural network approach to automatically process and extract structure from these massive datasets. Our unsupervised architecture, called SAUCIE (Sparse Autoencoder for Unsupervised Clustering, Imputation, and Embedding), simultaneously performs several key tasks for single-cell data analysis including 1) clustering, 2) batch correction, 3) visualization, and 4) denoising/imputation. SAUCIE is trained to recreate its own input after reducing its dimensionality in a 2-D embedding layer which can be used to visualize the data. Additionally, it uses two novel regularizations: (1) an information dimension regularization to penalize entropy as computed on normalized activation values of the layer, and thereby encourage binary-like encodings that are amenable to clustering and (2) a Maximal Mean Discrepancy penalty to correct batch effects. Thus SAUCIE has a single architecture that denoises, batch-corrects, visualizes and clusters data using a unified representation. We show results on artificial data where ground truth is known, as well as mass cytometry data from patients undergoing immunotherapy, dengue-infected patients, and single-cell RNA-sequencing data from embryonic mouse brain.Citation Format: Matthew Amodio, Krishnan Srinivasan, David van Dijk, Hussein Mohsen, Kristina Yim, Rebecca Muhle, Kevin Moon, Ruth Montgomery, James Noonan, Guy Wolf, Smita Krishnaswamy. SAUCIE: Sparse autoencoder for unsupervised clustering, imputation, and embedding [abstract]. In: Proceedings of the American Association for Cancer Research Annual Meeting 2018; 2018 Apr 14-18; Chicago, IL. Philadelphia (PA): AACR; Cancer Res 2018;78(13 Suppl):Abstract nr 5306.", "publisher": "American Association for Cancer Research", "periodical": "Cancer Research", "keywords": [], "urls": [{"href": "https://aacrjournals.org/cancerres/article/78/13_Supplement/5306/629863/Abstract-5306-SAUCIE-Sparse-autoencoder-for"}], "volume": null, "issue": "13_Supplement"}, {"title": "MAGAN: Aligning Biological Manifolds", "type": "generic", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2018", "month": "7", "pages": "215-223", "abstract": "It is increasingly common in many types of natural and physical systems (especially biological systems) to have different types of measurements performed on the same underlying system. In such settings, it is important to align the man-ifolds arising from each measurement in order to integrate such data and gain an improved picture of the system; we tackle this problem using generative adversarial networks (GANs). Recent attempts to use GANs to find correspondences between sets of samples do not explicitly perform proper alignment of manifolds. We present the new Manifold Aligning GAN (MAGAN) that aligns two manifolds such that related points in each measurement space are aligned. We demonstrate applications of MAGAN in single-cell biology in integrating two different measurement types together: cells from the same tissue are measured with both genomic (single-cell RNA-sequencing) and proteomic (mass cytometry) technologies. We show that MAGAN successfully aligns manifolds such that known correlations between measured markers are improved compared to other recently proposed models.", "publisher": "PMLR", "periodical": null, "keywords": [], "urls": [{"href": "https://proceedings.mlr.press/v80/amodio18a.html"}], "volume": null, "issue": null}, {"title": "Recovering Gene Interactions from Single-Cell Data Using Data Diffusion", "type": "Journal Article", "authors": [{"name": ["David", "van Dijk"]}, {"name": ["Roshan", "Sharma"]}, {"name": ["Juozas", "Nainys"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Pooja", "Kathail"]}, {"name": ["Ambrose", "J.", "Carr"]}, {"name": ["Cassandra", "Burdziak"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Christine", "L.", "Chaffer"]}, {"name": ["Diwakar", "Pattabiraman"]}, {"name": ["Brian", "Bierie"]}, {"name": ["Linas", "Mazutis"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Dana", "Pe'er"]}], "year": "2018", "month": "7", "pages": "716-729.e27", "abstract": "Single-cell RNA sequencing technologies suffer from many sources of technical noise, including under-sampling of mRNA molecules, often termed “dropout,” which can severely obscure important gene-gene relationships. To address this, we developed MAGIC (Markov affinity-based graph imputation of cells), a method that shares information across similar cells, via data diffusion, to denoise the cell count matrix and fill in missing transcripts. We validate MAGIC on several biological systems and find it effective at recovering gene-gene relationships and additional structures. Applied to the epithilial to mesenchymal transition, MAGIC reveals a phenotypic continuum, with the majority of cells residing in intermediate states that display stem-like signatures, and infers known and previously uncharacterized regulatory interactions, demonstrating that our approach can successfully uncover regulatory relations without perturbations. A new algorithm overcomes limitations of data loss in single-cell sequencing experiments.", "publisher": "Cell Press", "periodical": "Cell", "keywords": ["EMT", "imputation", "manifold learning", "regulatory networks", "single-cell RNA sequencing"], "urls": [], "volume": null, "issue": "3"}, {"title": "Identification and Analysis of Islet Antigen–Specific CD8+ T Cells with T Cell Libraries", "type": "Journal Article", "authors": [{"name": ["Hideki", "Ogura"]}, {"name": ["Paula", "Preston-Hurlburt"]}, {"name": ["Ana", "Luisa", "Perdigoto"]}, {"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Pamela", "Clark"]}, {"name": ["Hua", "Yu"]}, {"name": ["Dieter", "Egli"]}, {"name": ["Alexandra", "Fouts"]}, {"name": ["Andrea", "K.", "Steck"]}, {"name": ["Kevan", "C.", "Herold"]}], "year": "2018", "month": "9", "pages": "1662-1670", "abstract": "Type 1 diabetes (T1D) is most likely caused by killing of β cells by autoreactive CD8+ T cells. Methods to isolate and identify these cells are limited by their low frequency in the peripheral blood. We analyzed CD8+ T cells, reactive with diabetes Ags, with T cell libraries and further characterized their phenotype by CyTOF using class I MHC tetramers. In the libraries, the frequency of islet Ag–specific CD45RO+IFN-γ+CD8+ T cells was higher in patients with T1D compared with healthy control subjects. Ag-specific cells from the libraries of patients with T1D were reactive with ZnT8186–194, whereas those from healthy control recognized ZnT8186–194 and other Ags. ZnT8186–194-reactive CD8+ cells expressed an activation phenotype in T1D patients. We found TCR sequences that were used in multiple library wells from patients with T1D, but these sequences were private and not shared between individuals. These sequences could identify the Ag-specific T cells on a repeated draw, ex vivo in the IFN-γ+ CD8+ T cell subset. We conclude that CD8+ T cell libraries can identify Ag-specific T cells in patients with T1D. The T cell clonotypes can be tracked in vivo with identification of the TCR gene sequences.", "publisher": "American Association of Immunologists", "periodical": "The Journal of Immunology", "keywords": [], "urls": [{"href": "https://journals.aai.org/jimmunol/article/201/6/1662/106906/Identification-and-Analysis-of-Islet-Antigen"}], "volume": 201, "issue": "6", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:RoXSNcbkSzsC", "journal_source": "The Journal of Immunology", "cites": 15}, {"title": "Learning time-varying information flow from single-cell epithelial to mesenchymal transition data", "type": "Journal Article", "authors": [{"name": ["Smita", "Krishnaswamy"]}, {"name": ["Nevena", "Zivanovic"]}, {"name": ["Roshan", "Sharma"]}, {"name": ["Dana", "Pe'Er"]}, {"name": ["Bernd", "Bodenmiller"]}], "year": "2018", "month": "10", "pages": "e0203389", "abstract": "Cellular regulatory networks are not static, but continuously reconfigure in response to stimuli via alterations in protein abundance and confirmation. However, typical computational approaches treat them as static interaction networks derived from a single time point. Here, we provide methods for learning the dynamic modulation of relationships between proteins from static single-cell data. We demonstrate our approach using TGFß induced epithelial-to-mesenchymal transition (EMT) in murine breast cancer cell line, profiled with mass cytometry. We take advantage of the asynchronous rate of transition to EMT in the data and derive a pseudotime EMT trajectory. We propose methods for visualizing and quantifying time-varying edge behavior over the trajectory, and a metric of edge dynamism to predict the effect of drug perturbations on EMT.", "publisher": "Public Library of Science", "periodical": "PLOS ONE", "keywords": ["Cytometry", "Epithelial cells", "Kernel functions", "Probability density", "Slugs", "Tides", "Transcription factors", "Vimentin"], "urls": [{"href": "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0203389"}], "volume": 13, "issue": "10", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:O0nohqN1r9EC", "journal_source": "PLoS One", "cites": 14}, {"title": "Embedding single-cell experimental conditions to reveal manifold structure of cancer drug perturbation effects", "type": "Journal Article", "authors": [{"name": ["William", "S.", "Chen"]}, {"name": ["Nevena", "Zivanovic"]}, {"name": ["David", "van", "Dijk"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Bernd", "Bodenmiller"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "2", "pages": "455436", "abstract": "Previously, the effect of a drug on a cell population was measured based on simple metrics such as cell viability. However, as single-cell technologies are becoming more advanced, drug screen experiments can now be conducted with more complex readouts such as gene expression profiles of individual cells. The increasing complexity of measurements from these multi-sample experiments calls for more sophisticated analytical approaches than are currently available. We developed a novel method called PhEMD (Phenotypic Earth Mover’s Distance) and show that it can be used to embed the space of drug perturbations on the basis of the drugs’ effects on cell populations. When testing PhEMD on a newly-generated, 300-sample CyTOF kinase inhibition screen experiment, we find that the state space of the perturbation conditions is surprisingly low-dimensional and that the network of drugs demonstrates manifold structure. We show that because of the fairly simple manifold geometry of the 300 samples, we can accurately capture the full range of drug effects using a dictionary of only 30 experimental conditions. We also show that new drugs can be added to our PhEMD embedding using similarities inferred from other characterizations of drugs using a technique called Nystrom extension. Our findings suggest that large-scale drug screens can be conducted by measuring only a small fraction of the drugs using the most expensive high-throughput single-cell technologies—the effects of other drugs may be inferred by mapping and extending the perturbation space. We additionally show that PhEMD can be useful for analyzing other types of single-cell samples, such as patient tumor biopsies, by mapping the patient state space in a similar way as the drug state space. We demonstrate that PhEMD is scalable, compatible with leading batch effect correction techniques, and generalizable to multiple experimental designs. Altogether, our analyses suggest that PhEMD may facilitate drug discovery efforts and help uncover the network geometry of a collection of single-cell samples.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/455436v3"}, {"href": "https://www.biorxiv.org/content/10.1101/455436v3.abstract"}], "volume": null, "issue": null}, {"title": "Macrophage Migration Inhibitory Factor Regulates U1 Small Nuclear RNP Immune Complex–Mediated Activation of the NLRP3 Inflammasome", "type": "Journal Article", "authors": [{"name": ["Min", "Sun", "Shin"]}, {"name": ["Youna", "Kang"]}, {"name": ["Elizabeth", "R.", "Wahl"]}, {"name": ["Hong", "Jai", "Park"]}, {"name": ["Rossitza", "Lazova"]}, {"name": ["Lin", "Leng"]}, {"name": ["Mark", "Mamula"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Richard", "Bucala"]}, {"name": ["Insoo", "Kang"]}], "year": "2019", "month": "1", "pages": "109-120", "abstract": "Objective: High-expression alleles of macrophage migration inhibitory factor (MIF) are linked genetically to the severity of systemic lupus erythematosus (SLE). The U1 small nuclear RNP (snRNP) immune complex containing U1 snRNP and anti–U1 snRNP antibodies, which are found in patients with SLE, activates the NLRP3 inflammasome, comprising NLRP3, ASC, and procaspase 1, in human monocytes, leading to the production of interleukin-1β (IL-1β). This study was undertaken to investigate the role of the snRNP immune complex in up-regulating the expression of MIF and its interface with the NLRP3 inflammasome. Methods: MIF, IL-1β, NLRP3, caspase 1, ASC, and MIF receptors were analyzed by enzyme-linked immunosorbent assay, Western blotting, quantitative polymerase chain reaction, and cytometry by time-of-flight mass spectrometry (CytoF) in human monocytes incubated with or without the snRNP immune complex. MIF pathway responses were probed with the novel small molecule antagonist MIF098. Results: The snRNP immune complex induced the production of MIF and IL-1β from human monocytes. High-dimensional, single-cell CytoF analysis established that MIF regulates activation of the NLRP3 inflammasome, including findings of a quantitative relationship between MIF and its receptors and IL-1β levels in the monocytes. MIF098, which blocks MIF binding to its cognate receptor, suppressed the production of IL-1β, the up-regulation of NLRP3, which is a rate-limiting step in NLRP3 inflammasome activation, and the activation of caspase 1 in snRNP immune complex–stimulated human monocytes. Conclusion: The U1 snRNP immune complex is a specific stimulus of MIF production in human monocytes, with MIF having an upstream role in defining the inflammatory characteristics of activated monocytes by regulating NLRP3 inflammasome activation and downstream IL-1β production. These findings provide mechanistic insight and a therapeutic rationale for targeting MIF in subgroups of lupus patients, such as those classified as high genotypic MIF expressers or those with anti-snRNP antibodies.", "publisher": "John Wiley and Sons Inc.", "periodical": "Arthritis and Rheumatology", "keywords": [], "urls": [{"href": "https://onlinelibrary.wiley.com/doi/full/10.1002/art.40672"}, {"href": "https://onlinelibrary.wiley.com/doi/abs/10.1002/art.40672"}, {"href": "https://onlinelibrary.wiley.com/doi/10.1002/art.40672"}], "volume": null, "issue": "1"}, {"title": "TraVeLGAN: Image-To-Image Translation by Transformation Vector Learning", "type": "generic", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": null, "pages": "8983-8992", "abstract": "Interest in image-to-image translation has grown substantially in recent years with the success of unsupervised models based on the cycle-consistency assumption. The achievements of these models have been limited to a particular subset of domains where this assumption yields good results, namely homogeneous domains that are characterized by style or texture differences. We tackle the challenging problem of image-to-image translation where the domains are defined by high-level shapes and contexts, as well as including significant clutter and heterogeneity. For this purpose, we introduce a novel GAN based on preserving intra-domain vector transformations in a latent space learned by a siamese network. The traditional GAN system introduced a discriminator network to guide the generator into generating images in the target domain. To this two-network system we add a third: a siamese network that guides the generator so that each original image shares semantics with its generated version. With this new three-network system, we no longer need to constrain the generators with the ubiquitous cycle-consistency restraint. As a result, the generators can learn mappings between more complex domains that differ from each other by large differences not just style or texture.", "publisher": null, "periodical": null, "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Visualizing the PHATE of Neural Networks", "type": "Journal Article", "authors": [{"name": ["Scott", "Gigante"]}, {"name": ["Adam", "S.", "Charles"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Gal", "Mishne"]}], "year": "2019", "month": null, "pages": null, "abstract": null, "publisher": null, "periodical": "Advances in Neural Information Processing Systems", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Generating and Aligning from Data Geometries with Generative Adversarial Networks", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "1", "pages": null, "abstract": "Unsupervised domain mapping has attracted substantial attention in recent\nyears due to the success of models based on the cycle-consistency assumption.\nThese models map between two domains by fooling a probabilistic discriminator,\nthereby matching the probability distributions of the real and generated data.\nInstead of this probabilistic approach, we cast the problem in terms of\naligning the geometry of the manifolds of the two domains. We introduce the\nManifold Geometry Matching Generative Adversarial Network (MGM GAN), which adds\ntwo novel mechanisms to facilitate GANs sampling from the geometry of the\nmanifold rather than the density and then aligning two manifold geometries: (1)\nan importance sampling technique that reweights points based on their density\non the manifold, making the discriminator only able to discern geometry and (2)\na penalty adapted from traditional manifold alignment literature that\nexplicitly enforces the geometry to be preserved. The MGM GAN leverages the\nmanifolds arising from a pre-trained autoencoder to bridge the gap between\nformal manifold alignment literature and existing GAN work, and demonstrate the\nadvantages of modeling the manifold geometry over its density.", "publisher": null, "periodical": null, "keywords": [], "urls": [{"href": "https://arxiv.org/abs/1901.08177v1"}], "volume": 8177, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:3bvyWxjaHKcC", "journal_source": "arXiv preprint arXiv:1901.", "cites": 0}, {"title": "Quantifying the effect of experimental perturbations at single-cell resolution", "type": "Journal Article", "authors": [{"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Jay", "S.", "Stanley"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Ana", "Luisa", "Perdigoto"]}, {"name": ["Scott", "A.", "Gigante"]}, {"name": ["Kevan", "C.", "Herold"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Antonio", "J.", "Giraldez"]}, {"name": ["David", "van", "Dijk"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "12", "pages": "532846", "abstract": "Current methods for comparing scRNA-seq datasets collected in multiple conditions focus on discrete regions of the transcriptional state space, such as clusters of cells. Here, we quantify the effects of perturbations at the single-cell level using a continuous measure of the effect of a perturbation across the transcriptomic space. We describe this space as a manifold and develop a relative likelihood estimate of observing each cell in each of the experimental conditions using graph signal processing. This likelihood estimate can be used to identify cell populations specifically affected by a perturbation. We also develop vertex frequency clustering to extract populations of affected cells at the level of granularity that matches the perturbation response. The accuracy of our algorithm to identify clusters of cells that are enriched or depleted in each condition is on average 57% higher than the next best-performing algorithm tested. Gene signatures derived from these clusters are more accurate compared to six alternative algorithms in ground-truth comparisons.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/532846v4"}, {"href": "https://www.biorxiv.org/content/10.1101/532846v4.abstract"}], "volume": 39, "issue": 5, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:-nhnvRiOwuoC", "journal_source": "Nature biotechnology", "cites": 68}, {"title": "Modeling Global Dynamics from Local Snapshots with Deep Generative Neural Networks", "type": "Journal Article", "authors": [{"name": ["Scott", "Gigante"]}, {"name": ["David", "Van Dijk"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Alexander", "Strzalkowski"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "7", "pages": null, "abstract": "Complex high dimensional stochastic dynamic systems arise in many applications in the natural sciences and especially biology. However, while these systems are difficult to describe analytically, \"snapshot\" measurements that sample the output of the system are often available. In order to model the dynamics of such systems given snapshot data, or local transitions, we present a deep neural network framework we call Dynamics Modeling Network or DyMoN. DyMoN is a neural network framework trained as a deep generative Markov model whose next state is a probability distribution based on the current state. DyMoN is trained using samples of current and next-state pairs, and thus does not require longitudinal measurements. We show the advantage of DyMoN over shallow models such as Kalman filters and hidden Markov models, and other deep models such as recurrent neural networks in its ability to embody the dynamics (which can be studied via perturbation of the neural network) and generate longitudinal hypothetical trajectories. We perform three case studies in which we apply DyMoN to different types of biological systems and extract features of the dynamics in each case by examining the learned model.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "2019 13th International Conference on Sampling Theory and Applications, SampTA 2019", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Compressed Diffusion", "type": "Journal Article", "authors": [{"name": ["Scott", "Gigante"]}, {"name": ["Jay", "S.", "Stanley"]}, {"name": ["Ngan", "Vu"]}, {"name": ["David", "Van Dijk"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "7", "pages": null, "abstract": "Diffusion maps are a commonly used kernel-based method for manifold learning, which can reveal intrinsic structures in data and embed them in low dimensions. However, as with most kernel methods, its implementation requires a heavy computational load, reaching up to cubic complexity in the number of data points. This limits its usability in modern data analysis. Here, we present a new approach to computing the diffusion geometry, and related embeddings, from a compressed diffusion process between data regions rather than data points. Our construction is based on an adaptation of the previously proposed measure-based Gaussian correlation (MGC) kernel that robustly captures the local geometry around data points. We use this MGC kernel to efficiently compress diffusion relations from pointwise to data region resolution. Finally, a spectral embedding of the data regions provides coordinates that are used to interpolate and approximate the pointwise diffusion map embedding of data. We analyze theoretical connections between our construction and the original diffusion geometry of diffusion maps, and demonstrate the utility of our method in analyzing big datasets, where it outperforms competing approaches.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "2019 13th International Conference on Sampling Theory and Applications, SampTA 2019", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Compressed Diffusion", "type": "Journal Article", "authors": [{"name": ["Scott", "Gigante"]}, {"name": ["Jay", "S.", "Stanley"]}, {"name": ["Ngan", "Vu"]}, {"name": ["David", "Van Dijk"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "7", "pages": null, "abstract": "Diffusion maps are a commonly used kernel-based method for manifold learning, which can reveal intrinsic structures in data and embed them in low dimensions. However, as with most kernel methods, its implementation requires a heavy computational load, reaching up to cubic complexity in the number of data points. This limits its usability in modern data analysis. Here, we present a new approach to computing the diffusion geometry, and related embeddings, from a compressed diffusion process between data regions rather than data points. Our construction is based on an adaptation of the previously proposed measure-based Gaussian correlation (MGC) kernel that robustly captures the local geometry around data points. We use this MGC kernel to efficiently compress diffusion relations from pointwise to data region resolution. Finally, a spectral embedding of the data regions provides coordinates that are used to interpolate and approximate the pointwise diffusion map embedding of data. We analyze theoretical connections between our construction and the original diffusion geometry of diffusion maps, and demonstrate the utility of our method in analyzing big datasets, where it outperforms competing approaches.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "2019 13th International Conference on Sampling Theory and Applications, SampTA 2019", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Modeling Global Dynamics from Local Snapshots with Deep Generative Neural Networks", "type": "Journal Article", "authors": [{"name": ["Scott", "Gigante"]}, {"name": ["David", "Van Dijk"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Alexander", "Strzalkowski"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "7", "pages": null, "abstract": "Complex high dimensional stochastic dynamic systems arise in many applications in the natural sciences and especially biology. However, while these systems are difficult to describe analytically, \"snapshot\" measurements that sample the output of the system are often available. In order to model the dynamics of such systems given snapshot data, or local transitions, we present a deep neural network framework we call Dynamics Modeling Network or DyMoN. DyMoN is a neural network framework trained as a deep generative Markov model whose next state is a probability distribution based on the current state. DyMoN is trained using samples of current and next-state pairs, and thus does not require longitudinal measurements. We show the advantage of DyMoN over shallow models such as Kalman filters and hidden Markov models, and other deep models such as recurrent neural networks in its ability to embody the dynamics (which can be studied via perturbation of the neural network) and generate longitudinal hypothetical trajectories. We perform three case studies in which we apply DyMoN to different types of biological systems and extract features of the dynamics in each case by examining the learned model.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "2019 13th International Conference on Sampling Theory and Applications, SampTA 2019", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Vertex-Frequency Clustering", "type": "Journal Article", "authors": [{"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Jay", "S.", "Stanley"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "6", "pages": "145-149", "abstract": "We propose a novel approach for clustering the vertices of a graph. The method, Vertex-Frequency Clustering (VFC), considers the local harmonic content of one or many graph signals, forming partitions based on spectral features in the input signal. The method can be related to spectral clustering, and the length scale over which frequencies are considered is tunable. This allows one to cluster data based on intrinsic graph geometry in the context of signal dynamics. VFC is useful for unravelling active regions in a signal, collecting sets of similar observations, or detecting anomalies. We demonstrate the utility of VFC in synthetic and biological data, and show how VFC can be used to identify observations with similar feature sets and signal profiles.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "2019 IEEE Data Science Workshop, DSW 2019 - Proceedings", "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:SGW5VrABaM0C", "journal_source": "2019 IEEE Data Science Workshop (DSW)", "cites": 1}, {"title": "Dissecting alterations in human CD8+ T cells with aging by high-dimensional single cell mass cytometry", "type": "Journal Article", "authors": [{"name": ["Min", "Sun", "Shin"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Kevin", "Moon"]}, {"name": ["Hong", "Jai", "Park"]}, {"name": ["Subhasis", "Mohanty"]}, {"name": ["Joseph", "W.", "Kim"]}, {"name": ["Ruth", "R.", "Montgomery"]}, {"name": ["Albert", "C.", "Shaw"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Insoo", "Kang"]}], "year": "2019", "month": "3", "pages": "24-30", "abstract": "We investigated the effect of aging on the multi-dimensional characteristics and heterogeneity of human peripheral CD8 + T cells defined by the expression of a set of molecules at the single cell level using the recently developed mass cytometry or Cytometry by Time-Of-Flight (CyTOF) and computational algorithms. CD8 + T cells of young and older adults had differential expression of molecules, especially those related to cell activation and migration, permitting the clustering of young and older adults through an unbiased approach. The changes in the expression of individual molecules were collectively reflected in the altered high-dimensional profiles of CD8 + T cells in older adults as visualized by the dimensionality reduction analysis tools principal component analysis (PCA) and t-distributed stochastic neighbor embedding (t-SNE). A combination of PhenoGraph clustering and t-SNE analysis revealed heterogeneous subsets of CD8 + T cells that altered with aging. Furthermore, intermolecular quantitative relationships in CD8 + T cells appeared to change with age as determined by the computational algorithm conditional-Density Resampled Estimate of Mutual Information (DREMI). The results of our study showed that heterogeneity, multidimensional characteristics, and intermolecular quantitative relationships in human CD8 + T cells altered with age, distinctively clustering young and older adults through an unbiased approach.", "publisher": "Academic Press", "periodical": "Clinical Immunology", "keywords": ["Aging", "Heterogeneity", "High-dimensional analysis", "Human CD8+ T cells", "Mass cytometry"], "urls": [], "volume": 200, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:w0F2JDEymm0C", "journal_source": "Clinical Immunology", "cites": 14}, {"title": "Visualizing structure and transitions in high-dimensional biological data", "type": "Journal Article", "authors": [{"name": ["Kevin", "R.", "Moon"]}, {"name": ["David", "van Dijk"]}, {"name": ["Zheng", "Wang"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["William", "S.", "Chen"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Antonia", "van", "den", "Elzen"]}, {"name": ["Matthew", "J.", "Hirn"]}, {"name": ["Ronald", "R.", "Coifman"]}, {"name": ["Natalia", "B.", "Ivanova"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "12", "pages": "1482-1492", "abstract": "The high-dimensional data created by high-throughput technologies require visualization tools that reveal data structure and patterns in an intuitive form. We present PHATE, a visualization method that captures both local and global nonlinear structure using an information-geometric distance between data points. We compare PHATE to other tools on a variety of artificial and biological datasets, and find that it consistently preserves a range of patterns in data, including continual progressions, branches and clusters, better than other tools. We define a manifold preservation metric, which we call denoised embedding manifold preservation (DEMaP), and show that PHATE produces lower-dimensional embeddings that are quantitatively better denoised as compared to existing visualization methods. An analysis of a newly generated single-cell RNA sequencing dataset on human germ-layer differentiation demonstrates how PHATE reveals unique biological insight into the main developmental branches, including identification of three previously undescribed subpopulations. We also show that PHATE is applicable to a wide variety of data types, including mass cytometry, single-cell RNA sequencing, Hi-C and gut microbiome data. PHATE, a new data visualization tool, better preserves patterns in high-dimensional data after dimensionality reduction.", "publisher": "Nature Publishing Group", "periodical": "Nature Biotechnology 2019 37:12", "keywords": ["Data mining", "Machine learning"], "urls": [{"href": "https://www.nature.com/articles/s41587-019-0336-3"}], "volume": 37, "issue": "12", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:TlpoogIpr_IC", "journal_source": "Nature biotechnology", "cites": 533}, {"title": "Exploring single-cell data with deep multitasking neural networks", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["David", "van Dijk"]}, {"name": ["Krishnan", "Srinivasan"]}, {"name": ["William", "S.", "Chen"]}, {"name": ["Hussein", "Mohsen"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Allison", "Campbell"]}, {"name": ["Yujiao", "Zhao"]}, {"name": ["Xiaomei", "Wang"]}, {"name": ["Manjunatha", "Venkataswamy"]}, {"name": ["Anita", "Desai"]}, {"name": ["V.", "Ravi"]}, {"name": ["Priti", "Kumar"]}, {"name": ["Ruth", "Montgomery"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "10", "pages": "1139-1145", "abstract": "It is currently challenging to analyze single-cell data consisting of many cells and samples, and to address variations arising from batch effects and different sample preparations. For this purpose, we present SAUCIE, a deep neural network that combines parallelization and scalability offered by neural networks, with the deep representation of data that can be learned by them to perform many single-cell data analysis tasks. Our regularizations (penalties) render features learned in hidden layers of the neural network interpretable. On large, multi-patient datasets, SAUCIE’s various hidden layers contain denoised and batch-corrected data, a low-dimensional visualization and unsupervised clustering, as well as other information that can be used to explore the data. We analyze a 180-sample dataset consisting of 11 million T cells from dengue patients in India, measured with mass cytometry. SAUCIE can batch correct and identify cluster-based signatures of acute dengue infection and create a patient manifold, stratifying immune response to dengue. SAUCIE, a deep learning platform to analyze single-cell data across samples and platforms, allows information to be obtained from the internal layers of the network, which provides additional mechanistic understanding that can be used to further tune data analysis.", "publisher": "Nature Publishing Group", "periodical": "Nature Methods 2019 16:11", "keywords": ["Computational biology and bioinformatics", "Computational models", "Gene expression", "Machine learning"], "urls": [{"href": "https://www.nature.com/articles/s41592-019-0576-7"}], "volume": 16, "issue": "11", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:KaMxkj08jr0C", "journal_source": "Nature methods", "cites": 194}, {"title": "Final Results of a Phase II Prospective Trial Evaluating the Combination of Stereotactic Body Radiotherapy (SBRT) with Concurrent Pembrolizumab in Patients with Metastatic Non-Small Cell Lung Cancer (NSCLC)", "type": "Journal Article", "authors": [{"name": ["A.M.", "Campbell"]}, {"name": ["W.L.", "Cai"]}, {"name": ["D.", "Burkhardt"]}, {"name": ["S.N.", "Gettinger"]}, {"name": ["S.B.", "Goldberg"]}, {"name": ["M.", "Amodio"]}, {"name": ["S.", "Kaech"]}, {"name": ["S.", "Krishnaswamy"]}, {"name": ["R.H.", "Decker"]}], "year": "2019", "month": "9", "pages": "S36-S37", "abstract": "Purpose/Objective(s) We report the final results of a phase II prospective trial designed to assess the systemic or “abscopal” response rate in patients who received SBRT after progression on anti-PD-1 immunotherapy. Materials/Methods Patients with metastatic NSCLC and two or more measurable lesions were eligible. Histologic analysis of biopsy samples was performed at enrollment, and the number of tumor infiltrating lymphocytes (TILs) was given a qualitative score between 0-3. If patients had progressed on prior anti-PD-1 therapy at the time of enrollment they received SBRT up front and continued on pembrolizumab. If patients were immunotherapy naïve, they were enrolled and received pembrolizumab q3 weeks until disease progression, at which point they received SBRT and continued pembrolizumab. The systemic response to radiotherapy was evaluated using RECIST v 1.1 criteria (with omission of the radiated lesion). The overall response rate after SBRT was defined as the percentage of patients achieving a complete response (CR) or partial response (PR). The disease control rate was defined as the percentage of patients achieving a CR, PR, or stable disease (SD). Adverse events were measured using the common terminology criteria for adverse events (CTCAE) v4. Mass cytometry by time-of-flight (CyTOF) was performed on the peripheral blood of a subset of patients. Results 56 NSCLC patients enrolled in the phase II portion of the study. 50 patients were immunotherapy naïve and began pembrolizumab on trial. Of these 50 patients, 16 experienced disease progression and were deemed suitable candidates for SBRT. 6 patients had progressed on anti-PD-1 therapy at enrollment and received SBRT up front. Of the 22 patients allocated to SBRT, 21 completed treatment. The addition of SBRT to pembrolizumab resulted in a mean of 150.67 days before further disease progression. The disease control rate was 57.14%. There were 2 patients (9.52%) who achieved a PR sustained for > 1 year. There were 10 patients (47.62%) who achieved SD after SBRT. Patients with elevated TIL scores (2-3) showed improved progression free survival (PFS) when compared with patients that had lower TIL scores (0-1), with a mean of 215 versus 59 days respectively. Patients with an immune-related adverse event survived longer than patients with no immune-related adverse event, with a mean of 208 versus 88 days. CyTOF analysis showed patients with a systemic PR after SBRT had a population of CD8+ CD127- Ki-67+ CD45RO+ T cells that correlated with response. Conclusion The addition of SBRT after progression on immunotherapy resulted in increased PFS, a systemic response rate of 9.52%, and a disease control rate of 57.14%. Improved PFS correlated with an increased TIL score, the presence of an immune-related adverse event, and T cell activation status.", "publisher": "Elsevier BV", "periodical": "International Journal of Radiation Oncology*Biology*Physics", "keywords": ["AstraZeneca, Array, Merck, Epic Sciences, Genentech, BMS, Boehringer Ingelheim Honoraria", "AstraZeneca, Celgene, Takeda, Janssen, Genentech, Eli Lilly Advisory Board", "AstraZeneca, Janssen, Genentech, Eli Lilly, Celgene, Takeda T Tanvetyanon: None M Shafique: None AN Saltos: Travel Expenses", "BMS Advisory Board", "BMS J Gray: Research Grant", "BMS, Amgen, Abbvie, AstraZeneca, Pharmamar EB Haura: Research Grant", "BMS, Novartis, Merck, CBMG, Boehringer Ingelheim, AstraZeneca, Memgen, FLX Bio, Nektar, Venn", "Daiichi Sankyo SA Rosenberg: None M Schell: None SJ Antonia: Research Grant", "Incyte Pharmaceuticals, Forma Therapeutics B Creelan: Speaker's Bu-reau", "Merck, Genentech, Celgene Advisory Board", "Novartis Advisory Board", "Speaker's Bureau"], "urls": [{"href": "http://www.redjournal.org/article/S036030161931288X/fulltext"}, {"href": "http://www.redjournal.org/article/S036030161931288X/abstract"}, {"href": "https://www.redjournal.org/article/S0360-3016(19)31288-X/abstract"}], "volume": null, "issue": "1"}, {"title": "Author Correction: Visualizing structure and transitions in high-dimensional biological data", "type": "Journal Article", "authors": [{"name": ["Kevin", "R.", "Moon"]}, {"name": ["David", "van Dijk"]}, {"name": ["Zheng", "Wang"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["William", "S.", "Chen"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Antonia", "van den Elzen"]}, {"name": ["Matthew", "J.", "Hirn"]}, {"name": ["Ronald", "R.", "Coifman"]}, {"name": ["Natalia", "B.", "Ivanova"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "1", "pages": "108-108", "abstract": "An amendment to this paper has been published and can be accessed via a link at the top of the paper.", "publisher": "Nature Publishing Group", "periodical": "Nature Biotechnology 2020 38:1", "keywords": ["Data mining", "Machine learning"], "urls": [{"href": "https://www.nature.com/articles/s41587-019-0395-5"}], "volume": null, "issue": "1"}, {"title": "Finding Archetypal Spaces Using Neural Networks", "type": "Journal Article", "authors": [{"name": ["David", "Van", "Dijk"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Matthew", "Amodio"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2019", "month": "12", "pages": "2634-2643", "abstract": "Archetypal analysis is a data decomposition method that describes each observation in a dataset as a convex combination of 'pure types' or archetypes. These archetypes represent extrema of a data space in which there is a trade-off between features, such as in biology where different combinations of traits provide optimal fitness for different environments. Existing methods for archetypal analysis work well when a linear relationship exists between the feature space and the archetypal space. However, such methods are not applicable to systems where the feature space is generated non-linearly from the combination of archetypes, such as in biological systems or image transformations. Here, we propose a reformulation of the problem such that the goal is to learn a non-linear transformation of the data into a latent archetypal space. To solve this problem, we introduce Archetypal Analysis network (AAnet), which is a deep neural network framework for learning and generating from a latent archetypal representation of data. We demonstrate state-of-the-art recovery of ground-truth archetypes in non-linear data domains, show AAnet can generate from data geometry rather than from data density, and use AAnet to identify biologically meaningful archetypes in single-cell gene expression data.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings - 2019 IEEE International Conference on Big Data, Big Data 2019", "keywords": ["archetypal analysis", "computational biology", "representation learning"], "urls": [], "volume": null, "issue": null}, {"title": "MLL-AF9 initiates transformation from fast-proliferating myeloid progenitors", "type": "Journal Article", "authors": [{"name": ["Xinyue", "Chen"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Amaleah", "A.", "Hartman"]}, {"name": ["Xiao", "Hu"]}, {"name": ["Anna", "E.", "Eastman"]}, {"name": ["Chao", "Sun"]}, {"name": ["Xujun", "Wang"]}, {"name": ["Mei", "Zhong"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Shangqin", "Guo"]}], "year": "2019", "month": "12", "pages": "1-15", "abstract": "Cancer is a hyper-proliferative disease. Whether the proliferative state originates from the cell-of-origin or emerges later remains difficult to resolve. By tracking de novo transformation from normal hematopoietic progenitors expressing an acute myeloid leukemia (AML) oncogene MLL-AF9, we reveal that the cell cycle rate heterogeneity among granulocyte–macrophage progenitors (GMPs) determines their probability of transformation. A fast cell cycle intrinsic to these progenitors provide permissiveness for transformation, with the fastest cycling 3% GMPs acquiring malignancy with near certainty. Molecularly, we propose that MLL-AF9 preserves gene expression of the cellular states in which it is expressed. As such, when expressed in the naturally-existing, rapidly-cycling immature myeloid progenitors, this cell state becomes perpetuated, yielding malignancy. In humans, high CCND1 expression predicts worse prognosis for MLL fusion AMLs. Our work elucidates one of the earliest steps toward malignancy and suggests that modifying the cycling state of the cell-of-origin could be a preventative approach against malignancy. Not all mutated cells become malignant, suggesting additional requirements for transformation. Here, the authors track blood progenitors from normal to malignancy driven by MLL-AF9, revealing a subset of myeloid progenitors predisposed to transformation dependent on their normal cycling state.", "publisher": "Nature Publishing Group", "periodical": "Nature Communications 2019 10:1", "keywords": ["Acute myeloid leukaemia", "Oncogenes"], "urls": [{"href": "https://www.nature.com/articles/s41467-019-13666-5"}], "volume": 10, "issue": "1", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:HJSXoJQnj-YC", "journal_source": "Nature Communications", "cites": 34}, {"title": "Coarse Graining of Data via Inhomogeneous Diffusion Condensation", "type": "Journal Article", "authors": [{"name": ["Nathan", "Brugnone"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Alex", "Gonopolskiy"]}, {"name": ["Mark", "W.", "Moyle"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["David", "Van", "Dijk"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Daniel", "Colon-Ramos"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Matthew", "J.", "Hirn"]}], "year": "2019", "month": "12", "pages": "2624-2633", "abstract": "Big data often has emergent structure that exists at multiple levels of abstraction, which are useful for characterizing complex interactions and dynamics of the observations. Here, we consider multiple levels of abstraction via a multiresolution geometry of data points at different granularities. To construct this geometry we define a time-inhomogemeous diffusion process that effectively condenses data points together to uncover nested groupings at larger and larger granularities. This inhomogeneous process creates a deep cascade of intrinsic low pass filters on the data affinity graph that are applied in sequence to gradually eliminate local variability while adjusting the learned data geometry to increasingly coarser resolutions. We provide visualizations to exhibit our method as a 'continuously-hierarchical' clustering with directions of eliminated variation highlighted at each step. The utility of our algorithm is demonstrated via neuronal data condensation, where the constructed multiresolution data geometry uncovers the organization, grouping, and connectivity between neurons.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings - 2019 IEEE International Conference on Big Data, Big Data 2019", "keywords": ["diffusion", "graph signal processing", "hierarchical clustering", "manifold learning"], "urls": [], "volume": null, "issue": null}, {"title": "Harmonic alignment", "type": "Journal Article", "authors": [{"name": ["Jay", "S.", "Stanley"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": null, "pages": "316-324", "abstract": "SDM 20 General Chairs' Welcome It is our great pleasure to welcome you to the 2020 SIAM International Conference on Data Mining (SDM'20), held at the Hilton Cincinnati Netherland Plaza, Cincinnati,...", "publisher": "Society for Industrial and Applied Mathematics Publications", "periodical": "Proceedings", "keywords": [], "urls": [{"href": "https://epubs.siam.org/doi/10.1137/1.9781611976236.36"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:kWvqk_afx_IC", "journal_source": "Proceedings of the 2020 SIAM International Conference on Data Mining", "cites": 16}, {"title": "Publisher Correction: MLL-AF9 initiates transformation from fast-proliferating myeloid progenitors", "type": "Journal Article", "authors": [{"name": ["Xinyue", "Chen"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Amaleah", "A.", "Hartman"]}, {"name": ["Xiao", "Hu"]}, {"name": ["Anna", "E.", "Eastman"]}, {"name": ["Chao", "Sun"]}, {"name": ["Xujun", "Wang"]}, {"name": ["Mei", "Zhong"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Shangqin", "Guo"]}], "year": "2020", "month": "12", "pages": null, "abstract": "The original version of this Article incorrectly acknowledged Smita Krishnaswamy as a corresponding author. This has now been corrected in both the PDF and HTML versions of the Article.", "publisher": "Nature Publishing Group", "periodical": "Nature Communications", "keywords": [], "urls": [{"href": "/pmc/articles/PMC6989496/"}, {"href": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6989496/"}], "volume": 11, "issue": "1", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:UuEBAcK4md4C", "journal_source": "Nature Communications", "cites": 0}, {"title": "Author Correction: Visualizing structure and transitions in high-dimensional biological data (Nature Biotechnology, (2019), 37, 12, (1482-1492), 10.1038/s41587-019-0336-3)", "type": "Journal Article", "authors": [{"name": ["Kevin", "R.", "Moon"]}, {"name": ["David", "van Dijk"]}, {"name": ["Zheng", "Wang"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["William", "S.", "Chen"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Antonia", "van den Elzen"]}, {"name": ["Matthew", "J.", "Hirn"]}, {"name": ["Ronald", "R.", "Coifman"]}, {"name": ["Natalia", "B.", "Ivanova"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "1", "pages": "108", "abstract": "In the version of this article initially published, an affiliation for author Zheng Wang was missing. This affiliation should appear first; it reads “School of Basic Medicine, Qingdao University, Qingdao, China.” Also, as a result of a publisher error, the matrix variable P was replaced by tbfP in equation (4), the matrix variable Y was formatted italic rather than bold in the first two instances of Ylandmarks, and, in the PDF version, some instances of the variables P, x, y, p, B, J, Q, K, Y and v were formatted as non-italic plain text instead of non-italic bold. The errors have been corrected in the HTML and PDF versions of the article.", "publisher": "Nature Research", "periodical": "Nature Biotechnology", "keywords": [], "urls": [], "volume": null, "issue": "1"}, {"title": "Uncovering the Topology of Time-Varying fMRI Data using Cubical Persistence", "type": "Journal Article", "authors": [{"name": ["Bastian", "Rieck"]}, {"name": ["Tristan", "Yates"]}, {"name": ["Christian", "Bock"]}, {"name": ["Karsten", "Borgwardt"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Nicholas", "Turk-Browne"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": null, "pages": "6900-6912", "abstract": "Functional magnetic resonance imaging (fMRI) is a crucial technology for gaining insights into cognitive processes in humans. Data amassed from fMRI measurements result in volumetric data sets that vary over time. However, analysing such data presents a challenge due to the large degree of noise and person-to-person variation in how information is represented in the brain. To address this challenge, we present a novel topological approach that encodes each time point in an fMRI data set as a persistence diagram of topological features, i.e. high-dimensional voids present in the data. This representation naturally does not rely on voxel-by-voxel correspondence and is robust to noise. We show that these time-varying persistence diagrams can be clustered to find meaningful groupings between participants, and that they are also useful in studying within-subject brain state trajectories of subjects performing a particular task. Here, we apply both clustering and tra-jectory analysis techniques to a group of participants watching the movie 'Partly Cloudy'. We observe significant differences in both brain state trajectories and overall topological activity between adults and children watching the same movie.", "publisher": null, "periodical": "Advances in Neural Information Processing Systems", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Immune suppressive landscape in the human esophageal squamous cell carcinoma microenvironment", "type": "Journal Article", "authors": [{"name": ["Yingxia", "Zheng"]}, {"name": ["Zheyi", "Chen"]}, {"name": ["Yichao", "Han"]}, {"name": ["Li", "Han"]}, {"name": ["Xin", "Zou"]}, {"name": ["Bingqian", "Zhou"]}, {"name": ["Rui", "Hu"]}, {"name": ["Jie", "Hao"]}, {"name": ["Shihao", "Bai"]}, {"name": ["Haibo", "Xiao"]}, {"name": ["Wei", "Vivian", "Li"]}, {"name": ["Alex", "Bueker"]}, {"name": ["Yanhui", "Ma"]}, {"name": ["Guohua", "Xie"]}, {"name": ["Junyao", "Yang"]}, {"name": ["Shiyu", "Chen"]}, {"name": ["Hecheng", "Li"]}, {"name": ["Jian", "Cao"]}, {"name": ["Lisong", "Shen"]}], "year": "2020", "month": "12", "pages": null, "abstract": "Cancer immunotherapy has revolutionized cancer treatment, and it relies heavily on the comprehensive understanding of the immune landscape of the tumor microenvironment (TME). Here, we obtain a detailed immune cell atlas of esophageal squamous cell carcinoma (ESCC) at single-cell resolution. Exhausted T and NK cells, regulatory T cells (Tregs), alternatively activated macrophages and tolerogenic dendritic cells are dominant in the TME. Transcriptional profiling coupled with T cell receptor (TCR) sequencing reveal lineage connections in T cell populations. CD8 T cells show continuous progression from pre-exhausted to exhausted T cells. While exhausted CD4, CD8 T and NK cells are major proliferative cell components in the TME, the crosstalk between macrophages and Tregs contributes to potential immunosuppression in the TME. Our results indicate several immunosuppressive mechanisms that may be simultaneously responsible for the failure of immuno-surveillance. Specific targeting of these immunosuppressive pathways may reactivate anti-tumor immune responses in ESCC.", "publisher": "Nature Publishing Group", "periodical": "Nature Communications", "keywords": [], "urls": [{"href": "/pmc/articles/PMC7722722/"}, {"href": "/pmc/articles/PMC7722722/?report=abstract"}, {"href": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7722722/"}], "volume": null, "issue": "1"}, {"title": "Making Logic Learnable With Neural Networks", "type": "Journal Article", "authors": [{"name": ["Tobias", "Brudermueller"]}, {"name": ["Dennis", "L.", "Shung"]}, {"name": ["Adrian", "J.", "Stanley"]}, {"name": ["Johannes", "Stegmaier"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "2", "pages": null, "abstract": "While neural networks are good at learning unspecified functions from\ntraining samples, they cannot be directly implemented in hardware and are often\nnot interpretable or formally verifiable. On the other hand, logic circuits are\nimplementable, verifiable, and interpretable but are not able to learn from\ntraining data in a generalizable way. We propose a novel logic learning\npipeline that combines the advantages of neural networks and logic circuits.\nOur pipeline first trains a neural network on a classification task, and then\ntranslates this, first to random forests, and then to AND-Inverter logic. We\nshow that our pipeline maintains greater accuracy than naive translations to\nlogic, and minimizes the logic such that it is more interpretable and has\ndecreased hardware cost. We show the utility of our pipeline on a network that\nis trained on biomedical data. This approach could be applied to patient care\nto provide risk stratification and guide clinical decision-making.", "publisher": null, "periodical": null, "keywords": [], "urls": [{"href": "https://arxiv.org/abs/2002.03847v3"}], "volume": null, "issue": null}, {"title": "Uncovering axes of variation among single-cell cancer specimens", "type": "Journal Article", "authors": [{"name": ["William", "S.", "Chen"]}, {"name": ["Nevena", "Zivanovic"]}, {"name": ["David", "van Dijk"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Bernd", "Bodenmiller"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "1", "pages": "302-310", "abstract": "While several tools have been developed to map axes of variation among individual cells, no analogous approaches exist for identifying axes of variation among multicellular biospecimens profiled at single-cell resolution. For this purpose, we developed ‘phenotypic earth mover’s distance’ (PhEMD). PhEMD is a general method for embedding a ‘manifold of manifolds’, in which each datapoint in the higher-level manifold (of biospecimens) represents a collection of points that span a lower-level manifold (of cells). We apply PhEMD to a newly generated drug-screen dataset and demonstrate that PhEMD uncovers axes of cell subpopulational variation among a large set of perturbation conditions. Moreover, we show that PhEMD can be used to infer the phenotypes of biospecimens not directly profiled. Applied to clinical datasets, PhEMD generates a map of the patient-state space that highlights sources of patient-to-patient variation. PhEMD is scalable, compatible with leading batch-effect correction techniques and generalizable to multiple experimental designs. Phenotypic earth mover’s distance (PhEMD) facilitates the comparison of single-cell experimental conditions, each of which is a high-dimensional dataset, and identifies axes of variation among multicellular biospecimens.", "publisher": "Nature Publishing Group", "periodical": "Nature Methods 2020 17:3", "keywords": ["Cancer genomics", "Computational models", "Software"], "urls": [{"href": "https://www.nature.com/articles/s41592-019-0689-z"}], "volume": 17, "issue": "3", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:IsPWOBWtZBwC", "journal_source": "Nature methods", "cites": 30}, {"title": "Single cell immune profiling of dengue virus patients reveals intact immune responses to Zika virus with enrichment of innate immune signatures", "type": "Journal Article", "authors": [{"name": ["Yujiao", "Zhao"]}, {"name": ["Matthew", "Amodio"]}, {"name": ["Brent", "Vander", "Wyk"]}, {"name": ["Bram", "Gerritsen"]}, {"name": ["Mahesh", "M.", "Kumar"]}, {"name": ["David", "van Dijk"]}, {"name": ["Kevin", "Moon"]}, {"name": ["Xiaomei", "Wang"]}, {"name": ["Anna", "Malawista"]}, {"name": ["Monique", "M.", "Richards"]}, {"name": ["Megan", "E.", "Cahill"]}, {"name": ["Anita", "Desai"]}, {"name": ["Jayasree", "Sivadasan"]}, {"name": ["Manjunatha", "M.", "Venkataswamy"]}, {"name": ["Vasanthapuram", "Ravi"]}, {"name": ["Erol", "Fikrig"]}, {"name": ["Priti", "Kumar"]}, {"name": ["Steven", "H.", "Kleinstein"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Ruth", "R.", "Montgomery"]}], "year": "2020", "month": "3", "pages": "e0008112", "abstract": "The genus Flavivirus contains many mosquito-borne human pathogens of global epidemiological importance such as dengue virus, West Nile virus, and Zika virus, which has recently emerged at epidemic levels. Infections with these viruses result in divergent clinical outcomes ranging from asymptomatic to fatal. Myriad factors influence infection severity including exposure, immune status and pathogen/host genetics. Furthermore, pre-existing infection may skew immune pathways or divert immune resources. We profiled immune cells from dengue virus-infected individuals by multiparameter mass cytometry (CyTOF) to define functional status. Elevations in IFNβ were noted in acute patients across the majority of cell types and were statistically elevated in 31 of 36 cell subsets. We quantified response to in vitro (re)infection with dengue or Zika viruses and detected a striking pattern of upregulation of responses to Zika infection by innate cell types which was not noted in response to dengue virus. Significance was discovered by statistical analysis as well as a neural network-based clustering approach which identified unusual cell subsets overlooked by conventional manual gating. Of public health importance, patient cells showed significant enrichment of innate cell responses to Zika virus indicating an intact and robust anti-Zika response despite the concurrent dengue infection.", "publisher": "Public Library of Science", "periodical": "PLOS Neglected Tropical Diseases", "keywords": ["Cytokines", "Dengue fever", "Dengue virus", "Immune cells", "Immune response", "T cells", "Zika fever", "Zika virus"], "urls": [{"href": "https://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0008112"}], "volume": 14, "issue": "3", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:Xl6nMSl579sC", "journal_source": "PLoS neglected tropical diseases", "cites": 15}, {"title": "Endocrine-Exocrine Signaling Drives Obesity-Associated Pancreatic Ductal Adenocarcinoma", "type": "Journal Article", "authors": [{"name": ["Katherine", "Minjee", "Chung"]}, {"name": ["Jaffarguriqbal", "Singh"]}, {"name": ["Lauren", "Lawres"]}, {"name": ["Kimberly", "Judith", "Dorans"]}, {"name": ["Cathy", "Garcia"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Rebecca", "Robbins"]}, {"name": ["Arjun", "Bhutkar"]}, {"name": ["Rebecca", "Cardone"]}, {"name": ["Xiaojian", "Zhao"]}, {"name": ["Ana", "Babic"]}, {"name": ["Sara", "A.", "Vayrynen"]}, {"name": ["Andressa", "Dias Costa"]}, {"name": ["Jonathan", "A.", "Nowak"]}, {"name": ["Daniel", "T.", "Chang"]}, {"name": ["Richard", "F.", "Dunne"]}, {"name": ["Aram", "F.", "Hezel"]}, {"name": ["Albert", "C.", "Koong"]}, {"name": ["Joshua", "J.", "Wilhelm"]}, {"name": ["Melena", "D.", "Bellin"]}, {"name": ["Vibe", "Nylander"]}, {"name": ["Anna", "L.", "Gloyn"]}, {"name": ["Mark", "I.", "McCarthy"]}, {"name": ["Richard", "G.", "Kibbey"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Brian", "M.", "Wolpin"]}, {"name": ["Tyler", "Jacks"]}, {"name": ["Charles", "S.", "Fuchs"]}, {"name": ["Mandar", "Deepak", "Muzumdar"]}], "year": "2020", "month": "5", "pages": "832-847.e18", "abstract": "Obesity is an intrinsic driver of PDAC in mice, leading to a remodeling of beta cells to increase CCK secretion and playing a role early in pancreatic cancer development that can be intercepted by weight loss.", "publisher": "Cell Press", "periodical": "Cell", "keywords": ["beta cells", "cholecystokinin", "genetically engineered mouse models", "leptin", "obesity", "pancreatic cancer", "pancreatic islets", "tumor microenvironment"], "urls": [], "volume": null, "issue": "4"}, {"title": "Uncovering the Folding Landscape of RNA Secondary Structure with Deep Graph Embeddings", "type": "Journal Article", "authors": [{"name": ["Egbert", "Castro"]}, {"name": ["Andrew", "Benz"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "6", "pages": "4519-4528", "abstract": "Biomolecular graph analysis has recently gained much attention in the\nemerging field of geometric deep learning. Here we focus on organizing\nbiomolecular graphs in ways that expose meaningful relations and variations\nbetween them. We propose a geometric scattering autoencoder (GSAE) network for\nlearning such graph embeddings. Our embedding network first extracts rich graph\nfeatures using the recently proposed geometric scattering transform. Then, it\nleverages a semi-supervised variational autoencoder to extract a\nlow-dimensional embedding that retains the information in these features that\nenable prediction of molecular properties as well as characterize graphs. We\nshow that GSAE organizes RNA graphs both by structure and energy, accurately\nreflecting bistable RNA structures. Also, the model is generative and can\nsample new folding trajectories.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020", "keywords": ["graph embedding", "molecular structures", "self-supervised learning"], "urls": [{"href": "https://arxiv.org/abs/2006.06885v3"}], "volume": null, "issue": null}, {"title": "Image-to-image Mapping with Many Domains by Sparse Attribute Transfer", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Rim", "Assouel"]}, {"name": ["Victor", "Schmidt"]}, {"name": ["Tristan", "Sylvain"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Yoshua", "Bengio"]}], "year": "2020", "month": "6", "pages": null, "abstract": "Unsupervised image-to-image translation consists of learning a pair of\nmappings between two domains without known pairwise correspondences between\npoints. The current convention is to approach this task with cycle-consistent\nGANs: using a discriminator to encourage the generator to change the image to\nmatch the target domain, while training the generator to be inverted with\nanother mapping. While ending up with paired inverse functions may be a good\nend result, enforcing this restriction at all times during training can be a\nhindrance to effective modeling. We propose an alternate approach that directly\nrestricts the generator to performing a simple sparse transformation in a\nlatent layer, motivated by recent work from cognitive neuroscience suggesting\nan architectural prior on representations corresponding to consciousness. Our\nbiologically motivated approach leads to representations more amenable to\ntransformation by disentangling high-level abstract concepts in the latent\nspace. We demonstrate that image-to-image domain translation with many\ndifferent domains can be learned more effectively with our architecturally\nconstrained, simple transformation than with previous unconstrained\narchitectures that rely on a cycle-consistency loss.", "publisher": null, "periodical": null, "keywords": [], "urls": [{"href": "https://arxiv.org/abs/2006.13291v1"}], "volume": 13291, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:Xz60mAmATU4C", "journal_source": "arXiv preprint arXiv:2006.", "cites": 0}, {"title": "The Future of Cancer Research", "type": "Journal Article", "authors": [{"name": ["Leila", "Akkari"]}], "year": "2020", "month": "9", "pages": "724-729", "abstract": null, "publisher": "Cell Press", "periodical": "Trends in Cancer", "keywords": [], "urls": [{"href": "http://www.cell.com/article/S2405803320302065/fulltext"}, {"href": "http://www.cell.com/article/S2405803320302065/abstract"}, {"href": "https://www.cell.com/trends/cancer/abstract/S2405-8033(20)30206-5"}], "volume": null, "issue": "9"}, {"title": "IL-7 receptor alpha defines heterogeneity and signature of human effector memory CD8+ T cells in high dimensional analysis", "type": "Journal Article", "authors": [{"name": ["Min", "Sun", "Shin"]}, {"name": ["Dongjoo", "Kim"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Hong", "Jai", "Park"]}, {"name": ["Sungyong", "You"]}, {"name": ["Xuemei", "Dong"]}, {"name": ["Fotios", "Koumpouras"]}, {"name": ["Albert", "C.", "Shaw"]}, {"name": ["Rong", "Fan"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Insoo", "Kang"]}], "year": "2020", "month": "9", "pages": "104155", "abstract": "The IL-7 receptor alpha chain (IL-7Rα or CD127) can be differentially expressed in memory CD8+ T cells. Here we investigated whether IL-7Rα could serve as a key molecule in defining a comprehensive landscape of heterogeneity in human effector memory (EM) CD8+ T cells using high-dimensional Cytometry by Time-Of-Flight (CyTOF) and single-cell RNA-seq (scRNA-seq). IL-7Rα had diverse, but organized, expressional relationship in EM CD8+ T cells with molecules related to cell function and gene regulation, which rendered an immune landscape defining heterogeneous cell subsets. The differential expression of these molecules likely has biological implications as we found in vivo signatures of transcription factors and homeostasis cytokine receptors, including T-bet and IL-7Rα. Our findings indicate the existence of heterogeneity in human EM CD8+ T cells as defined by distinct but organized expression patterns of multiple molecules in relationship to IL-7Rα and its possible biological significance in modulating downstream events.", "publisher": "Academic Press", "periodical": "Cellular Immunology", "keywords": ["Effector memory CD8+ T cells", "High-dimensional single cell analysis", "Human", "IL-7 receptor"], "urls": [], "volume": 355, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:qe6vwMD2xtsC", "journal_source": "Cellular immunology", "cites": 5}, {"title": "Transcriptomic and clonal characterization of T cells in the human central nervous system", "type": "Journal Article", "authors": [{"name": ["Jenna", "L.", "Pappalardo"]}, {"name": ["Le", "Zhang"]}, {"name": ["Maggie", "K.", "Pecsok"]}, {"name": ["Kelly", "Perlman"]}, {"name": ["Chrysoula", "Zografou"]}, {"name": ["Khadir", "Raddassi"]}, {"name": ["Ahmad", "Abulaban"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Jack", "Antel"]}, {"name": ["David", "van Dijk"]}, {"name": ["David", "A.", "Hafler"]}], "year": "2020", "month": "9", "pages": "8786", "abstract": "T cells provide critical immune surveillance to the central nervous system (CNS), and the cerebrospinal fluid (CSF) is thought to be a main route for their entry. Further characterization of the state of T cells in the CSF in healthy individuals is important for understanding how T cells provide protective immune surveillance without damaging the delicate environment of the CNS and providing tissue-specific context for understanding immune dysfunction in neuroinflammatory disease. Here, we have profiled T cells in the CSF of healthy human donors and have identified signatures related to cytotoxic capacity and tissue adaptation that are further exemplified in clonally expanded CSF T cells. By comparing profiles of clonally expanded T cells obtained from the CSF of patients with multiple sclerosis (MS) and healthy donors, we report that clonally expanded T cells from the CSF of patients with MS have heightened expression of genes related to T cell activation and cytotoxicity.", "publisher": "American Association for the Advancement of Science", "periodical": "Science Immunology", "keywords": [], "urls": [{"href": "https://www.science.org/doi/10.1126/sciimmunol.abb8786"}], "volume": 8786, "issue": "51", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:-DxkuPiZhfEC", "journal_source": "Science immunology 5 (51), eabb", "cites": 49}, {"title": "Fixing bias in reconstruction-based anomaly detection with lipschitz discriminators", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "9", "pages": null, "abstract": "Anomaly detection is of great interest in fields where abnormalities need to be identified and corrected (e.g., medicine and finance). Deep learning methods for this task often rely on autoencoder reconstruction error, sometimes in conjunction with other errors. We show that this approach exhibits intrinsic biases that lead to undesirable results. Reconstruction-based methods are sensitive to training-data outliers and simple-to-reconstruct points. Instead, we introduce a new unsupervised Lipschitz anomaly discriminator that does not suffer from these biases. Our anomaly discriminator is trained, similar to the ones used in GANs, to detect the difference between the training data and corruptions of the training data. We show that this procedure successfully detects unseen anomalies with guarantees on those that have a certain Wasserstein distance from the data or corrupted training set. These additions allow us to show improved performance on MNIST, CIFAR10, and health record data.", "publisher": "IEEE Computer Society", "periodical": "IEEE International Workshop on Machine Learning for Signal Processing, MLSP", "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:An6A6Jpfc1oC", "journal_source": "2020 IEEE 30th International Workshop on Machine Learning for Signal …", "cites": 21}, {"title": "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics", "type": "generic", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Guy", "Wolf"]}, {"name": ["David", "Van", "Dijk"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "11", "pages": "9526-9536", "abstract": "It is increasingly common to encounter data from dynamic processes captured by static cross-sectional measurements over time, particularly in biomedical settings. Recent attempts to model individual trajectories from this data use optimal transport to create pairwise matchings between time points. However, these methods cannot model continuous dynamics and non-linear paths that entities can take in these systems. To address this issue, we establish a link between continuous normalizing flows and dynamic optimal transport, that allows us to model the expected paths of points over time. Continuous normalizing flows are generally under constrained, as they are allowed to take an arbitrary path from the source to the target distribution. We present Trajecto-ryNet, which controls the continuous paths taken between distributions to produce dynamic optimal transport. We show how this is particularly applicable for studying cellular dynamics in data from single-cell RNA sequencing (scRNA-seq) technologies , and that TrajectoryNet improves upon recently proposed static optimal transport-based models that can be used for interpolating cellular distributions.", "publisher": "PMLR", "periodical": null, "keywords": ["\"Dynamical systems", "differential equations", "neural network\""], "urls": [{"href": "https://proceedings.mlr.press/v119/tong20a.html"}], "volume": null, "issue": null}, {"title": "Multiscale PHATE Exploration of SARS-CoV-2 Data Reveals Multimodal Signatures of Disease", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Patrick", "Wong"]}, {"name": ["Jean-Christophe", "Grenier"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Carolina", "Lucas"]}, {"name": ["Jon", "Klein"]}, {"name": ["Daniel", "Burkhardt"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Benjamin", "Israelow"]}, {"name": ["Tianyang", "Mao"]}, {"name": ["Ji", "Eun", "Oh"]}, {"name": ["Julio", "Silva"]}, {"name": ["Takehiro", "Takahashi"]}, {"name": ["Camila", "D.", "Odio"]}, {"name": ["Arnau", "Casanovas-Massana"]}, {"name": ["John", "Fournier"]}, {"name": ["Yale", "IMPACT", "Team"]}, {"name": ["Shelli", "Farhadian"]}, {"name": ["Charles", "S.", "Dela", "Cruz"]}, {"name": ["Albert", "I.", "Ko"]}, {"name": ["F.", "Perry", "Wilson"]}, {"name": ["Julie", "Hussin"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Akiko", "Iwasaki"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "11", "pages": "2020.11.15.383661", "abstract": "The biomedical community is producing increasingly high dimensional datasets, integrated from hundreds of patient samples, which current computational techniques struggle to explore. To uncover biological meaning from these complex datasets, we present an approach called Multiscale PHATE, which learns abstracted biological features from data that can be directly predictive of disease. Built on a continuous coarse graining process called diffusion condensation, Multiscale PHATE creates a tree of data granularities that can be cut at coarse levels for high level summarizations of data, as well as at fine levels for detailed representations on subsets. We apply Multiscale PHATE to study the immune response to COVID-19 in 54 million cells from 168 hospitalized patients. Through our analysis of patient samples, we identify CD16 hi  CD66b lo  neutrophil and IFNγ+GranzymeB+ Th17 cell responses enriched in patients who die. Further, we show that population groupings Multiscale PHATE discovers can be directly fed into a classifier to predict disease outcome. We also use Multiscale PHATE-derived features to construct two different manifolds of patients, one from abstracted flow cytometry features and another directly on patient clinical features, both associating immune subsets and clinical markers with outcome.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2020.11.15.383661v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2020.11.15.383661v1.abstract"}], "volume": null, "issue": null}, {"title": "Learning general transformations of data for out-of-sample extensions", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["David", "Van Dijk"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "9", "pages": null, "abstract": "While generative models such as GANs have been successful at mapping from noise to specific distributions of data, or more generally from one distribution of data to another, they cannot isolate the transformation that is occurring and apply it to a new distribution not seen in training. Thus, they memorize the domain of the transformation, and cannot generalize the transformation out of sample. To address this, we propose a new neural network called a Neuron Transformation Network (NT-Net) that isolates the signal representing the transformation itself from the other signals representing internal distribution variation. This signal can then be removed from a new dataset distributed differently from the original one trained on. We demonstrate the effectiveness of our NTNet on more than a dozen synthetic and biomedical single-cell RNA sequencing datasets, where the NTNet is able to learn the data transformation performed by genetic and drug perturbations on one sample of cells and successfully apply it to another sample of cells to predict treatment outcome.", "publisher": "IEEE Computer Society", "periodical": "IEEE International Workshop on Machine Learning for Signal Processing, MLSP", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Data-Driven Learning of Geometric Scattering Networks", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Frederick", "Wenkel"]}, {"name": ["Kincaid", "Macdonald"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Guy", "Wolf"]}], "year": "2020", "month": "10", "pages": null, "abstract": "We propose a new graph neural network (GNN) module, based on relaxations of\nrecently proposed geometric scattering transforms, which consist of a cascade\nof graph wavelet filters. Our learnable geometric scattering (LEGS) module\nenables adaptive tuning of the wavelets to encourage band-pass features to\nemerge in learned representations. The incorporation of our LEGS-module in GNNs\nenables the learning of longer-range graph relations compared to many popular\nGNNs, which often rely on encoding graph structure via smoothness or similarity\nbetween neighbors. Further, its wavelet priors result in simplified\narchitectures with significantly fewer learned parameters compared to competing\nGNNs. We demonstrate the predictive performance of LEGS-based networks on graph\nclassification benchmarks, as well as the descriptive quality of their learned\nfeatures in biochemical graph data exploration tasks.", "publisher": null, "periodical": "arXiv", "keywords": ["Index Terms-Geometric deep learning", "geometric scattering", "graph neural networks"], "urls": [{"href": "https://arxiv.org/abs/2010.02415v3"}], "volume": null, "issue": null}, {"title": "Visualizing High-Dimensional Trajectories on the Loss-Landscape of ANNs", "type": "Journal Article", "authors": [{"name": ["Stefan", "Horoi"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "3", "pages": null, "abstract": "Training artificial neural networks requires the optimization of highly non-convex loss functions. Throughout the years, the scientific community has developed an extensive set of tools and architectures that render this optimization task tractable and a general intuition has been developed for choosing hyper parameters that help the models reach minima that generalize well to unseen data. However, for the most part, the difference in trainability in between architectures, tasks and even the gap in network generalization abilities still remain unexplained. Visualization tools have played a key role in uncovering key geometric characteristics of the loss-landscape of ANNs and how they impact trainability and generalization capabilities. However, most visualizations methods proposed so far have been relatively limited in their capabilities since they are of linear nature and only capture features in a limited number of dimensions. We propose the use of the modern dimensionality reduction method PHATE which represents the SOTA in terms of capturing both global and local structures of high-dimensional data. We apply this method to visualize the loss landscape during and after training. Our visualizations reveal differences in training trajectories and generalization capabilities when used to make comparisons between optimization methods, initializations, architectures, and datasets. Given this success we anticipate this method to be used in making informed choices about these aspects of neural networks.", "publisher": "Microtome Publishing", "periodical": "Journal of Machine Learning Research", "keywords": ["Deep learning", "Hessian", "Low-rank approximation", "Multinomial logistic regression", "Spectral analysis"], "urls": [], "volume": null, "issue": null}, {"title": "Uncovering the Folding Landscape of RNA Secondary Structure Using Deep Graph Embeddings", "type": "Journal Article", "authors": [{"name": ["Egbert", "Castro"]}, {"name": ["Andrew", "Benz"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2020", "month": "12", "pages": "4519-4528", "abstract": "Biomolecular graph analysis has recently gained much attention in the emerging field of geometric deep learning. Here we focus on organizing biomolecular graphs in ways that expose meaningful relations and variations between them. We propose a geometric scattering autoencoder (GSAE) network for learning such graph embeddings. Our embedding network first extracts rich graph features using the recently proposed geometric scattering transform. Then, it leverages a semi-supervised variational autoencoder to extract a low-dimensional embedding that retains the information in these features that enable prediction of molecular properties as well as characterize graphs. We show that GSAE organizes RNA graphs both by structure and energy, accurately reflecting b istable R NA s tructures. A lso, the model is generative and can sample new folding trajectories.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings - 2020 IEEE International Conference on Big Data, Big Data 2020", "keywords": ["graph embedding", "molecular structures", "self-supervised learning"], "urls": [], "volume": null, "issue": null}, {"title": "Multimodal data visualization, denoising and clustering with integrated diffusion", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": 2021, "month": null, "pages": null, "abstract": "We propose a method called integrated diffusion for combining multimodal datasets, or data gathered via several different measurements on the same system, to create a joint data diffusion operator. As real world data suffers from both local and global noise, we introduce mechanisms to optimally calculate a diffusion operator that reflects the combined information from both modalities. We show the utility of this joint operator in data denoising, visualization and clustering, performing better than other methods when applied to multi-omic data generated from peripheral blood mononuclear cells. Our approach better visualizes the geometry of the joint data, captures known cross-modality associations and identifies known cellular populations. More generally, integrated diffusion is broadly applicable to multi-modal datasets generated in many medical and biological systems.", "publisher": null, "periodical": null, "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:1tZ8xJnm2c8C", "journal_source": "IEEE MLSP", "cites": 6}, {"title": "Topological analysis of single-cell data reveals shared glial landscape of macular degeneration and neurodegenerative diseases", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Marcello", "DiStasio"]}, {"name": ["Eda", "Calapkulu"]}, {"name": ["Maryam", "Ige"]}, {"name": ["Le", "Zhang"]}, {"name": ["Amar", "H.", "Sheth"]}, {"name": ["Madhvi", "Menon"]}, {"name": ["Yu", "Xing"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Rahul", "M.", "Dhodapkar"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Brian", "P.", "Hafler"]}], "year": "2021", "month": null, "pages": null, "abstract": null, "publisher": null, "periodical": "bioRxiv", "keywords": [], "urls": [], "volume": 427286, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:ghEM2AJqZyQC", "journal_source": "bioRxiv, 2021.01. 19.", "cites": 4}, {"title": "Voices of biotech research", "type": "Journal Article", "authors": [{"name": ["Nasim", "Annabi"]}, {"name": ["Matthew", "Baker"]}, {"name": ["Alistair", "Boettiger"]}, {"name": ["Debojyoti", "Chakraborty"]}, {"name": ["Yvonne", "Chen"]}, {"name": ["Kizzmekia", "S.", "Corbett"]}, {"name": ["Bruno", "Correia"]}, {"name": ["James", "Dahlman"]}, {"name": ["Tulio", "de Oliveira"]}, {"name": ["Ali", "Ertuerk"]}, {"name": ["Mehmet", "Fatih", "Yanik"]}, {"name": ["Elizabeth", "Henaff"]}, {"name": ["Meritxell", "Huch"]}, {"name": ["Iliyan", "D.", "Iliev"]}, {"name": ["Thomas", "Jacobs"]}, {"name": ["Howard", "Junca"]}, {"name": ["Albert", "Keung"]}, {"name": ["Ilana", "Kolodkin-Gal"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Madeline", "Lancaster"]}, {"name": ["Evan", "Macosko"]}, {"name": ["Mario", "Alberto", "Martínez-Núñez"]}, {"name": ["Kyoko", "Miura"]}, {"name": ["Jenny", "Molloy"]}, {"name": ["Andrés", "Ochoa", "Cruz"]}, {"name": ["Randall", "J.", "Platt"]}, {"name": ["Avery", "D.", "Posey"]}, {"name": ["Huilin", "Shao"]}, {"name": ["Mijo", "Simunovic"]}, {"name": ["Nikolai", "Slavov"]}, {"name": ["Takanori", "Takebe"]}, {"name": ["Luk", "H.", "Vandenberghe"]}, {"name": ["Rajeev", "K.", "Varshney"]}, {"name": ["Jianbin", "Wang"]}], "year": "2021", "month": "3", "pages": "281-286", "abstract": null, "publisher": "NLM (Medline)", "periodical": "Nature biotechnology", "keywords": [], "urls": [], "volume": 39, "issue": "3", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:2ywjKiB__4kC", "journal_source": "Nature biotechnology", "cites": 3}, {"title": "Multiple-manifold Generation with an Ensemble GAN and Learned Noise Prior", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": null, "pages": "24-36", "abstract": "Generative adversarial networks (GANs) learn to map samples from a noise distribution to a chosen data distribution. Recent work has demonstrated that GANs are consequently sensitive to, and limited by, the shape of the noise distribution. For example, for a single generator to map continuous noise (e.g. a uniform distribution) to discontinuous output (e.g. separate Gaussians), it must generate off-manifold points in the discontinuous region with nonzero probability. While existing applications generally ignore these outliers, they nevertheless represent a hindrance to accurate modeling in current frameworks. We address this problem by learning to generate from multiple networks such that the generator’s output is an ensemble of distinct sub-generators. We contribute a novel formulation of multi-generator models where we learn a prior over the generators conditioned on the noise, parameterized by another neural network. Thus, this network not only learns the optimal rate to sample from each generator but also optimally shapes the noise received by each generator. The resulting Noise Prior GAN (NPGAN) achieves flexibility that surpasses both single generator models and previous multi-generator models even when the total number of parameters in the ensemble is the same as the single-generator models.", "publisher": "Springer Science and Business Media Deutschland GmbH", "periodical": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)", "keywords": [], "urls": [{"href": "https://link.springer.com/chapter/10.1007/978-3-030-74251-5_3"}], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:eAlLMO4JVmQC", "journal_source": "Advances in Intelligent Data Analysis XIX: 19th International Symposium on …", "cites": 0}, {"title": "Topological analysis of single-cell data reveals shared glial landscape of macular degeneration and neurodegenerative diseases", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Marcello", "DiStasio"]}, {"name": ["Eda", "Calapkulu"]}, {"name": ["Maryam", "Ige"]}, {"name": ["Le", "Zhang"]}, {"name": ["Amar", "H.", "Sheth"]}, {"name": ["Madhvi", "Menon"]}, {"name": ["Yu", "Xing"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Rahul", "M.", "Dhodapkar"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Brian", "P.", "Hafler"]}], "year": "2021", "month": "1", "pages": "2021.01.19.427286", "abstract": "A novel topological machine learning approach applied to single-nucleus RNA sequencing from human retinas with age-related macular degeneration identifies interacting disease phase-specific glial activation states shared with Alzheimer’s disease and multiple sclerosis.\nAbstract Neurodegeneration occurs in a wide range of diseases, including age-related macular degeneration (AMD), Alzheimer’s disease (AD), and multiple sclerosis (MS), each with distinct inciting events. To determine whether glial transcriptional states are shared across phases of degeneration, we sequenced 50,498 nuclei from the retinas of seven AMD patients and six healthy controls, generating the first single-cell transcriptomic atlas of AMD. We identified groupings of cells implicated in disease pathogenesis by applying a novel topologically-inspired machine learning approach called ‘diffusion condensation.’ By calculating diffusion homology features and performing persistence analysis, diffusion condensation identified activated glial states enriched in the early phases of AMD, AD, and MS as well as an AMD-specific proangiogenic astrocyte state promoting pathogenic neovascularization in advanced AMD. Finally, by mapping the expression of disease-associated genes to glial states, we identified key signaling interactions creating hypotheses for therapeutic intervention. Our topological analysis identified an integrated disease-phase specific glial landscape that is shared across neurodegenerative conditions affecting the central nervous system.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2021.01.19.427286v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2021.01.19.427286v1.abstract"}], "volume": 427286, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:ghEM2AJqZyQC", "journal_source": "bioRxiv, 2021.01. 19.", "cites": 4}, {"title": "Exploring epithelial-cell calcium signaling with geometric and topological data analysis", "type": "generic", "authors": [{"name": ["Feng", "Gao"]}, {"name": ["Jessica", "Moore"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Valentina", "Greco"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "4", "pages": null, "abstract": "Spatio-temporal calcium imaging is widely used to study neuronal activity. However the function of calcium signaling in epithelial cells is not well understood. We thus explore the underlying fluorescence patterns using a combination of data geometry and topology. We model the epithelial tissue as a graph and use a variant of geometric scattering transform (a multi-level wavelet transform on a graph) to describe the signaling at each time point. We then embed these discriptors using the manifold learning method PHATE in order to  capture the entire time-trajectory of calcium signaling. Finally, we use persistent homology computed on the PHATE embedding to quantitatively characterize the trajectory.  We demonstrate that scattering coefficients can effectively learn time point embeddings while PHATE can represent relationships between time points. Persistent homology provides a way to quantify differences between signaling dynamics as evidenced by the differences in dynamics between wild type cells and cells that are stalled in a particular cell cycle phase.", "publisher": null, "periodical": null, "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:AYInfyleIOsC", "journal_source": "ICLR 2021 Workshop on Geometrical and Topological Representation Learning", "cites": 1}, {"title": "A reservoir of stem-like CD8 T cells in the tumor-draining lymph node maintains the ongoing anti-tumor immune response", "type": "Journal Article", "authors": [{"name": ["Kelli", "A.", "Connolly"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Aarthi", "Venkat"]}, {"name": ["Achia", "Khatun"]}, {"name": ["Jiawei", "Wang"]}, {"name": ["Ivana", "William"]}, {"name": ["Noah", "Hornick"]}, {"name": ["Brittany", "Fitzgerald"]}, {"name": ["Martina", "Damo"]}, {"name": ["Moujtaba", "Y.", "Kasmani"]}, {"name": ["Can", "Cui"]}, {"name": ["Eric", "Fagerberg"]}, {"name": ["Isabel", "Monroy"]}, {"name": ["Amanda", "Hutchins"]}, {"name": ["Julie", "F", "Cheung"]}, {"name": ["Gena", "G.", "Foster"]}, {"name": ["Dylan", "L.", "Mariuzza"]}, {"name": ["Hongyu", "Zhao"]}, {"name": ["Weiguo", "Cui"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Nikhil", "S.", "Joshi"]}], "year": "2021", "month": "1", "pages": "2021.01.27.428467", "abstract": "“Stem-like” TCF1+ CD8+ T cells (TSL) are necessary for long-term maintenance of T cell responses and the efficacy of immunotherapy but, as tumors contain signals that should drive T-cell terminal-differentiation, how these cells are maintained in tumors remains unclear. We found that a small number of TCF1+ tumor-specific CD8+ T cells were present in tumors throughout development. Yet, most intratumoral T cells differentiated as tumors progressed, corresponding with an immunologic shift in the tumor microenvironment (TME) from “hot” to “cold”. By contrast, most tumor-specific CD8+ T cells in tumor-draining lymph nodes (dLNs) had functions and gene expression signatures similar to TSL from chronic LCMV infection and this population was stable over time, despite the changes in the TME. dLN T cells were the precursors of their more-differentiated intratumoral counterparts, and maintenance of TCF1 by intratumoral T cells required continuous migration from dLNs. Finally, TSL CD8 T cells were also present in LNs from lung adenocarcinoma patients, suggesting this population is also relevant in human disease. Thus, we propose that the dLN TSL reservoir has a critical function during tumor development in sustaining antitumor T cells during tumor development and protecting them from the terminal differentiation that occurs in the TME.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2021.01.27.428467v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2021.01.27.428467v1.abstract"}], "volume": 428467, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:8Xgff_V0N9gC", "journal_source": "Biorxiv, 2021.01. 27.", "cites": 6}, {"title": "Structural and developmental principles of neuropil assembly in C. elegans", "type": "Journal Article", "authors": [{"name": ["Mark", "W.", "Moyle"]}, {"name": ["Kristopher", "M.", "Barnes"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Alex", "Gonopolskiy"]}, {"name": ["Leighton", "H.", "Duncan"]}, {"name": ["Titas", "Sengupta"]}, {"name": ["Lin", "Shao"]}, {"name": ["Min", "Guo"]}, {"name": ["Anthony", "Santella"]}, {"name": ["Ryan", "Christensen"]}, {"name": ["Abhishek", "Kumar"]}, {"name": ["Yicong", "Wu"]}, {"name": ["Kevin", "R.", "Moon"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Zhirong", "Bao"]}, {"name": ["Hari", "Shroff"]}, {"name": ["William", "A.", "Mohler"]}, {"name": ["Daniel", "A.", "Colón-Ramos"]}], "year": "2021", "month": "2", "pages": "99-104", "abstract": "Neuropil is a fundamental form of tissue organization within the brain1, in which densely packed neurons synaptically interconnect into precise circuit architecture2,3. However, the structural and developmental principles that govern this nanoscale precision remain largely unknown4,5. Here we use an iterative data coarse-graining algorithm termed ‘diffusion condensation’6 to identify nested circuit structures within the Caenorhabditis elegans neuropil, which is known as the nerve ring. We show that the nerve ring neuropil is largely organized into four strata that are composed of related behavioural circuits. The stratified architecture of the neuropil is a geometrical representation of the functional segregation of sensory information and motor outputs, with specific sensory organs and muscle quadrants mapping onto particular neuropil strata. We identify groups of neurons with unique morphologies that integrate information across strata and that create neural structures that cage the strata within the nerve ring. We use high resolution light-sheet microscopy7,8 coupled with lineage-tracing and cell-tracking algorithms9,10 to resolve the developmental sequence and reveal principles of cell position, migration and outgrowth that guide stratified neuropil organization. Our results uncover conserved structural design principles that underlie the architecture and function of the nerve ring neuropil, and reveal a temporal progression of outgrowth—based on pioneer neurons—that guides the hierarchical development of the layered neuropil. Our findings provide a systematic blueprint for using structural and developmental approaches to understand neuropil organization within the brain. The C. elegans neuropil is shown to be organized into four strata composed of related behavioural circuits, and its design principles are linked to the developmental processes that underpin its assembly.", "publisher": "Nature Publishing Group", "periodical": "Nature 2021 591:7848", "keywords": ["Network models", "Neuronal development"], "urls": [{"href": "https://www.nature.com/articles/s41586-020-03169-5"}], "volume": 591, "issue": "7848", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:aIdbFUkbNIkC", "journal_source": "Nature", "cites": 38}, {"title": "Abstract LT013: Endocrine-exocrine signaling is a driver of obesity-associated pancreatic ductal adenocarcinoma", "type": "Journal Article", "authors": [{"name": ["Cathy", "Garcia"]}, {"name": ["Jaffarguriqbal", "Singh"]}, {"name": ["Lauren", "Lawres"]}, {"name": ["Sherry", "Agabiti"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Rebecca", "Cardone"]}, {"name": ["Richard", "G.", "Kibbey"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Mandar", "D.", "Muzumdar"]}], "year": "2021", "month": "3", "pages": "LT013-LT013", "abstract": "Obesity is a major modifiable host risk factor for pancreatic ductal adenocarcinoma (PDAC), the third leading cause of cancer death in the United States and a major cause of morbidity and mortality worldwide. Despite the rapid rise in the prevalence of obesity, surprisingly little is known about how it drives tumor progression. Therefore, deciphering these mechanisms is not only a societal imperative but also represents a key untapped target to develop novel strategies for PDAC prevention and therapy. Motivated by this gap in knowledge, we developed a rapid and reversible autochthonous mouse model of obesity-associated PDAC that recapitulates the genetic and histologic features of the human disease. We showed that obesity accelerates pancreatic tumorigenesis, while genetic or dietary weight loss intercepts tumor development, consistent with a causal and reversible role for obesity in early PDAC progression. By analyzing human and murine biospecimens, we defined obesity-driven microenvironmental alterations that foster tumorigenesis rather than new driver mutations, including significant inflammation, fibrosis, and islet adaptation. Specifically, we identified aberrant pancreatic beta cell expression of the hormone cholecystokinin (CCK) in response to obesity and showed that islet CCK itself promotes oncogenic Kras-driven pancreatic cancer. We further observed that CCK expression and tumor progression correlated with hyperglycemia, beta cell dysfunction, and reduced insulin secretion, suggesting that islet adaptations apart from insulin may drive tumorigenesis in obesity. By performing single-cell RNA-sequencing of islets from genetic and diet-induced obesity models, we have further nominated molecular mechanisms of CCK induction in beta cells and are testing their functional role in PDAC progression. Together, our findings argue that PDAC development is driven by local obesity-associated alterations in the tumor microenvironment, implicate a previously unappreciated endocrine-exocrine signaling axis beyond insulin in this process, and highlight the possibility of targeting the endocrine pancreas as a novel approach to intercept pancreatic exocrine tumorigenesis.Citation Format: Cathy Garcia, Jaffarguriqbal Singh, Lauren Lawres, Sherry Agabiti, Daniel B. Burkhardt, Alexander Tong, Rebecca Cardone, Richard G. Kibbey, Smita Krishnaswamy, Mandar D. Muzumdar. Endocrine-exocrine signaling is a driver of obesity-associated pancreatic ductal adenocarcinoma [abstract]. In: Proceedings of the AACR Virtual Special Conference on the Evolving Tumor Microenvironment in Cancer Progression: Mechanisms and Emerging Therapeutic Opportunities; in association with the Tumor Microenvironment (TME) Working Group; 2021 Jan 11-12. Philadelphia (PA): AACR; Cancer Res 2021;81(5 Suppl):Abstract nr LT013.", "publisher": "American Association for Cancer Research", "periodical": "Cancer Research", "keywords": [], "urls": [{"href": "https://aacrjournals.org/cancerres/article/81/5_Supplement/LT013/649152/Abstract-LT013-Endocrine-exocrine-signaling-is-a"}], "volume": 13, "issue": "5_Supplement", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:0aBXIfxlw9sC", "journal_source": "Cancer Research 81 (5_Supplement), LT013-LT", "cites": 0}, {"title": "Neural network predicts need for red blood cell transfusion for patients with acute gastrointestinal bleeding admitted to the intensive care unit", "type": "Journal Article", "authors": [{"name": ["Dennis", "Shung"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Egbert", "Castro"]}, {"name": ["J", "Kenneth", "Tay"]}, {"name": ["Michael", "Simonov"]}, {"name": ["Loren", "Laine"]}, {"name": ["Ramesh", "Batra"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "123", "month": null, "pages": "8827", "abstract": "Acute gastrointestinal bleeding is the most common gastrointestinal cause for hospitalization. For high-risk patients requiring intensive care unit stay, predicting transfusion needs during the first 24 h using dynamic risk assessment may improve resuscitation with red blood cell transfusion in admitted patients with severe acute gastrointestinal bleeding. A patient cohort admitted for acute gastrointestinal bleeding (N = 2,524) was identified from the Medical Information Mart for Intensive Care III (MIMIC-III) critical care database and separated into training (N = 2,032) and internal validation (N = 492) sets. The external validation patient cohort was identified from the eICU collaborative database of patients admitted for acute gastrointestinal bleeding presenting to large urban hospitals (N = 1,526). 62 demographic, clinical, and laboratory test features were consolidated into 4-h time intervals over the first 24 h from admission. The outcome measure was the transfusion of red blood cells during each 4-h time interval. A long short-term memory (LSTM) model, a type of Recurrent Neural Network, was compared to a regression-based models on time-updated data. The LSTM model performed better than discrete time regression-based models for both internal validation (AUROC 0.81 vs 0.75 vs 0.75; P < 0.001) and external validation (AUROC 0.65 vs 0.56 vs 0.56; P < 0.001). A LSTM model can be used to predict the need for transfusion of packed red blood cells over the first 24 h from admission to help personalize the care of high-risk patients with acute gastrointestinal bleeding. Abbreviations RNN Recurrent Neural Network LSTM Long-Short Term Memory LR Logistic Regression HER Electronic Health Record MIMIC-III Medical Information Mart for Intensive Care III AUROC Area Under the Receiver Operating Curve Acute gastrointestinal bleeding accounts for over 2.2 million hospital days and 19.2 billion dollars of medical charges annually in the United States and frequently requires red-blood cell transfusion 1. The management of severe acute gastrointestinal bleeding begins with resuscitation using intravenous fluids and transfusion of packed red blood cells, which are given to 43% of patients hospitalized with upper gastrointestinal bleeding in the United Kingdom and 21% of patients hospitalized with lower gastrointestinal bleeding in the United States 2,3. Transfusion needs may change during the hospital stay, but a tool to dynamically predict transfusion needs over time does not yet exist in clinical care. Patients with severe acute gastrointestinal bleeding who require care in the intensive care setting generally have higher transfusion needs and may benefit most from a predictive OPEN", "publisher": null, "periodical": "Scientific Reports |", "keywords": [], "urls": [{"href": "https://doi.org/10.1038/s41598-021-88226-3"}], "volume": 11, "issue": 1, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:sA9dB-pw3HoC", "journal_source": "Scientific Reports", "cites": 6}, {"title": "Quantifying the effect of experimental perturbations at single-cell resolution", "type": "Journal Article", "authors": [{"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Jay", "S.", "Stanley"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Ana", "Luisa", "Perdigoto"]}, {"name": ["Scott", "A.", "Gigante"]}, {"name": ["Kevan", "C.", "Herold"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Antonio", "J.", "Giraldez"]}, {"name": ["David", "van Dijk"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "2", "pages": "619-629", "abstract": "Current methods for comparing single-cell RNA sequencing datasets collected in multiple conditions focus on discrete regions of the transcriptional state space, such as clusters of cells. Here we quantify the effects of perturbations at the single-cell level using a continuous measure of the effect of a perturbation across the transcriptomic space. We describe this space as a manifold and develop a relative likelihood estimate of observing each cell in each of the experimental conditions using graph signal processing. This likelihood estimate can be used to identify cell populations specifically affected by a perturbation. We also develop vertex frequency clustering to extract populations of affected cells at the level of granularity that matches the perturbation response. The accuracy of our algorithm at identifying clusters of cells that are enriched or depleted in each condition is, on average, 57% higher than the next-best-performing algorithm tested. Gene signatures derived from these clusters are more accurate than those of six alternative algorithms in ground truth comparisons. Matched treatment and control single-cell RNA sequencing samples are more accurately compared at the single-cell level.", "publisher": "Nature Publishing Group", "periodical": "Nature Biotechnology 2021 39:5", "keywords": ["Gene expression", "Machine learning"], "urls": [{"href": "https://www.nature.com/articles/s41587-020-00803-5"}], "volume": 39, "issue": "5", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:-nhnvRiOwuoC", "journal_source": "Nature biotechnology", "cites": 68}, {"title": "Diffusion Earth Mover’s Distance and Distribution Embeddings", "type": "generic", "authors": [{"name": ["Alexander", "Y", "Tong"]}, {"name": ["Guillaume", "Huguet"]}, {"name": ["Amine", "Natik"]}, {"name": ["Kincaid", "Macdonald"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Ronald", "Coifman"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "7", "pages": "10336-10346", "abstract": "We propose a new fast method of measuring distances between large numbers of related high dimensional datasets called the Diffusion Earth Mover's Distance (EMD). We model the datasets as distributions supported on common data graph that is derived from the affinity matrix computed on the combined data. In such cases where the graph is a discretization of an underlying Rieman-nian closed manifold, we prove that Diffusion EMD is topologically equivalent to the standard EMD with a geodesic ground distance. Diffusion EMD can be computed iñ O(n) time and is more accurate than similarly fast algorithms such as tree-based EMDs. We also show Diffusion EMD is fully differentiable, making it amenable to future uses in gradient-descent frameworks such as deep neural networks. Finally, we demonstrate an application of Diffusion EMD to single cell data collected from 210 COVID-19 patient samples at Yale New Haven Hospital. Here, Diffusion EMD can derive distances between patients on the manifold of cells at least two orders of magnitude faster than equally accurate methods. This distance matrix between patients can be embedded into a higher level patient manifold which uncovers structure and heterogeneity in patients. More generally, Diffusion EMD is applicable to all datasets that are massively collected in parallel in many medical and biological systems.", "publisher": "PMLR", "periodical": null, "keywords": ["ICML", "Machine Learning"], "urls": [{"href": "https://proceedings.mlr.press/v139/tong21a.html"}], "volume": null, "issue": null}, {"title": "Abstract 2839: Understanding the mesenchymal-to-epithelial transition and its drivers in triple-negative breast cancer with continuous normalizing flows", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Beatriz", "P.", "San", "Juan"]}, {"name": ["Brandon", "Zhu"]}, {"name": ["Christine", "L.", "Chaffer"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "7", "pages": "2839-2839", "abstract": "Here we focus on understanding mechanisms that drive dynamic changes in gene expression and epigenetic marks that enable triple negative breast cancer cells to change states, and to thereby invade tissues and seed secondary tumors. The epithelial-to-mesenchymal transition (EMT) facilitates invasion and migration away from the primary tumor site. However, it is increasingly apparent that the reverse process, the mesenchymal-to-epithelial transition (MET), enhances metastatic colonization and growth via reacquisition of the epithelial phenotype. With no therapies currently available to stop metastatic tumor growth, we aim to uncover the mechanisms driving the MET towards identifying novel anti-metastatic therapies. We use the 3D in vitro mammosphere model system where single tumor-initiating cells residing in a partial-EMT state develop into a 3D organoid over 30 days. We sampled cells at 5 time points and performed scRNA-seq and scATAC-seq to analyze cell states. We develop a novel computational model of cellular development based on the theory of dynamic optimal transport (OT) and continuous normalizing flows. Our model TrajectoryNet is a neural ODE (ordinary differential equation) network that models the gradient of cell state with respect to time continuously over the input space and over time from cross-sectional single-cell data. TrajectoryNet interpolates between collected timepoints and learns a continuous realistic progression that describes cellular evolution in terms of gene expression and chromatin accessibility. Key to TrajectoryNet is a unique regularization to penalize the magnitude of the gradient over the flow. We prove this results in dynamic OT, thereby discouraging the neural network from taking circuitous or unrealistic paths. In contrast to TrajectoryNet, pseudotime, and RNA velocity are best at analyzing within a particular timepoint and do not handle large gaps in timepoints. We compare TrajectoryNet to RNA velocity and static OT and show that TrajectoryNet achieves better trajectories in terms of predicting withheld timepoints. Using TrajectoryNet, we identify a continuous ordering of events that occur during MET that show when and how the epithelial cell states begin to emerge. Such a continuous ordering can give rise to causal associations that can be inhibited to alter MET mechanisms. We also differentiate between trajectories that show self-renewal and maintenance of the tumor-initiating cells, and trajectories that revert to an epithelial state. Further we find that only ~10% of the initial seeded cells develop into mammospheres and identify which initial cells have the potential to seed secondary tumors. Hence, we can refine features (gene and epigenetic states) that define aggressive tumor-initiating cells in triple negative breast cancer, as well as their dynamics through the MET in order to find therapeutic targets.Citation Format: Alexander Tong, Beatriz P. San Juan, Brandon Zhu, Christine L. Chaffer, Smita Krishnaswamy. Understanding the mesenchymal-to-epithelial transition and its drivers in triple-negative breast cancer with continuous normalizing flows [abstract]. In: Proceedings of the American Association for Cancer Research Annual Meeting 2021; 2021 Apr 10-15 and May 17-21. Philadelphia (PA): AACR; Cancer Res 2021;81(13_Suppl):Abstract nr 2839.", "publisher": "American Association for Cancer Research", "periodical": "Cancer Research", "keywords": [], "urls": [{"href": "https://aacrjournals.org/cancerres/article/81/13_Supplement/2839/668765/Abstract-2839-Understanding-the-mesenchymal-to"}], "volume": null, "issue": "13_Supplement"}, {"title": "Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Patrick", "Wong"]}, {"name": ["Michael", "Simonov"]}, {"name": ["Yu", "Yamamoto"]}, {"name": ["David", "van Dijk"]}, {"name": ["Francis", "Perry", "Wilson"]}, {"name": ["Akiko", "Iwasaki"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "7", "pages": "100288", "abstract": "Often when biological entities are measured in multiple ways, there are distinct categories of information: some information is easy-to-obtain information (EI) and can be gathered on virtually every subject of interest, while other information is hard-to-obtain information (HI) and can only be gathered on some. We propose building a model to make probabilistic predictions of HI using EI. Our feature mapping GAN (FMGAN), based on the conditional GAN framework, uses an embedding network to process conditions as part of the conditional GAN training to create manifold structure when it is not readily present in the conditions. We experiment on generating RNA sequencing of cell lines perturbed with a drug conditioned on the drug's chemical structure and generating FACS data from clinical monitoring variables on a cohort of COVID-19 patients, effectively describing their immune response in great detail.", "publisher": "Elsevier", "periodical": "Patterns", "keywords": ["DSML 2: Proof-of-concept: Data science output has been formulated, implemented, and tested for one domain/problem", "clinical data monitoring", "conditional generative models", "drug perturbations", "generative adversarial networks"], "urls": [], "volume": null, "issue": "7"}, {"title": "Noise Space Optimization for GANs", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "7", "pages": null, "abstract": "Traditional Generative Adversarial Networks (GANs) sample from a continuous stochastic noise distribution, and then treating that sample as a constant, optimize the parameters of a generator network on the average loss over the sample. In other words, the generator must take samples from a continuous input distribution, and on average, match a non-continuous target distribution (the training data). The result is that, as the generator transitions from one realistic image to another, some regions of the noise space correspond to relatively high quality images and other regions correspond to relatively low quality images. To avoid these relatively low quality areas, and allow the generator to optimize the shape of its noise distribution in a data-aware way, we present a novel sampling procedure: alternating (a) the traditional approach of optimizing the generator while holding the noise space sample constant, but then also (b) moving points in the noise space to improve the loss, using the direction of the gradient, while holding the generator parameters constant. We demonstrate that this procedure, which we call noise space optimization, improves the overall quality of samples obtained from an identical model without it on a wide array of canonical datasets and training paradigms.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings of the International Joint Conference on Neural Networks", "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:SAZ1SQo2q1kC", "journal_source": "2021 International Joint Conference on Neural Networks (IJCNN)", "cites": 0}, {"title": "Canvas GAN: Bootstrapped Image-Conditional Models", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "7", "pages": null, "abstract": "Generative Adversarial Networks (GANs) learn generating functions that map a random noise distribution Z to a target data distribution. Usually, little attention is paid to the form of Z, resulting in nearly all models assuming Z follows a convenient parametric form (almost always Normal (0, 1) or Uniform(-1, 1)). However, we observe that image-conditional generators, such as those used in the CycleGAN, produce better quality generation than comparable single domain GANs can currently achieve. This is true even when the images being conditioned upon are substantially different from the target images. We hypothesize these models benefit from input which already has the general structure of images, even if their semantic content is different. As a result, we propose the Canvas GAN: using just a small handful of real images ('canvases'), we create random input for an image-conditional generator by randomly cropping, flipping along either or both axis, coloring, and resizing the canvas. These diverse samples allow the generator to edit an input that already exhibits natural image structure, as opposed to having to generate it from scratch from independent white noise.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings of the International Joint Conference on Neural Networks", "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:T_ojBgVMvoEC", "journal_source": "2021 International Joint Conference on Neural Networks (IJCNN)", "cites": 0}, {"title": "Embedding Signals on Knowledge Graphs with Unbalanced Diffusion Earth Mover's Distance", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Guillaume", "Huguet"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Amine", "Natik"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Guillaume", "Lajoie"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": "7", "pages": null, "abstract": "In modern relational machine learning it is common to encounter large graphs\nthat arise via interactions or similarities between observations in many\ndomains. Further, in many cases the target entities for analysis are actually\nsignals on such graphs. We propose to compare and organize such datasets of\ngraph signals by using an earth mover's distance (EMD) with a geodesic cost\nover the underlying graph. Typically, EMD is computed by optimizing over the\ncost of transporting one probability distribution to another over an underlying\nmetric space. However, this is inefficient when computing the EMD between many\nsignals. Here, we propose an unbalanced graph EMD that efficiently embeds the\nunbalanced EMD on an underlying graph into an $L^1$ space, whose metric we call\nunbalanced diffusion earth mover's distance (UDEMD). Next, we show how this\ngives distances between graph signals that are robust to noise. Finally, we\napply this to organizing patients based on clinical notes, embedding cells\nmodeled as signals on a gene graph, and organizing genes modeled as signals\nover a large cell graph. In each case, we show that UDEMD-based embeddings find\naccurate distances that are highly efficient compared to other methods.", "publisher": null, "periodical": null, "keywords": ["Index Terms-Optimal transport", "graph diffusion", "graph signal processing", "knowledge graph"], "urls": [{"href": "https://arxiv.org/abs/2107.12334v2"}], "volume": 12334, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:qE4H1tSSYIIC", "journal_source": "arXiv preprint arXiv:2107.", "cites": 3}, {"title": "Data-driven approaches for genetic characterization of SARS-CoV-2 lineages", "type": "Journal Article", "authors": [{"name": ["Fatima", "Mostefai"]}, {"name": ["Isabel", "Gamache"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Arnaud", "N’Guessan"]}, {"name": ["Justin", "Pelletier"]}, {"name": ["Ahmad", "Pesaranghader"]}, {"name": ["David", "Hamelin"]}, {"name": ["Carmen", "Lia", "Murall"]}, {"name": ["Raphaël", "Poujol"]}, {"name": ["Jean-Christophe", "Grenier"]}, {"name": ["Martin", "Smith"]}, {"name": ["Etienne", "Caron"]}, {"name": ["Morgan", "Craig"]}, {"name": ["Jesse", "Shapiro"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Julie", "G.", "Hussin"]}], "year": "2021", "month": "9", "pages": "2021.09.28.462270", "abstract": "The genome of the Severe Acute Respiratory Syndrome coronavirus 2 (SARS-CoV-2), the pathogen that causes coronavirus disease 2019 (COVID-19), has been sequenced at an unprecedented scale, leading to a tremendous amount of viral genome sequencing data. To understand the evolution of this virus in humans, and to assist in tracing infection pathways and designing preventive strategies, we present a set of computational tools that span phylogenomics, population genetics and machine learning approaches. To illustrate the utility of this toolbox, we detail an in depth analysis of the genetic diversity of SARS-CoV-2 in first year of the COVID-19 pandemic, using 329,854 high-quality consensus sequences published in the GISAID database during the pre-vaccination phase. We demonstrate that, compared to standard phylogenetic approaches, haplotype networks can be computed efficiently on much larger datasets, enabling real-time analyses. Furthermore, time series change of Tajima’s D provides a powerful metric of population expansion. Unsupervised learning techniques further highlight key steps in variant detection and facilitate the study of the role of this genomic variation in the context of SARS-CoV-2 infection, with Multiscale PHATE methodology identifying fine-scale structure in the SARS-CoV-2 genetic data that underlies the emergence of key lineages. The computational framework presented here is useful for real-time genomic surveillance of SARS-CoV-2 and could be applied to any pathogen that threatens the health of worldwide populations of humans and other organisms.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": ["SARS-CoV-2", "genomic diversity", "manifold learning", "population genetics"], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2021.09.28.462270v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2021.09.28.462270v1.abstract"}], "volume": 462270, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:-6RzNnnwWf8C", "journal_source": "bioRxiv, 2021.09. 28.", "cites": 3}, {"title": "A reservoir of stem-like CD8+ T cells in the tumor-draining lymph node preserves the ongoing antitumor immune response", "type": "Journal Article", "authors": [{"name": ["Kelli", "A.", "Connolly"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Aarthi", "Venkat"]}, {"name": ["Achia", "Khatun"]}, {"name": ["Jiawei", "Wang"]}, {"name": ["Ivana", "William"]}, {"name": ["Noah", "I.", "Hornick"]}, {"name": ["Brittany", "L.", "Fitzgerald"]}, {"name": ["Martina", "Damo"]}, {"name": ["Moujtaba", "Y.", "Kasmani"]}, {"name": ["Can", "Cui"]}, {"name": ["Eric", "Fagerberg"]}, {"name": ["Isabel", "Monroy"]}, {"name": ["Amanda", "Hutchins"]}, {"name": ["Julie", "F.", "Cheung"]}, {"name": ["Gena", "G.", "Foster"]}, {"name": ["Dylan", "L.", "Mariuzza"]}, {"name": ["Mursal", "Nader"]}, {"name": ["Hongyu", "Zhao"]}, {"name": ["Weiguo", "Cui"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Nikhil", "S.", "Joshi"]}], "year": "2021", "month": "10", "pages": "7836", "abstract": "“Stem-like” TCF1+ CD8+ T (TSL) cells are necessary for long-term maintenance of T cell responses and the efficacy of immunotherapy, but, as tumors contain signals that should drive T cell terminal differentiation, how these cells are maintained in tumors remains unclear. In this study, we found that a small number of TCF1+ tumor-specific CD8+ T cells were present in lung tumors throughout their development. Yet, most intratumoral T cells differentiated as tumors progressed, corresponding with an immunologic shift in the tumor microenvironment (TME) from “hot”(T cell inflamed) to “cold”(non–T cell inflamed). By contrast, most tumor-specific CD8+ T cells in tumor-draining lymph nodes (dLNs) had functions and gene expression signatures similar to TSL from chronic lymphocytic choriomeningitis virus infection, and this population was stable over time despite the changes in the TME. dLN T cells were the developmental precursors of, and were clonally related to, their more differentiated intratumoral counterparts. Our data support the hypothesis that dLN T cells are the developmental precursors of the TCF1+ T cells in tumors that are maintained by continuous migration. Last, CD8+ T cells similar to TSL were also present in LNs from patients with lung adenocarcinoma, suggesting that a similar model may be relevant in human disease. Thus, we propose that the dLN TSL reservoir has a critical function in sustaining antitumor T cells during tumor development and in protecting them from the terminal differentiation that occurs in the TME.", "publisher": "American Association for the Advancement of Science", "periodical": "Science Immunology", "keywords": [], "urls": [{"href": "https://www.science.org/doi/10.1126/sciimmunol.abg7836"}], "volume": 7836, "issue": "64", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:D_tqNUsBuKoC", "journal_source": "Science immunology 6 (64), eabg", "cites": 57}, {"title": "G2 stem cells orchestrate time-directed, long-range coordination of calcium signaling during skin epidermal regeneration", "type": "Journal Article", "authors": [{"name": ["Jessica", "L", "Moore"]}, {"name": ["Feng", "Gao"]}, {"name": ["Catherine", "Matte-Martone"]}, {"name": ["Shuangshuang", "Du"]}, {"name": ["Elizabeth", "Lathrop"]}, {"name": ["Smirthy", "Ganesan"]}, {"name": ["Lin", "Shao"]}, {"name": ["Dhananjay", "Bhaskar"]}, {"name": ["Andy", "Cox"]}, {"name": ["Caroline", "Hendry"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Valentina", "Greco"]}], "year": "2022", "month": "2", "pages": "2021.10.12.464066", "abstract": "Skin epidermal homeostasis is maintained via constant regeneration by stem cells, which must communicate to balance their self-renewal and differentiation. A key molecular pathway, Ca2+ signaling has been implicated as a signal integrator in developing and wounded epithelial tissues[[1][1], [2][2], [3][3], [4][4]]. Yet how stem cells carry out this signaling across a regenerative tissue remains unknown due to significant challenges in studying signaling dynamics in live mice, limiting our understanding of the mechanisms of stem cell communication during homeostasis. To interpret high dimensional signals that have complex spatial and temporal patterns, we combined optimized imaging of Ca2+ signaling in thousands of epidermal stem cells in living mice with a new machine learning tool, Geometric Scattering Trajectory Homology (GSTH). Using a combination of signal processing, data geometry, and topology, GSTH captures patterns of signaling at multiple scales, either between direct or distant stem cell neighbors. Here we show that epidermal stem cells display dynamic intercellular Ca2+ signaling among neighborhoods of up to 10 cells that is surprisingly coordinated and directed through time across a pool of thousands of stem cells. We find that this collective coordination is an emergent property of the stem cell compartment, distinct from excitatory quiescent neuronal tissues. We demonstrate that cycling stem cells, specifically G2 cells, govern homeostatic patterns of Ca2+ signaling. Stem cells in different cell cycle stages dynamically regulate localization of the gap junction component Connexin43 (Cx43). Lastly, we uncouple global from local communication and identify Cx43 as the molecular mediator necessary for connectivity between local signaling neighborhoods. This work provides resolution in how stem cells at different stages of the cell cycle communicate and how that diversity of phases is essential for tissue wide communication and signaling flow during epidermal regeneration. Our approach provides a framework to investigate stem cell populations and their signaling dynamics, previously not possible.\n### Competing Interest Statement\nThe authors have declared no competing interest.\n [1]: #ref-1\n [2]: #ref-2\n [3]: #ref-3\n [4]: #ref-4", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2021.10.12.464066v4"}, {"href": "https://www.biorxiv.org/content/10.1101/2021.10.12.464066v4.abstract"}], "volume": 464066, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:BOlwja0KXvYC", "journal_source": "Biorxiv, 2021.10. 12.", "cites": 1}, {"title": "Multimodal Data Visualization and Denoising with Integrated Diffusion", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": null, "pages": null, "abstract": "We propose a method called integrated diffusion for combining multimodal data, gathered via different sensors on the same system, to create a integrated data diffusion operator. As real world data suffers from both local and global noise, we introduce mechanisms to optimally calculate a diffusion operator that reflects the combined information in data by maintaining low frequency eigenvectors of each modality both globally and locally. We show the utility of this integrated operator in denoising and visualizing multimodal toy data as well as multi-omic data generated from blood cells, measuring both gene expression and chromatin accessibility. Our approach better visualizes the geometry of the integrated data and captures known cross-modality associations. More generally, integrated diffusion is broadly applicable to multimodal datasets generated by noisy sensors collected in a variety of fields.", "publisher": "IEEE Computer Society", "periodical": "IEEE International Workshop on Machine Learning for Signal Processing, MLSP", "keywords": ["data denoising", "data diffusion", "dimensionality reduction", "manifold learning", "multimodal data"], "urls": [], "volume": null, "issue": null}, {"title": "Data-Driven Learning of Geometric Scattering Modules for GNNs", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Frederick", "Wenkel"]}, {"name": ["Kincaid", "Macdonald"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Guy", "Wolf"]}], "year": "2021", "month": null, "pages": null, "abstract": "We propose a new graph neural network (GNN) module, based on relaxations of recently proposed geometric scattering transforms, which consist of a cascade of graph wavelet filters. Our learnable geometric scattering (LEGS) module enables adaptive tuning of the wavelets to encourage band-pass features to emerge in learned representations. The incorporation of our LEGS-module in GNNs enables the learning of longer-range graph relations compared to many popular GNNs, which often rely on encoding graph structure via smoothness or similarity between neighbors. Further, its wavelet priors result in simplified architectures with significantly fewer learned parameters compared to competing GNNs. We demonstrate the predictive performance of LEGS-based networks on graph classification benchmarks, as well as the descriptive quality of their learned features in biochemical graph data exploration tasks.", "publisher": "IEEE Computer Society", "periodical": "IEEE International Workshop on Machine Learning for Signal Processing, MLSP", "keywords": ["Geometric deep learning", "geometric scattering", "graph neural networks"], "urls": [], "volume": null, "issue": null}, {"title": "1-deoxysphingolipids bind to COUP-TF to modulate lymphatic and cardiac cell development", "type": "Journal Article", "authors": [{"name": ["Ting", "Wang"]}, {"name": ["Zheng", "Wang"]}, {"name": ["Lauriane", "de Fabritus"]}, {"name": ["Jinglian", "Tao"]}, {"name": ["Essa", "M.", "Saied"]}, {"name": ["Ho", "Joon", "Lee"]}, {"name": ["Bulat", "R.", "Ramazanov"]}, {"name": ["Benjamin", "Jackson"]}, {"name": ["Daniel", "Burkhardt"]}, {"name": ["Mikhail", "Parker"]}, {"name": ["Anne", "S.", "Gleinich"]}, {"name": ["Zhirui", "Wang"]}, {"name": ["Dong", "Eun", "Seo"]}, {"name": ["Ting", "Zhou"]}, {"name": ["Shihao", "Xu"]}, {"name": ["Irina", "Alecu"]}, {"name": ["Parastoo", "Azadi"]}, {"name": ["Christoph", "Arenz"]}, {"name": ["Thorsten", "Hornemann"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Serge", "A.", "van de Pavert"]}, {"name": ["Susan", "M.", "Kaech"]}, {"name": ["Natalia", "B.", "Ivanova"]}, {"name": ["Fabio", "R.", "Santori"]}], "year": "2021", "month": "11", "pages": "3128-3145.e15", "abstract": "Identification of physiological modulators of nuclear hormone receptor (NHR) activity is paramount for understanding the link between metabolism and transcriptional networks that orchestrate development and cellular physiology. Using libraries of metabolic enzymes alongside their substrates and products, we identify 1-deoxysphingosines as modulators of the activity of NR2F1 and 2 (COUP-TFs), which are orphan NHRs that are critical for development of the nervous system, heart, veins, and lymphatic vessels. We show that these non-canonical alanine-based sphingolipids bind to the NR2F1/2 ligand-binding domains (LBDs) and modulate their transcriptional activity in cell-based assays at physiological concentrations. Furthermore, inhibition of sphingolipid biosynthesis phenocopies NR2F1/2 deficiency in endothelium and cardiomyocytes, and increases in 1-deoxysphingosine levels activate NR2F1/2-dependent differentiation programs. Our findings suggest that 1-deoxysphingosines are physiological regulators of NR2F1/2-mediated transcription.", "publisher": "Cell Press", "periodical": "Developmental Cell", "keywords": ["1-deoxysphingosine", "COUP-TF", "NR2F1", "NR2F2", "NR2F6", "SPTLC2", "cardiomyocyte", "lymphatic", "metabolism", "sphingolipid"], "urls": [], "volume": 0, "issue": "22", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:unp9ATQDT5gC", "journal_source": "Developmental Cell 56 (22), 3128-3145.", "cites": 3}, {"title": "MURAL: An Unsupervised Random Forest-Based Embedding for Electronic Health Record Data", "type": "Journal Article", "authors": [{"name": ["Michal", "Gerasimiuk"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Adrian", "Stanley"]}, {"name": ["Michael", "Schultz"]}, {"name": ["Jeffrey", "Ngu"]}, {"name": ["Loren", "Laine"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2021", "month": null, "pages": "4694-4704", "abstract": "A major challenge in embedding or visualizing clinical patient data is the heterogeneity of variable types including continuous lab values, categorical diagnostic codes, as well as missing or incomplete data. In particular, in EHR data, some variables are missing not at random (MNAR) but deliberately not collected and thus are a source of information. For example, lab tests may be deemed necessary for some patients on the basis of suspected diagnosis, but not for others. Here we present the MURAL forest - an unsupervised random forest for representing data with disparate variable types (e.g., categorical, continuous, MNAR). MURAL forests consist of a set of decision trees where node-splitting variables are chosen at random, such that the marginal entropy of all other variables is minimized by the split. This allows us to also split on MNAR variables and discrete variables in a way that is consistent with the continuous variables. The end goal is to learn the MURAL embedding of patients using average tree distances between those patients. These distances can be fed to nonlinear dimensionality reduction method like PHATE to derive visualizable embeddings. While such methods are ubiquitous in continuous-valued datasets (like single cell RNA-sequencing) they have not been used extensively in mixed variable data. We showcase the use of our method on one artificial and two clinical datasets. We show that using our approach, we can visualize and classify data more accurately than competing approaches. Finally, we show that MURAL can also be used to compare cohorts of patients via the recently proposed tree-sliced Wasserstein distances.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "Proceedings - 2021 IEEE International Conference on Big Data, Big Data 2021", "keywords": ["data analysis", "electronic medical records", "random forests", "unsupervised learning"], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:NxmKEeNBbOMC", "journal_source": "2021 IEEE International Conference on Big Data (Big Data)", "cites": 0}, {"title": "Diffusion-Based Methods for Estimating Curvature in Data", "type": "generic", "authors": [{"name": ["Dhananjay", "Bhaskar"]}, {"name": ["Kincaid", "MacDonald"]}, {"name": ["Dawson", "Thomas"]}, {"name": ["Sarah", "Zhao"]}, {"name": ["Kisung", "You"]}, {"name": ["Jennifer", "Paige"]}, {"name": ["Yariv", "Aizenbud"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Ian", "M", "Adelstein"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "4", "pages": null, "abstract": "High-throughput high-dimensional data is now being generated in massive quantities in many fields including biology, medicine, chemistry, finance, and physics. Researchers have successfully used manifold learning in order to gain insight from such data, particularly in biomedical and single-cell data. One such technique, data diffusion geometry, has been useful in understanding manifold intrinsic distances, density, and major non-linear axes or paths through the data. However, a relatively unstudied feature of high-dimensional data is curvature. While curvature is well-defined and easy to compute in low dimensions, it poses computational and conceptual difficulties in high dimensions. Here, we present two techniques to estimate curvature from high-dimensional data starting from data diffusion probabilities. The first technique, diffusion curvature, uses the spread or conversely laziness of a random walk to estimate curvature pointwise in data. The second technique, deep diffusion curvature, trains a neural network to estimate pointwise curvature. Since these techniques are scalable, we anticipate that they can be used to describe and compare datasets as well as find points in data that represent transitional entities.", "publisher": null, "periodical": null, "keywords": [], "urls": [], "volume": 0, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:Zh0EY9V9P6UC", "journal_source": "ICLR 2022 Workshop on Geometrical and Topological Representation Learning", "cites": 1}, {"title": "Multimodal single cell data integration challenge: results and lessons learned", "type": "Journal Article", "authors": [{"name": ["Christopher", "Lance"]}, {"name": ["Malte", "D.", "Luecken"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Robrecht", "Cannoodt"]}, {"name": ["Pia", "Rautenstrauch"]}, {"name": ["Anna", "Laddach"]}, {"name": ["Aidyn", "Ubingazhibov"]}, {"name": ["Zhi-Jie", "Cao"]}, {"name": ["Kaiwen", "Deng"]}, {"name": ["Sumeer", "Khan"]}, {"name": ["Qiao", "Liu"]}, {"name": ["Nikolay", "Russkikh"]}, {"name": ["Gleb", "Ryazantsev"]}, {"name": ["Uwe", "Ohler"]}, {"name": ["NeurIPS", "2021", "Multimodal", "data", "integration", "competition", "participants"]}, {"name": ["Angela", "Oliveira", "Pisco"]}, {"name": ["Jonathan", "Bloom"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Fabian", "J.", "Theis"]}], "year": "2022", "month": "4", "pages": "2022.04.11.487796", "abstract": "Biology has become a data-intensive science. Recent technological advances in single-cell genomics have enabled the measurement of multiple facets of cellular state, producing datasets with millions of single-cell observations. While these data hold great promise for understanding molecular mechanisms in health and disease, analysis challenges arising from sparsity, technical and biological variability, and high dimensionality of the data hinder the derivation of such mechanistic insights. To promote the innovation of algorithms for analysis of multimodal single-cell data, we organized a competition at NeurIPS 2021 applying the Common Task Framework to multimodal single-cell data integration. For this competition we generated the first multimodal benchmarking dataset for single-cell biology and defined three tasks in this domain: prediction of missing modalities, aligning modalities, and learning a joint representation across modalities. We further specified evaluation metrics and developed a cloud-based algorithm evaluation pipeline. Using this setup, 280 competitors submitted over 2600 proposed solutions within a 3 month period, showcasing substantial innovation especially in the modality alignment task. Here, we present the results, describe trends of well performing approaches, and discuss challenges associated with running the competition.\n### Competing Interest Statement\nFJT reports receiving consulting fees from ImmunAI and ownership interest in Dermagnostix GmbH and Cellarity. DBB and JMB report being employed by and holding equity interest in Cellarity Inc.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": ["benchmarking datasets", "big data integration", "computational biology", "multimodal", "multiomics", "single-cell genomics"], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.04.11.487796v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.04.11.487796v1.abstract"}], "volume": 487796, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:8dzOF9BpDQoC", "journal_source": "bioRxiv, 2022.04. 11.", "cites": 10}, {"title": "linc-mipep and linc-wrb encode micropeptides that regulate chromatin accessibility in vertebrate-specific neural cells", "type": "Journal Article", "authors": [{"name": ["Valerie", "A.", "Tornini"]}, {"name": ["Ho-Joon", "Lee"]}, {"name": ["Liyun", "Miao"]}, {"name": ["Yin", "Tang"]}, {"name": ["Sarah", "E.", "Dube"]}, {"name": ["Timothy", "Gerson"]}, {"name": ["Valeria", "J.", "Schmidt"]}, {"name": ["Katherine", "Du"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["François", "Kroll"]}, {"name": ["Charles", "E.", "Vejnar"]}, {"name": ["Ariel", "A.", "Bazzini"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Jason", "Rihel"]}, {"name": ["Antonio", "J.", "Giraldez"]}], "year": "2022", "month": "7", "pages": "2022.07.21.501032", "abstract": "Thousands of long intergenic non-coding RNAs (lincRNAs) are transcribed throughout the vertebrate genome. A subset of lincRNAs enriched in developing brains has recently been found to contain cryptic open reading frames and are speculated to encode micropeptides. However, systematic identification and functional assessment of these transcripts have been hindered by technical challenges caused by their small size. Here we show that two putative lincRNAs ( linc-mipep and linc-wrb ) encode micropeptides with homology to the vertebrate-specific chromatin architectural protein, Hmgn1, and demonstrate that they are required for development of vertebrate-specific brain cell types. Specifically, we show that NMDA receptor-mediated pathways are dysregulated in zebrafish lacking these micropeptides and that their loss preferentially alters the gene regulatory networks that establish cerebellar cells and oligodendrocytes – evolutionarily newer cell types that develop postnatally in humans. These findings highlight the power of screening for unexplored micropeptide functions by revealing a key missing link in the evolution of vertebrate brain cell development and illustrating a genetic basis for how some neural cell types are more susceptible to chromatin disruptions, with implications for neurodevelopmental disorders and disease.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.07.21.501032v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.07.21.501032v1.abstract"}], "volume": 501032, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:oPLKW5k6eA4C", "journal_source": "bioRxiv, 2022.07. 21.", "cites": 0}, {"title": "spARC recovers human glioma spatial signaling networks with graph filtering", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Danielle", "F.", "Miyagishima"]}, {"name": ["Holly", "R.", "Steach"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Yutaka", "Takeo"]}, {"name": ["Phan", "Q.", "Duy"]}, {"name": ["Tanyeri", "Barak"]}, {"name": ["E.", "Zeynep", "Erson-Omay"]}, {"name": ["Scott", "Youlten"]}, {"name": ["Ketu", "Mishra-Gorur"]}, {"name": ["Jennifer", "Moliterno"]}, {"name": ["Declan", "McGuone"]}, {"name": ["Murat", "Günel"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "8", "pages": "2022.08.24.505139", "abstract": "Biological networks operate within architectural frameworks that influence the state and function of cells through niche-specific factors such as exposure to nutrients and metabolites, soluble signaling molecules, and direct cognate cell-cell communication. Spatial omics technologies incorporate environmental information into the study of biological systems, where the spatial coordinates of cells may directly or indirectly encode these micro-anatomical features. However, they suffer from technical artifacts, such as dropout, that impede biological discovery. Current methods that attempt to correct for this fail to adequately integrate highly informative spatial information when recovering gene expression and modelling cell-cell dynamics in situ . To address this oversight, we developed spatial Affinity-graph Recovery of Counts (spARC), a data diffusion-based filtration method that shares information between neighboring cells in tissue and related cells in expression space, to recover gene dynamics and simulate signalling interactions in spatial transcriptomics data. Following validation, we applied spARC to 10 IDH-mutant surgically resected human gliomas across WHO grades II-IV in order to study signaling networks across disease progression. This analysis revealed co-expressed genes that border the interface between tumor and tumor-infiltrated brain, allowing us to characterize global and local structure of glioma. By simulating paracrine signaling in silico , we identified an Osteopontin-CD44 interaction enriched in grade IV relative to grade II and grade III astrocytomas, and validated the clinical relevance of this signaling axis using TCGA.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.08.24.505139v1"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.08.24.505139v1.abstract"}], "volume": 505139, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:X0DADzN9RKwC", "journal_source": "bioRxiv, 2022.08. 24.", "cites": 0}, {"title": "Modeling uniquely human gene regulatory function via targeted humanization of the mouse genome", "type": "Journal Article", "authors": [{"name": ["Emily", "V.", "Dutrow"]}, {"name": ["Deena", "Emera"]}, {"name": ["Kristina", "Yim"]}, {"name": ["Severin", "Uebbing"]}, {"name": ["Acadia", "A.", "Kocher"]}, {"name": ["Martina", "Krenzer"]}, {"name": ["Timothy", "Nottoli"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Angeliki", "Louvi"]}, {"name": ["James", "P.", "Noonan"]}], "year": "2022", "month": "1", "pages": "1-15", "abstract": "The evolution of uniquely human traits likely entailed changes in developmental gene regulation. Human Accelerated Regions (HARs), which include transcriptional enhancers harboring a significant excess of human-specific sequence changes, are leading candidates for driving gene regulatory modifications in human development. However, insight into whether HARs alter the level, distribution, and timing of endogenous gene expression remains limited. We examined the role of the HAR HACNS1 (HAR2) in human evolution by interrogating its molecular functions in a genetically humanized mouse model. We find that HACNS1 maintains its human-specific enhancer activity in the mouse embryo and modifies expression of Gbx2, which encodes a transcription factor, during limb development. Using single-cell RNA-sequencing, we demonstrate that Gbx2 is upregulated in the limb chondrogenic mesenchyme of HACNS1 homozygous embryos, supporting that HACNS1 alters gene expression in cell types involved in skeletal patterning. Our findings illustrate that humanized mouse models provide mechanistic insight into how HARs modified gene expression in human evolution. Human Accelerated Regions (HARs) are prime candidates for driving the evolution of uniquely human traits. Using humanized mice, the authors show how one HAR alters gene expression during embryonic development, yielding insight into HAR function.", "publisher": "Nature Publishing Group", "periodical": "Nature Communications 2022 13:1", "keywords": ["Evolutionary biology", "Evolutionary genetics", "Gene regulation", "RNA sequencing"], "urls": [{"href": "https://www.nature.com/articles/s41467-021-27899-w"}], "volume": 13, "issue": "1", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:isU91gLudPYC", "journal_source": "Nature Communications", "cites": 6}, {"title": "ReLSO: A Transformer-based Model for Latent Space Optimization and Generation of Proteins", "type": "Journal Article", "authors": [{"name": ["Egbert", "Castro"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Julian", "Rubinfien"]}, {"name": ["Kevin", "B.", "Givechian"]}, {"name": ["Dhananjay", "Bhaskar"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "1", "pages": null, "abstract": "The development of powerful natural language models have increased the\nability to learn meaningful representations of protein sequences. In addition,\nadvances in high-throughput mutagenesis, directed evolution, and\nnext-generation sequencing have allowed for the accumulation of large amounts\nof labeled fitness data. Leveraging these two trends, we introduce Regularized\nLatent Space Optimization (ReLSO), a deep transformer-based autoencoder which\nfeatures a highly structured latent space that is trained to jointly generate\nsequences as well as predict fitness. Through regularized prediction heads,\nReLSO introduces a powerful protein sequence encoder and novel approach for\nefficient fitness landscape traversal. Using ReLSO, we explicitly model the\nsequence-function landscape of large labeled datasets and generate new\nmolecules by optimizing within the latent space using gradient-based methods.\nWe evaluate this approach on several publicly-available protein datasets,\nincluding variant sets of anti-ranibizumab and GFP. We observe a greater\nsequence optimization efficiency (increase in fitness per optimization step) by\nReLSO compared to other approaches, where ReLSO more robustly generates\nhigh-fitness sequences. Furthermore, the attention-based relationships learned\nby the jointly-trained ReLSO models provides a potential avenue towards\nsequence-level fitness attribution information.", "publisher": null, "periodical": null, "keywords": [], "urls": [{"href": "https://arxiv.org/abs/2201.09948v2"}], "volume": null, "issue": null}, {"title": "Population Genomics Approaches for Genetic Characterization of SARS-CoV-2 Lineages", "type": "Journal Article", "authors": [{"name": ["Fatima", "Mostefai"]}, {"name": ["Isabel", "Gamache"]}, {"name": ["Arnaud", "N'Guessan"]}, {"name": ["Justin", "Pelletier"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Carmen", "Lia", "Murall"]}, {"name": ["Ahmad", "Pesaranghader"]}, {"name": ["Vanda", "Gaonac'h-Lovejoy"]}, {"name": ["David", "J.", "Hamelin"]}, {"name": ["Raphaël", "Poujol"]}, {"name": ["Jean", "Christophe", "Grenier"]}, {"name": ["Martin", "Smith"]}, {"name": ["Etienne", "Caron"]}, {"name": ["Morgan", "Craig"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["B.", "Jesse", "Shapiro"]}, {"name": ["Julie", "G.", "Hussin"]}], "year": "2022", "month": "2", "pages": "207", "abstract": "The genome of the Severe Acute Respiratory Syndrome coronavirus 2 (SARS-CoV-2), the pathogen that causes coronavirus disease 2019 (COVID-19), has been sequenced at an unprecedented scale leading to a tremendous amount of viral genome sequencing data. To assist in tracing infection pathways and design preventive strategies, a deep understanding of the viral genetic diversity landscape is needed. We present here a set of genomic surveillance tools from population genetics which can be used to better understand the evolution of this virus in humans. To illustrate the utility of this toolbox, we detail an in depth analysis of the genetic diversity of SARS-CoV-2 in first year of the COVID-19 pandemic. We analyzed 329,854 high-quality consensus sequences published in the GISAID database during the pre-vaccination phase. We demonstrate that, compared to standard phylogenetic approaches, haplotype networks can be computed efficiently on much larger datasets. This approach enables real-time lineage identification, a clear description of the relationship between variants of concern, and efficient detection of recurrent mutations. Furthermore, time series change of Tajima's D by haplotype provides a powerful metric of lineage expansion. Finally, principal component analysis (PCA) highlights key steps in variant emergence and facilitates the visualization of genomic variation in the context of SARS-CoV-2 diversity. The computational framework presented here is simple to implement and insightful for real-time genomic surveillance of SARS-CoV-2 and could be applied to any pathogen that threatens the health of populations of humans and other organisms.", "publisher": "Frontiers Media S.A.", "periodical": "Frontiers in Medicine", "keywords": ["SARS-CoV-2", "haplotype network", "lineage annotation", "population genomics", "principal component analysis", "variant detection", "viral surveillance"], "urls": [], "volume": null, "issue": null}, {"title": "The landscape of pioneer factor activity reveals the mechanisms of chromatin reprogramming and genome activation", "type": "Journal Article", "authors": [{"name": ["Liyun", "Miao"]}, {"name": ["Yin", "Tang"]}, {"name": ["Ashley", "R.", "Bonneau"]}, {"name": ["Shun", "Hang", "Chan"]}, {"name": ["Mina", "L.", "Kojima"]}, {"name": ["Mark", "E.", "Pownall"]}, {"name": ["Charles", "E.", "Vejnar"]}, {"name": ["Feng", "Gao"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Caroline", "E.", "Hendry"]}, {"name": ["Antonio", "J.", "Giraldez"]}], "year": "2022", "month": "3", "pages": "986-1002.e9", "abstract": "Upon fertilization, embryos undergo chromatin reprogramming and genome activation; however, the mechanisms that regulate these processes are poorly understood. Here, we generated a triple mutant for Nanog, Pou5f3, and Sox19b (NPS) in zebrafish and found that NPS pioneer chromatin opening at >50% of active enhancers. NPS regulate acetylation across core histones at enhancers and promoters, and their function in gene activation can be bypassed by recruiting histone acetyltransferase to individual genes. NPS pioneer chromatin opening individually, redundantly, or additively depending on sequence context, and we show that high nucleosome occupancy facilitates NPS pioneering activity. Nucleosome position varies based on the input of different transcription factors (TFs), providing a flexible platform to modulate pioneering activity. Altogether, our results illuminate the sequence of events during genome activation and offer a conceptual framework to understand how pioneer factors interpret the genome and integrate different TF inputs across cell types and developmental transitions.", "publisher": "Cell Press", "periodical": "Molecular Cell", "keywords": ["chromatin accessibility", "chromatin reprogramming", "genome activation", "histone acetylation", "nucleosome occupancy", "pioneer transcription factors"], "urls": [], "volume": 0, "issue": "5", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:-uzm3Y7AvW0C", "journal_source": "Molecular Cell 82 (5), 986-1002.", "cites": 15}, {"title": "Time-inhomogeneous diffusion geometry and topology", "type": "Journal Article", "authors": [{"name": ["Guillaume", "Huguet"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Matthew", "Hirn"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "3", "pages": null, "abstract": "Diffusion condensation is a dynamic process that yields a sequence of\nmultiscale data representations that aim to encode meaningful abstractions. It\nhas proven effective for manifold learning, denoising, clustering, and\nvisualization of high-dimensional data. Diffusion condensation is constructed\nas a time-inhomogeneous process where each step first computes and then applies\na diffusion operator to the data. We theoretically analyze the convergence and\nevolution of this process from geometric, spectral, and topological\nperspectives. From a geometric perspective, we obtain convergence bounds based\non the smallest transition probability and the radius of the data, whereas from\na spectral perspective, our bounds are based on the eigenspectrum of the\ndiffusion kernel. Our spectral results are of particular interest since most of\nthe literature on data diffusion is focused on homogeneous processes. From a\ntopological perspective, we show diffusion condensation generalizes\ncentroid-based hierarchical clustering. We use this perspective to obtain a\nbound based on the number of data points, independent of their location. To\nunderstand the evolution of the data geometry beyond convergence, we use\ntopological data analysis. We show that the condensation process itself defines\nan intrinsic condensation homology. We use this intrinsic topology as well as\nthe ambient persistent homology of the condensation process to study how the\ndata changes over diffusion time. We demonstrate both types of topological\ninformation in well-understood toy examples. Our work gives theoretical\ninsights into the convergence of diffusion condensation, and shows that it\nprovides a link between topological and geometric data analysis.", "publisher": null, "periodical": null, "keywords": ["37B25", "57R40", "62R40", "68xxx", "diffusion", "hierarchical clustering AMS subject classifications 57M50", "persistent homology", "time-inhomogeneous process", "topological data analysis"], "urls": [{"href": "https://arxiv.org/abs/2203.14860v2"}], "volume": 14860, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:4aZ_i-5WJEQC", "journal_source": "arXiv preprint arXiv:2203.", "cites": 0}, {"title": "Exploring the Geometry and Topology of Neural Network Loss Landscapes", "type": "Journal Article", "authors": [{"name": ["Stefan", "Horoi"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Guillaume", "Lajoie"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": null, "pages": "171-184", "abstract": "Recent work has established clear links between the generalization performance of trained neural networks and the geometry of their loss landscape near the local minima to which they converge. This suggests that qualitative and quantitative examination of the loss landscape geometry could yield insights about neural network generalization performance during training. To this end, researchers have proposed visualizing the loss landscape through the use of simple dimensionality reduction techniques. However, such visualization methods have been limited by their linear nature and only capture features in one or two dimensions, thus restricting sampling of the loss landscape to lines or planes. Here, we expand and improve upon these in three ways. First, we present a novel “jump and retrain” procedure for sampling relevant portions of the loss landscape. We show that the resulting sampled data holds more meaningful information about the network’s ability to generalize. Next, we show that non-linear dimensionality reduction of the jump and retrain trajectories via PHATE, a trajectory and manifold-preserving method, allows us to visualize differences between networks that are generalizing well vs poorly. Finally, we combine PHATE trajectories with a computational homology characterization to quantify trajectory differences.", "publisher": "Springer Science and Business Media Deutschland GmbH", "periodical": "Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)", "keywords": ["Artificial neural network loss landscape", "Non-linear dimensionality reduction", "Topological data analysis"], "urls": [{"href": "https://link.springer.com/chapter/10.1007/978-3-031-01333-1_14"}], "volume": null, "issue": null}, {"title": "Multiscale PHATE identifies multimodal signatures of COVID-19", "type": "Journal Article", "authors": [{"name": ["Manik", "Kuchroo"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Patrick", "Wong"]}, {"name": ["Jean", "Christophe", "Grenier"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Carolina", "Lucas"]}, {"name": ["Jon", "Klein"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Bastian", "Rieck"]}, {"name": ["Benjamin", "Israelow"]}, {"name": ["Michael", "Simonov"]}, {"name": ["Tianyang", "Mao"]}, {"name": ["Ji", "Eun", "Oh"]}, {"name": ["Julio", "Silva"]}, {"name": ["Takehiro", "Takahashi"]}, {"name": ["Camila", "D.", "Odio"]}, {"name": ["Arnau", "Casanovas-Massana"]}, {"name": ["John", "Fournier"]}, {"name": ["Abeer", "Obaid"]}, {"name": ["Adam", "Moore"]}, {"name": ["Alice", "Lu-Culligan"]}, {"name": ["Allison", "Nelson"]}, {"name": ["Anderson", "Brito"]}, {"name": ["Angela", "Nunez"]}, {"name": ["Anjelica", "Martin"]}, {"name": ["Anne", "L.", "Wyllie"]}, {"name": ["Annie", "Watkins"]}, {"name": ["Annsea", "Park"]}, {"name": ["Arvind", "Venkataraman"]}, {"name": ["Bertie", "Geng"]}, {"name": ["Chaney", "Kalinich"]}, {"name": ["Chantal", "B.F.", "Vogels"]}, {"name": ["Christina", "Harden"]}, {"name": ["Codruta", "Todeasa"]}, {"name": ["Cole", "Jensen"]}, {"name": ["Daniel", "Kim"]}, {"name": ["David", "McDonald"]}, {"name": ["Denise", "Shepard"]}, {"name": ["Edward", "Courchaine"]}, {"name": ["Elizabeth", "B.", "White"]}, {"name": ["Eric", "Song"]}, {"name": ["Erin", "Silva"]}, {"name": ["Eriko", "Kudo"]}, {"name": ["Giuseppe", "DeIuliis"]}, {"name": ["Haowei", "Wang"]}, {"name": ["Harold", "Rahming"]}, {"name": ["Hong", "Jai", "Park"]}, {"name": ["Irene", "Matos"]}, {"name": ["Isabel", "M.", "Ott"]}, {"name": ["Jessica", "Nouws"]}, {"name": ["Jordan", "Valdez"]}, {"name": ["Joseph", "Fauver"]}, {"name": ["Joseph", "Lim"]}, {"name": ["Kadi", "Ann", "Rose"]}, {"name": ["Kelly", "Anastasio"]}, {"name": ["Kristina", "Brower"]}, {"name": ["Laura", "Glick"]}, {"name": ["Lokesh", "Sharma"]}, {"name": ["Lorenzo", "Sewanan"]}, {"name": ["Lynda", "Knaggs"]}, {"name": ["Maksym", "Minasyan"]}, {"name": ["Maria", "Batsu"]}, {"name": ["Maria", "Tokuyama"]}, {"name": ["M.", "Cate", "Muenker"]}, {"name": ["Mary", "Petrone"]}, {"name": ["Maxine", "Kuang"]}, {"name": ["Maura", "Nakahata"]}, {"name": ["Melissa", "Campbell"]}, {"name": ["Melissa", "Linehan"]}, {"name": ["Michael", "H.", "Askenase"]}, {"name": ["Michael", "Simonov"]}, {"name": ["Mikhail", "Smolgovsky"]}, {"name": ["Nathan", "D.", "Grubaugh"]}, {"name": ["Nicole", "Sonnert"]}, {"name": ["Nida", "Naushad"]}, {"name": ["Pavithra", "Vijayakumar"]}, {"name": ["Peiwen", "Lu"]}, {"name": ["Rebecca", "Earnest"]}, {"name": ["Rick", "Martinello"]}, {"name": ["Roy", "Herbst"]}, {"name": ["Rupak", "Datta"]}, {"name": ["Ryan", "Handoko"]}, {"name": ["Santos", "Bermejo"]}, {"name": ["Sarah", "Lapidus"]}, {"name": ["Sarah", "Prophet"]}, {"name": ["Sean", "Bickerton"]}, {"name": ["Sofia", "Velazquez"]}, {"name": ["Subhasis", "Mohanty"]}, {"name": ["Tara", "Alpert"]}, {"name": ["Tyler", "Rice"]}, {"name": ["Wade", "Schulz"]}, {"name": ["William", "Khoury-Hanold"]}, {"name": ["Xiaohua", "Peng"]}, {"name": ["Yexin", "Yang"]}, {"name": ["Yiyun", "Cao"]}, {"name": ["Yvette", "Strong"]}, {"name": ["Shelli", "Farhadian"]}, {"name": ["Charles", "S.", "Dela Cruz"]}, {"name": ["Albert", "I.", "Ko"]}, {"name": ["Matthew", "J.", "Hirn"]}, {"name": ["F.", "Perry", "Wilson"]}, {"name": ["Julie", "G.", "Hussin"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Akiko", "Iwasaki"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "2", "pages": "681-691", "abstract": "As the biomedical community produces datasets that are increasingly complex and high dimensional, there is a need for more sophisticated computational tools to extract biological insights. We present Multiscale PHATE, a method that sweeps through all levels of data granularity to learn abstracted biological features directly predictive of disease outcome. Built on a coarse-graining process called diffusion condensation, Multiscale PHATE learns a data topology that can be analyzed at coarse resolutions for high-level summarizations of data and at fine resolutions for detailed representations of subsets. We apply Multiscale PHATE to a coronavirus disease 2019 (COVID-19) dataset with 54 million cells from 168 hospitalized patients and find that patients who die show CD16hiCD66blo neutrophil and IFN-γ+ granzyme B+ Th17 cell responses. We also show that population groupings from Multiscale PHATE directly fed into a classifier predict disease outcome more accurately than naive featurizations of the data. Multiscale PHATE is broadly generalizable to different data types, including flow cytometry, single-cell RNA sequencing (scRNA-seq), single-cell sequencing assay for transposase-accessible chromatin (scATAC-seq), and clinical variables. Disease signatures in high-dimensional biomedical data are detected with a visualization algorithm.", "publisher": "Nature Publishing Group", "periodical": "Nature Biotechnology 2022 40:5", "keywords": ["Computational models", "Machine learning", "Viral infection"], "urls": [{"href": "https://www.nature.com/articles/s41587-021-01186-x"}], "volume": 40, "issue": "5", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:KWzIFqRkAKkC", "journal_source": "Nature biotechnology", "cites": 17}, {"title": "HSV-2 increases replication of HIV in human T cells", "type": "Journal Article", "authors": [{"name": ["Carl", "A", "Pierce"]}, {"name": ["Paula", "Preston-Hurlburt"]}, {"name": ["Lip", "Nam", "Loh"]}, {"name": ["Holly", "Steach"]}, {"name": ["Simone", "Sidoli"]}, {"name": ["Fengrui", "Zhang"]}, {"name": ["William", "Philbrick"]}, {"name": ["Michel", "Nassar"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Kevan", "C", "Herold"]}, {"name": ["Betsy", "C", "Herold"]}], "year": "2022", "month": "5", "pages": "182.40-182.40", "abstract": "Herpes simplex virus 2 (HSV-2) infection is a major factor driving the global HIV epidemic, leading to increased HIV plasma viral loads (PVLs) and transmission. Previous studies which focused on mucosal responses cannot explain the observed effects of HSV-2 on HIV PVLs. We sought to determine mechanisms by which HSV-2 increases HIV PVLs. CD4 T cells are recruited to sites of HSV-2 lesions and HSV-2 can infect these cells. Phenotyping of CD4 cells infected with HSV-2 in vitro suggested a preference for T follicular helper cells, an HIV latent reservoir. HSV infection of latently infected Jurkat-2D10 cells resulted in a 10-fold increase in HIV ltr expression. After exposing CD4 cells from HIV+ donors to HSV-2, HIV p24 was detected only in cells expressing HSV-2 glycoprotein B (gB), a marker of productive HSV-2 infection. Bulk and single cell RNAseq on FACS-purified, HSV-infected and uninfected CD4 cells demonstrated reduced expression of HIV restriction factors in HSV+ cells; HSV exposed but uninfected cells exhibited higher expression of interferon response genes, potentially explaining their resistance to HIV reactivation. HSV+ cells exhibited increased expression of the lncRNA MALAT1, which may promote HIV reactivation through epigenetic modification, and HSV infection of 2D10 and CD4 cells led to decreased histone deacetylase activity. Transfection of 2D10 cells with HSV protein VP16 resulted in significantly increased HIV ltr and MALAT1 gene expression, and reduced epigenetic silencing marks. HIV proteins were also increased by proteomic analyses. These findings identify several mechanisms by which HSV-2 directly triggers HIV reactivation, such as the up-regulation of the lncRNA MALAT1.Supported by grants from the NIH (R01 AI134367, T32 AI007501, T32 GM007288)", "publisher": "American Association of Immunologists", "periodical": "The Journal of Immunology", "keywords": [], "urls": [{"href": "https://journals.aai.org/jimmunol/article/208/1_Supplement/182.40/237133/HSV-2-increases-replication-of-HIV-in-human-T"}], "volume": 40, "issue": "1_Supplement", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:lYAcb2jw7qUC", "journal_source": "The Journal of Immunology 208 (1_Supplement), 182.40-182.", "cites": 0}, {"title": "Multi-view manifold learning of human brain state trajectories", "type": "Journal Article", "authors": [{"name": ["Erica", "L.", "Busch"]}, {"name": ["Jessie", "Huang"]}, {"name": ["Andrew", "Benz"]}, {"name": ["Tom", "Wallenstein"]}, {"name": ["Guillaume", "Lajoie"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Nicholas", "B.", "Turk-Browne"]}], "year": "2022", "month": "10", "pages": "2022.05.03.490534", "abstract": "The complexity and intelligence of the brain give the illusion that measurements of brain activity will have intractably high dimensionality, rife with collection and biological noise. Nonlinear dimensionality reduction methods like UMAP and t-SNE have proven useful for high-throughput biomedical data. However, they have not been used extensively for brain imaging data such as from functional magnetic resonance imaging (fMRI), a noninvasive, secondary measure of neural activity over time containing redundancy and co-modulation from neural population activity. Here we introduce a nonlinear manifold learning algorithm for timeseries data like fMRI, called temporal potential of heat-diffusion for affinity-based transition embedding (T-PHATE). In addition to recovering a lower intrinsic dimensionality from timeseries data, T-PHATE exploits autocorrelative structure within the data to faithfully denoise dynamic signals and learn activation manifolds. We empirically validate T-PHATE on three human fMRI datasets, showing that T-PHATE significantly improves data visualization, classification, and segmentation of the data relative to several other state-of-the-art dimensionality reduction benchmarks.These notable improvements suggest many potential applications of T-PHATE to other high-dimensional datasets of temporally-diffuse processes.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.05.03.490534v4"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.05.03.490534v4.abstract"}], "volume": null, "issue": null}, {"title": "EMBEDDING SIGNALS ON GRAPHS WITH UNBALANCED DIFFUSION EARTH MOVER'S DISTANCE", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Guillaume", "Huguet"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Amine", "Natik"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Guillaume", "Lajoie"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": null, "pages": "5647-5651", "abstract": "In modern relational machine learning it is common to encounter large graphs that arise via interactions or similarities between observations in many domains. Further, in many cases the target entities for analysis are actually signals on such graphs. We propose to compare and organize such datasets of graph signals by using an earth mover's distance (EMD) with a geodesic cost over the underlying graph. Typically, EMD is computed by optimizing over the cost of transporting one probability distribution to another over an underlying metric space. However, this is inefficient when computing the EMD between many signals. Here, we propose an unbalanced graph EMD that efficiently embeds the unbalanced EMD on an underlying graph into an L1 space, whose metric we call unbalanced diffusion earth mover's distance (UDEMD). Next, we show how this gives distances between graph signals that are robust to noise. Finally, we apply this to organizing patients based on clinical notes, embedding cells modeled as signals on a gene graph, and organizing genes modeled as signals over a large cell graph. In each case, we show that UDEMD-based embeddings find accurate distances that are highly efficient compared to other methods.", "publisher": "Institute of Electrical and Electronics Engineers Inc.", "periodical": "ICASSP, IEEE International Conference on Acoustics, Speech and Signal Processing - Proceedings", "keywords": ["Optimal transport", "graph diffusion", "graph signal processing", "knowledge graph"], "urls": [], "volume": null, "issue": null}, {"title": "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration", "type": "Journal Article", "authors": [{"name": ["Brian", "Palmer", "Hafler"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Marcello", "DiStasio"]}, {"name": ["Eric", "Song"]}, {"name": ["Le", "Zhang"]}, {"name": ["Maryam", "Ige"]}, {"name": ["Amar", "Sheth"]}, {"name": ["Madhvi", "Menon"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Yu", "Xing"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Jessie", "Huang"]}, {"name": ["George", "Mourgkos"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Rahul", "Dhodapkar"]}, {"name": ["Guy", "Wolf"]}], "year": "2022", "month": "6", "pages": "2314-2314", "abstract": null, "publisher": "The Association for Research in Vision and Ophthalmology", "periodical": "Investigative Ophthalmology & Visual Science", "keywords": [], "urls": [], "volume": 63, "issue": "7", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:mel-f30kHHgC", "journal_source": "Investigative Ophthalmology &Visual Science", "cites": 0}, {"title": "Deep learning for quality assessment of optical coherence tomography angiography images", "type": "Journal Article", "authors": [{"name": ["Jay", "C", "Wang"]}, {"name": ["Rahul", "Dhodapkar"]}, {"name": ["Emily", "Li"]}, {"name": ["Kristen", "Harris", "Nwanyanwu"]}, {"name": ["Ron", "A", "Adelman"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "6", "pages": "202 –  F0049-202 –  F0049", "abstract": null, "publisher": "The Association for Research in Vision and Ophthalmology", "periodical": "Investigative Ophthalmology & Visual Science", "keywords": [], "urls": [], "volume": 12, "issue": "7", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:nPT8s1NX_-sC", "journal_source": "Investigative Ophthalmology &Visual Science 63 (7), 202–F0049-202–F", "cites": 0}, {"title": "Manifold Interpolating Optimal-Transport Flows for Trajectory Inference", "type": "Journal Article", "authors": [{"name": ["Guillaume", "Huguet"]}, {"name": ["D.", "S.", "Magruder"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Oluwadamilola", "Fasina"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "6", "pages": null, "abstract": "We present a method called Manifold Interpolating Optimal-Transport Flow\n(MIOFlow) that learns stochastic, continuous population dynamics from static\nsnapshot samples taken at sporadic timepoints. MIOFlow combines dynamic models,\nmanifold learning, and optimal transport by training neural ordinary\ndifferential equations (Neural ODE) to interpolate between static population\nsnapshots as penalized by optimal transport with manifold ground distance.\nFurther, we ensure that the flow follows the geometry by operating in the\nlatent space of an autoencoder that we call a geodesic autoencoder (GAE). In\nGAE the latent space distance between points is regularized to match a novel\nmultiscale geodesic distance on the data manifold that we define. We show that\nthis method is superior to normalizing flows, Schr\\\"odinger bridges and other\ngenerative models that are designed to flow from noise to data in terms of\ninterpolating between populations. Theoretically, we link these trajectories\nwith dynamic optimal transport. We evaluate our method on simulated data with\nbifurcations and merges, as well as scRNA-seq data from embryoid body\ndifferentiation, and acute myeloid leukemia treatment.", "publisher": null, "periodical": null, "keywords": [], "urls": [{"href": "https://arxiv.org/abs/2206.14928v2"}], "volume": 14928, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:SxCCDk4iOpsC", "journal_source": "arXiv preprint arXiv:2206.", "cites": 2}, {"title": "Single-Cell Multi-Modal GAN (scMMGAN) reveals spatial patterns in single-cell data from triple negative breast cancer", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Scott", "E", "Youlten"]}, {"name": ["Aarthi", "Venkat"]}, {"name": ["Beatriz", "P", "San", "Juan"]}, {"name": ["Christine", "Chaffer"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "7", "pages": "2022.07.04.498732", "abstract": "Exciting advances in technologies to measure biological systems are currently at the forefront of research. The ability to gather data along an increasing number of omic dimensions has created a need for tools to analyze all of this information together, rather than siloing each technology into separate analysis pipelines. To advance this goal, we introduce a framework called the Single-Cell Multi-Modal GAN (scMMGAN) that integrates data from multiple modalities into a unified representation in the ambient data space for downstream analysis using a combination of adversarial learning and data geometry techniques. The framework’s key improvement is an additional diffusion geometry loss with a new kernel that constrains the otherwise over-parameterized GAN network. We demonstrate scMMGAN’s ability to produce more meaningful alignments than alternative methods on a wide variety of data modalities, and that its output can be used to draw conclusions from real-world biological experimental data. We highlight data from an experiment studying the development of triple negative breast cancer, where we show how scMMGAN can be used to identify novel gene associations and we demonstrate that cell clusters identified only on the scRNAseq data occur in localized spatial patterns that reveal insights on the spatial transcriptomic images.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.07.04.498732v2"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.07.04.498732v2.abstract"}], "volume": 498732, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:c_xDhezhKKUC", "journal_source": "bioRxiv, 2022.07. 04.", "cites": 1}, {"title": "Mapping Phenotypic Plasticity upon the Cancer Cell State Landscape Using Manifold Learning", "type": "Journal Article", "authors": [{"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Beatriz", "P.", "San Juan"]}, {"name": ["John", "G.", "Lock"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Christine", "L.", "Chaffer"]}], "year": "2022", "month": "8", "pages": "1847-1859", "abstract": "Phenotypic plasticity describes the ability of cancer cells to undergo dynamic, nongenetic cell state changes that amplify cancer heterogeneity to promote metastasis and therapy evasion. Thus, cancer cells occupy a continuous spectrum of phenotypic states connected by trajectories defining dynamic transitions upon a cancer cell state landscape. With technologies proliferating to systematically record molecular mechanisms at single-cell resolution, we illuminate manifold learning techniques as emerging computational tools to effectively model cell state dynamics in a way that mimics our understanding of the cell state landscape. We anticipate that “state-gating” therapies targeting phenotypic plasticity will limit cancer heterogeneity, metastasis, and therapy resistance. Significance: Nongenetic mechanisms underlying phenotypic plasticity have emerged as significant drivers of tumor heterogeneity, metastasis, and therapy resistance. Herein, we discuss new experimental and computational techniques to define phenotypic plasticity as a scaffold to guide accelerated progress in uncovering new vulnerabilities for therapeutic exploitation.", "publisher": "American Association for Cancer Research Inc.", "periodical": "Cancer Discovery", "keywords": [], "urls": [{"href": "https://aacrjournals.org/cancerdiscovery/article/12/8/1847/707250/Mapping-Phenotypic-Plasticity-upon-the-Cancer-Cell"}], "volume": null, "issue": "8"}, {"title": "Integrated transcriptome and trajectory analysis of cutaneous T-cell lymphoma identifies putative precancer populations", "type": "Journal Article", "authors": [{"name": ["Jingjing", "Ren"]}, {"name": ["Rihao", "Qu"]}, {"name": ["Nur-Taz", "Rahman"]}, {"name": ["Julia", "M.", "Lewis"]}, {"name": ["Amber", "Loren", "Ong", "King"]}, {"name": ["Xiaofeng", "Liao"]}, {"name": ["Fatima", "N.", "Mirza"]}, {"name": ["Kacie", "R.", "Carlson"]}, {"name": ["Yaqing", "Huang"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Benjamin", "Evans"]}, {"name": ["Barani", "Kumar", "Rajendran"]}, {"name": ["Suzanne", "Xu"]}, {"name": ["Guilin", "Wang"]}, {"name": ["Francine", "M.", "Foss"]}, {"name": ["William", "Damsky"]}, {"name": ["Yuval", "Kluger"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Michael", "Girardi"]}], "year": "2023", "month": "2", "pages": "445-457", "abstract": "Cutaneous T-cell lymphoma (CTCL) incidence increases with age, and blood involvement portends a worse prognosis. To advance our understanding of CTCL development and identify potential therapeutic targets, we performed integrative analyses of paired single-cell RNA and TCR sequencing of peripheral blood CD4+ T-cells from CTCL patients to reveal disease unifying features. The malignant CD4+ T-cells of CTCL show highly diverse transcriptomic profiles across patients, with most displaying a mature Th2 differentiation and T-cell exhaustion phenotype. TCR-CDR3 peptide prediction analysis suggested limited diversity between CTCL samples, consistent with a role for a common antigenic stimulus. PHATE affinity-based transition analysis identified putative precancerous circulating populations characterized by an intermediate stage of gene expression and mutation level between the normal CD4+ T-cells and malignant CTCL cells. We further revealed the therapeutic potential of targeting CD82 and JAK that endow the malignant CTCL cells with survival and proliferation advantages.", "publisher": "American Society of Hematology", "periodical": "Blood Advances", "keywords": [], "urls": [{"href": "https://ashpublications.org/bloodadvances/article/7/3/445/486179/Integrated-transcriptome-and-trajectory-analysis"}], "volume": 7, "issue": "3", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:nqdriD65xNoC", "journal_source": "Blood Advances, bloodadvances.", "cites": 0}, {"title": "Deep learning for quality assessment of optical coherence tomography angiography images", "type": "Journal Article", "authors": [{"name": ["Rahul", "M.", "Dhodapkar"]}, {"name": ["Emily", "Li"]}, {"name": ["Kristen", "Nwanyanwu"]}, {"name": ["Ron", "Adelman"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Jay", "C.", "Wang"]}], "year": "2022", "month": "8", "pages": "1-9", "abstract": "Optical coherence tomography angiography (OCTA) is an emerging non-invasive technique for imaging the retinal vasculature. While there are many promising clinical applications for OCTA, determination of image quality remains a challenge. We developed a deep learning-based system using a ResNet152 neural network classifier, pretrained using ImageNet, to classify images of the superficial capillary plexus in 347 scans from 134 patients. Images were also manually graded by two independent graders as a ground truth for the supervised learning models. Because requirements for image quality may vary depending on the clinical or research setting, two models were trained—one to identify high-quality images and one to identify low-quality images. Our neural network models demonstrated outstanding area under the curve (AUC) metrics for both low quality image identification (AUC = 0.99, 95%CI 0.98–1.00, $$\\kappa $$ = 0.90) and high quality image identification (AUC = 0.97, 95%CI 0.96–0.99, $$\\kappa $$ = 0.81), significantly outperforming machine-reported signal strength (AUC = 0.82, 95%CI 0.77–0.86, $$\\kappa $$ = 0.52 and AUC = 0.78, 95%CI 0.73–0.83, $$\\kappa $$ = 0.27 respectively). Our study demonstrates that techniques from machine learning may be used to develop flexible and robust methods for quality control of OCTA images.", "publisher": "Nature Publishing Group", "periodical": "Scientific Reports 2022 12:1", "keywords": ["Medical imaging", "Translational research"], "urls": [{"href": "https://www.nature.com/articles/s41598-022-17709-8"}], "volume": 12, "issue": "1", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:nPT8s1NX_-sC", "journal_source": "Investigative Ophthalmology &Visual Science 63 (7), 202–F0049-202–F", "cites": 0}, {"title": "Learnable Filters for Geometric Scattering Modules", "type": "Journal Article", "authors": [{"name": ["Alexander", "Tong"]}, {"name": ["Frederik", "Wenkel"]}, {"name": ["Dhananjay", "Bhaskar"]}, {"name": ["Kincaid", "Macdonald"]}, {"name": ["Jackson", "Grady"]}, {"name": ["Michael", "Perlmutter"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Guy", "Wolf"]}], "year": "2022", "month": "8", "pages": null, "abstract": "We propose a new graph neural network (GNN) module, based on relaxations of\nrecently proposed geometric scattering transforms, which consist of a cascade\nof graph wavelet filters. Our learnable geometric scattering (LEGS) module\nenables adaptive tuning of the wavelets to encourage band-pass features to\nemerge in learned representations. The incorporation of our LEGS-module in GNNs\nenables the learning of longer-range graph relations compared to many popular\nGNNs, which often rely on encoding graph structure via smoothness or similarity\nbetween neighbors. Further, its wavelet priors result in simplified\narchitectures with significantly fewer learned parameters compared to competing\nGNNs. We demonstrate the predictive performance of LEGS-based networks on graph\nclassification benchmarks, as well as the descriptive quality of their learned\nfeatures in biochemical graph data exploration tasks. Our results show that\nLEGS-based networks match or outperforms popular GNNs, as well as the original\ngeometric scattering construction, on many datasets, in particular in\nbiochemical domains, while retaining certain mathematical properties of\nhandcrafted (non-learned) geometric scattering.", "publisher": null, "periodical": null, "keywords": ["Graph Neural Networks", "Graph Signal Processing", "Index Terms-Geometric Scattering"], "urls": [{"href": "https://arxiv.org/abs/2208.07458v1"}], "volume": 7458, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:_AeoHAGD03cC", "journal_source": "arXiv preprint arXiv:2208.", "cites": 1}, {"title": "Geometric Scattering on Measure Spaces", "type": "Journal Article", "authors": [{"name": ["Joyce", "Chew"]}, {"name": ["Matthew", "Hirn"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Deanna", "Needell"]}, {"name": ["Michael", "Perlmutter"]}, {"name": ["Holly", "Steach"]}, {"name": ["Siddharth", "Viswanath"]}, {"name": ["Hau-Tieng", "Wu"]}], "year": "2022", "month": "8", "pages": null, "abstract": "The scattering transform is a multilayered, wavelet-based transform initially\nintroduced as a model of convolutional neural networks (CNNs) that has played a\nfoundational role in our understanding of these networks' stability and\ninvariance properties. Subsequently, there has been widespread interest in\nextending the success of CNNs to data sets with non-Euclidean structure, such\nas graphs and manifolds, leading to the emerging field of geometric deep\nlearning. In order to improve our understanding of the architectures used in\nthis new field, several papers have proposed generalizations of the scattering\ntransform for non-Euclidean data structures such as undirected graphs and\ncompact Riemannian manifolds without boundary. In this paper, we introduce a general, unified model for geometric scattering\non measure spaces. Our proposed framework includes previous work on geometric\nscattering as special cases but also applies to more general settings such as\ndirected graphs, signed graphs, and manifolds with boundary. We propose a new\ncriterion that identifies to which groups a useful representation should be\ninvariant and show that this criterion is sufficient to guarantee that the\nscattering transform has desirable stability and invariance properties.\nAdditionally, we consider finite measure spaces that are obtained from randomly\nsampling an unknown manifold. We propose two methods for constructing a\ndata-driven graph on which the associated graph scattering transform\napproximates the scattering transform on the underlying manifold. Moreover, we\nuse a diffusion-maps based approach to prove quantitative estimates on the rate\nof convergence of one of these approximations as the number of sample points\ntends to infinity. Lastly, we showcase the utility of our method on spherical\nimages, directed graphs, and on high-dimensional single-cell data.", "publisher": "Elsevier BV", "periodical": "SSRN Electronic Journal", "keywords": [], "urls": [{"href": "https://arxiv.org/abs/2208.08561v2"}], "volume": null, "issue": null}, {"title": "Molecular Graph Generation via Geometric Scattering", "type": "Journal Article", "authors": [{"name": ["Dhananjay", "Bhaskar"]}, {"name": ["Jackson", "Grady"]}, {"name": ["Egbert", "Castro"]}, {"name": ["Michael", "Perlmutter"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": null, "pages": null, "abstract": "Although existing deep learning models perform remarkably well at predicting physicochemical properties and binding affinities, the generation of new molecules with optimized properties remains challenging. Inherently, most GNNs perform poorly in whole-graph representation due to the limitations of the message-passing paradigm. Furthermore, step-by-step graph generation frameworks that use reinforcement learning or other sequential processing can be slow and result in a high proportion of invalid molecules with substantial post-processing needed in order to generate valid molecules. To address these issues, we propose a representation-first approach to molecular graph generation. We guide the latent representation of an autoencoder by capturing graph structure information with the geometric scattering transform and apply penalties that organize the representation by molecular properties. We show that this highly structured latent space can be directly used for molecular graph generation by the use of a GAN. We demonstrate that our architecture learns meaningful representations of drug datasets and provides a platform for drug synthesis using publicly available ZINC and BindingDB datasets.", "publisher": "IEEE Computer Society", "periodical": "IEEE International Workshop on Machine Learning for Signal Processing, MLSP", "keywords": ["Drug Discovery", "Geometric Scattering", "Molecular Graph Generation"], "urls": [], "volume": null, "issue": null}, {"title": "Learning Shared Neural Manifolds from Multi-Subject FMRI Data", "type": "Journal Article", "authors": [{"name": ["Jessie", "Huang"]}, {"name": ["Erica", "Busch"]}, {"name": ["Tom", "Wallenstein"]}, {"name": ["Michal", "Gerasimiuk"]}, {"name": ["Andrew", "Benz"]}, {"name": ["Guillaume", "Lajoie"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Nicholas", "Turk-Browne"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": null, "pages": null, "abstract": "Functional magnetic resonance imaging (fMRI) data is collected in millions of noisy, redundant dimensions. To understand how different brains process the same stimulus, we aim to denoise the fMRI signal via a meaningful embedding space that captures the data's intrinsic structure as shared across brains. We assume that stimulus-driven responses share latent features common across subjects that are jointly discoverable. Previous approaches to this problem have relied on linear methods like principal component analysis and shared response modeling. We propose a neural network called MRMD-AE (manifold-regularized multiple- decoder, autoencoder) that learns a common embedding from multi-subject fMRI data while retaining the ability to decode individual responses. Our latent common space represents an extensible manifold (where untrained data can be mapped) and improves classification accuracy of stimulus features of unseen timepoints, as well as cross-subject translation of fMRI signals.", "publisher": "IEEE Computer Society", "periodical": "IEEE International Workshop on Machine Learning for Signal Processing, MLSP", "keywords": [], "urls": [], "volume": null, "issue": null}, {"title": "Immune cells and their inflammatory mediators modify β cells and cause checkpoint inhibitor–induced diabetes", "type": "Journal Article", "authors": [{"name": ["Ana", "Luisa", "Perdigoto"]}, {"name": ["Songyan", "Deng"]}, {"name": ["Katherine", "C.", "Du"]}, {"name": ["Manik", "Kuchroo"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Gary", "Israel"]}, {"name": ["Marie", "E.", "Robert"]}, {"name": ["Stuart", "P.", "Weisberg"]}, {"name": ["Nancy", "Kirkiles-Smith"]}, {"name": ["Angeliki", "M.", "Stamatouli"]}, {"name": ["Harriet", "M.", "Kluger"]}, {"name": ["Zoe", "Quandt"]}, {"name": ["Arabella", "Young"]}, {"name": ["Mei", "Ling", "Yang"]}, {"name": ["Mark", "J.", "Mamula"]}, {"name": ["Jordan", "S.", "Pober"]}, {"name": ["Mark", "S.", "Anderson"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Kevan", "C.", "Herold"]}], "year": "2022", "month": "9", "pages": null, "abstract": "Checkpoint inhibitors (CPIs) targeting programmed death 1 (PD-1)/programmed death ligand 1 (PD-L1) and cytotoxic T lymphocyte antigen 4 (CTLA-4) have revolutionized cancer treatment but can trigger autoimmune complications, including CPI-induced diabetes mellitus (CPI-DM), which occurs preferentially with PD-1 blockade. We found evidence of pancreatic inflammation in patients with CPI-DM with shrinkage of pancreases, increased pancreatic enzymes, and in a case from a patient who died with CPI-DM, peri-islet lymphocytic infiltration. In the NOD mouse model, anti–PD-L1 but not anti–CTLA-4 induced diabetes rapidly. RNA sequencing revealed that cytolytic IFN-γ+CD8+ T cells infiltrated islets with anti–PD-L1. Changes in β cells were predominantly driven by IFN-γ and TNF-α and included induction of a potentially novel β cell population with transcriptional changes suggesting dedifferentiation. IFN-γ increased checkpoint ligand expression and activated apoptosis pathways in human β cells in vitro. Treatment with anti–IFN-γ and anti–TNF-α prevented CPI-DM in anti–PD-L1–treated NOD mice. CPIs targeting the PD-1/PD-L1 pathway resulted in transcriptional changes in β cells and immune infiltrates that may lead to the development of diabetes. Inhibition of inflammatory cytokines can prevent CPI-DM, suggesting a strategy for clinical application to prevent this complication.", "publisher": "American Society for Clinical Investigation", "periodical": "JCI Insight", "keywords": [], "urls": [{"href": "https://doi.org/10.1172/jci."}], "volume": 7, "issue": "17", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:hQUaER0FWQ4C", "journal_source": "JCI insight", "cites": 2}, {"title": "Single-cell multi-modal GAN reveals spatial patterns in single-cell data from triple-negative breast cancer", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Scott", "E.", "Youlten"]}, {"name": ["Aarthi", "Venkat"]}, {"name": ["Beatriz", "P.", "San Juan"]}, {"name": ["Christine", "L.", "Chaffer"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "9", "pages": "100577", "abstract": "Summary Exciting advances in technologies to measure biological systems are currently at the forefront of research. The ability to gather data along an increasing number of omic dimensions has created a need for tools to analyze all of this information together, rather than siloing each technology into separate analysis pipelines. To advance this goal, we introduce a framework called the single-cell multi-modal generative adversarial network (scMMGAN) that integrates data from multiple modalities into a unified representation in the ambient data space for downstream analysis using a combination of adversarial learning and data geometry techniques. The framework's key improvement is an additional diffusion geometry loss with a new kernel that constrains the otherwise over-parameterized GAN. We demonstrate scMMGAN's ability to produce more meaningful alignments than alternative methods on a wide variety of data modalities and that its output can be used to draw conclusions from real-world biological experimental data.", "publisher": "Elsevier", "periodical": "Patterns", "keywords": [], "urls": [], "volume": 3, "issue": "9", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:BJrgspguQaEC", "journal_source": "Patterns", "cites": 0}, {"title": "CUTS: A Fully Unsupervised Framework for Medical Image Segmentation", "type": "Journal Article", "authors": [{"name": ["Matthew", "Amodio"]}, {"name": ["Feng", "Gao"]}, {"name": ["Arman", "Avesta"]}, {"name": ["Sanjay", "Aneja"]}, {"name": ["Lucian", "V.", "Del Priore"]}, {"name": ["Jay", "Wang"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "9", "pages": null, "abstract": "In this work we introduce CUTS (Contrastive and Unsupervised Training for\nSegmentation) the first fully unsupervised deep learning framework for medical\nimage segmentation, facilitating the use of the vast majority of imaging data\nthat is not labeled or annotated. Segmenting medical images into regions of\ninterest is a critical task for facilitating both patient diagnoses and\nquantitative research. A major limiting factor in this segmentation is the lack\nof labeled data, as getting expert annotations for each new set of imaging data\nor task can be expensive, labor intensive, and inconsistent across annotators:\nthus, we utilize self-supervision based on pixel-centered patches from the\nimages themselves. Our unsupervised approach is based on a training objective\nwith both contrastive learning and autoencoding aspects. Previous contrastive\nlearning approaches for medical image segmentation have focused on image-level\ncontrastive training, rather than our intra-image patch-level approach or have\nused this as a pre-training task where the network needed further supervised\ntraining afterwards. By contrast, we build the first entirely unsupervised\nframework that operates at the pixel-centered-patch level. Specifically, we add\nnovel augmentations, a patch reconstruction loss, and introduce a new pixel\nclustering and identification framework. Our model achieves improved results on\nseveral key medical imaging tasks, as verified by held-out expert annotations\non the task of segmenting geographic atrophy (GA) regions of images of the\nretina.", "publisher": null, "periodical": null, "keywords": ["deep learn-ing", "image segmentation", "representation learning", "unsupervised learning"], "urls": [{"href": "https://arxiv.org/abs/2209.11359v1"}], "volume": 11359, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:Ic1VZgkJnDsC", "journal_source": "arXiv preprint arXiv:2209.", "cites": 0}, {"title": "Transformer-based protein generation with regularized latent space optimization", "type": "Journal Article", "authors": [{"name": ["Egbert", "Castro"]}, {"name": ["Abhinav", "Godavarthi"]}, {"name": ["Julian", "Rubinfien"]}, {"name": ["Kevin", "Givechian"]}, {"name": ["Dhananjay", "Bhaskar"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "9", "pages": "840-851", "abstract": "The development of powerful natural language models has improved the ability to learn meaningful representations of protein sequences. In addition, advances in high-throughput mutagenesis, directed evolution and next-generation sequencing have allowed for the accumulation of large amounts of labelled fitness data. Leveraging these two trends, we introduce Regularized Latent Space Optimization (ReLSO), a deep transformer-based autoencoder, which features a highly structured latent space that is trained to jointly generate sequences as well as predict fitness. Through regularized prediction heads, ReLSO introduces a powerful protein sequence encoder and a novel approach for efficient fitness landscape traversal. Using ReLSO, we explicitly model the sequence–function landscape of large labelled datasets and generate new molecules by optimizing within the latent space using gradient-based methods. We evaluate this approach on several publicly available protein datasets, including variant sets of anti-ranibizumab and green fluorescent protein. We observe a greater sequence optimization efficiency (increase in fitness per optimization step) using ReLSO compared with other approaches, where ReLSO more robustly generates high-fitness sequences. Furthermore, the attention-based relationships learned by the jointly trained ReLSO models provide a potential avenue towards sequence-level fitness attribution information. The space of possible proteins is vast, and optimizing proteins for specific target properties computationally is an ongoing challenge, even with large amounts of data. Castro and colleagues combine a transformer-based model with regularized prediction heads to form a smooth and pseudoconvex latent space that allows for easier navigation and more efficient optimization of proteins.", "publisher": "Nature Publishing Group", "periodical": "Nature Machine Intelligence 2022 4:10", "keywords": ["Machine learning", "Protein design"], "urls": [{"href": "https://www.nature.com/articles/s42256-022-00532-1"}], "volume": 4, "issue": "10", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:37UQlXuwjP4C", "journal_source": "Nature Machine Intelligence", "cites": 4}, {"title": "Trellis Single-Cell Screening Reveals Stromal Regulation of Patient-Derived Organoid Drug Responses", "type": "Journal Article", "authors": [{"name": ["María", "Ramos", "Zapatero"]}, {"name": ["Alexander", "Tong"]}, {"name": ["Jahangir", "Sufi"]}, {"name": ["Petra", "Vlckova"]}, {"name": ["Ferran", "Cardoso", "Rodriguez"]}, {"name": ["Callum", "Nattress"]}, {"name": ["Xiao", "Qin"]}, {"name": ["Daniel", "Hochhauser"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Christopher", "J.", "Tape"]}], "year": "2023", "month": "1", "pages": "2022.10.19.512668", "abstract": "Patient-derived organoids (PDOs) can model personalized therapy responses, however current screening technologies cannot reveal drug response mechanisms or study how tumor microenvironment cells alter therapeutic performance. To address this, we developed a highly-multiplexed mass cytometry platform to measure post translational modification (PTM) signaling in >2,500 colorectal cancer (CRC) PDOs and cancer-associated fibroblasts (CAFs) in response to clinical therapies at single-cell resolution. To compare patient- and microenvironment-specific drug responses in thousands of single-cell datasets, we developed Trellis — a highly-scalable, hierarchical tree-based treatment effect analysis method. Trellis single-cell screening revealed that on-target cell-cycle blockage and DNA-damage drug effects are common, even in chemorefractory PDOs. However, drug-induced apoptosis is patient-specific. We found drug-induced apoptosis does not correlate with genotype or clinical staging but does align with cell-intrinsic PTM signaling in PDOs. CAFs protect chemosensitive PDOs by shifting cancer cells into a slow-cycling cell-state and CAF chemoprotection can be reversed by inhibiting YAP.\nHighlights \n### Competing Interest Statement\nS.K. is on the scientific advisory board of KovaDx and AI Therapeutics.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.10.19.512668v2"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.10.19.512668v2.abstract"}], "volume": 512668, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:wLxue7F8ec0C", "journal_source": "bioRxiv, 2022.10. 19.", "cites": 0}, {"title": "Spatiotemporal coordination of stem cell behavior following alveolar injury", "type": "Journal Article", "authors": [{"name": ["Maurizio", "Chioccioli"]}, {"name": ["Sumner", "Magruder"]}, {"name": ["John", "E.", "McDonough"]}, {"name": ["Jessica", "Nouws"]}, {"name": ["Tao", "Yang"]}, {"name": ["David", "Gonzalez"]}, {"name": ["Lucia", "Borriello"]}, {"name": ["Brian", "Traub"]}, {"name": ["Xianjun", "Ye"]}, {"name": ["Caroline", "E.", "Hendry"]}, {"name": ["David", "Entenberg"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Naftali", "Kaminski"]}, {"name": ["Maor", "Sauler"]}], "year": "2022", "month": "11", "pages": "2022.10.28.514255", "abstract": "Tissue repair requires a highly coordinated cellular response to injury. In the lung, alveolar type 2 (AT2) cells act as stem cells and can replace both themselves and alveolar type 1 cells (AT1); however, the complex orchestration of AT2 stem cell activity following lung injury is poorly understood owing to the inability of tracking individual stem cells and their dynamic behavior over time. Here, we apply live time lapse imaging to ex vivo mouse precision cut lung slice (PCLS) culture and in vivo mouse lung to track individual GFP-labeled AT2 cells following induction of alveolar injury by bleomycin. We observe highly dynamic movement of AT2 cells, including migration within and between alveoli. To map the dynamic evolution of AT2 cell behavior, we introduce Live Cell Encoder (LCE-PHATE), a novel method for converting static snapshots from time lapse imaging into single points representative of entire, dynamic cellular trajectories. Applying LCE-PHATE, we observe the emergence of at least three distinct morphokinetic AT2 cell states associated with AT2 stem cell injury response. Finally, small molecule-based inhibition of Rho-associated protein kinase (ROCK) pathway significantly reduced motility of AT2 stem cells following injury and reduced expression of Krt8, a marker of intermediate progenitor cells. Together, our results uncover motility of alveolar stem cells as a new injury response mechanism in the lung and reveal properties of stem cell motility at high cellular resolution.\n### Competing Interest Statement\nThe authors have declared no competing interest.", "publisher": "Cold Spring Harbor Laboratory", "periodical": "bioRxiv", "keywords": [], "urls": [{"href": "https://www.biorxiv.org/content/10.1101/2022.10.28.514255v3"}, {"href": "https://www.biorxiv.org/content/10.1101/2022.10.28.514255v3.abstract"}], "volume": 514255, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:jmjb1lOE9QIC", "journal_source": "bioRxiv, 2022.10. 28.", "cites": 0}, {"title": "Prediction of Death after Terminal Extubation, the Machine Learning Way", "type": "Journal Article", "authors": [{"name": ["Jessie", "Huang"]}, {"name": ["Dennis", "Shung"]}, {"name": ["Tanushree", "Burman"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Ramesh", "K", "Batra"]}], "year": "2022", "month": "11", "pages": "S95-S96", "abstract": null, "publisher": "Ovid Technologies (Wolters Kluwer Health)", "periodical": "Journal of the American College of Surgeons", "keywords": [], "urls": [{"href": "https://journals.lww.com/journalacs/Fulltext/2022/11002/Prediction_of_Death_after_Terminal_Extubation,_the.239.aspx"}], "volume": 96, "issue": "5", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:c59VksA5Vz4C", "journal_source": "Journal of the American College of Surgeons 235 (5), S95-S", "cites": 0}, {"title": "Geodesic Sinkhorn: optimal transport for high-dimensional datasets", "type": "Journal Article", "authors": [{"name": ["Guillaume", "Huguet"]}, {"name": ["Alexander", "Tong"]}, {"name": ["María", "Ramos", "Zapatero"]}, {"name": ["Guy", "Wolf"]}, {"name": ["Smita", "Krishnaswamy"]}], "year": "2022", "month": "11", "pages": null, "abstract": "Understanding the dynamics and reactions of cells from population snapshots\nis a major challenge in single-cell transcriptomics. Here, we present Geodesic\nSinkhorn, a method for interpolating populations along a data manifold that\nleverages existing kernels developed for single-cell dimensionality reduction\nand visualization methods. Our Geodesic Sinkhorn method uses a heat-geodesic\nground distance that, as compared to Euclidean ground distances, is more\naccurate for interpolating single-cell dynamics on a wide variety of datasets\nand significantly speeds up the computation for sparse kernels. We first apply\nGeodesic Sinkhorn to 10 single-cell transcriptomics time series interpolation\ndatasets as a drop-in replacement for existing interpolation methods where it\noutperforms on all datasets, showing its effectiveness in modeling cell\ndynamics. Second, we show how to efficiently approximate the operator with\npolynomial kernels allowing us to improve scaling to large datasets. Finally,\nwe define the conditional Wasserstein-average treatment effect and show how it\ncan elucidate the treatment effect on single-cell populations on a drug screen.", "publisher": null, "periodical": null, "keywords": ["Cell ·", "Dynamics ·", "Interpolation ·", "Optimal", "Single-", "Transport"], "urls": [{"href": "https://arxiv.org/abs/2211.00805v1"}], "volume": 805, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:dAp6zn-oMfAC", "journal_source": "arXiv preprint arXiv:2211.", "cites": 0}, {"title": "The Manifold Scattering Transform for High-Dimensional Point Cloud Data", "type": "generic", "authors": [{"name": ["Joyce", "Chew"]}, {"name": ["Holly", "Steach"]}, {"name": ["Siddharth", "Viswanath"]}, {"name": ["Hau-Tieng", "Wu"]}, {"name": ["Matthew", "Hirn"]}, {"name": ["Deanna", "Needell"]}, {"name": ["Matthew", "D.", "Vesely"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Michael", "Perlmutter"]}], "year": "2022", "month": "11", "pages": "67-78", "abstract": "The manifold scattering transform is a deep feature extractor for data defined on a Riemannian manifold. It is one of the first examples of extending convolu-tional neural network-like operators to general manifolds. The initial work on this model focused primarily on its theoretical stability and invariance properties but did not provide methods for its numerical implementation except in the case of two-dimensional surfaces with predefined meshes. In this work, we present practical schemes, based on the theory of diffusion maps, for implementing the manifold scattering transform to datasets arising in naturalistic systems, such as single cell genetics, where the data is a high-dimensional point cloud modeled as lying on a low-dimensional manifold. We show that our methods are effective for signal classification and manifold classification tasks.", "publisher": "PMLR", "periodical": null, "keywords": [], "urls": [{"href": "https://proceedings.mlr.press/v196/chew22a.html"}], "volume": 2022, "issue": 0, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:RtRctb2lSbAC", "journal_source": "Topological, Algebraic and Geometric Learning Workshops", "cites": 2}, {"title": "Abstract C050: Elucidating mechanisms of endocrine-exocrine signaling in obesity-driven pancreatic cancer", "type": "Journal Article", "authors": [{"name": ["Cathy", "C.", "Garcia"]}, {"name": ["Lauren", "Lawres"]}, {"name": ["Sherry", "Agabiti"]}, {"name": ["Jaffarguriqbal", "Singh"]}, {"name": ["Alex", "Tong"]}, {"name": ["Aarthi", "Venkat"]}, {"name": ["Daniel", "B.", "Burkhardt"]}, {"name": ["Rebecca", "Cardone"]}, {"name": ["Richard", "G.", "Kibbey"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Mandar", "D.", "Muzumdar"]}], "year": "2022", "month": "11", "pages": "C050-C050", "abstract": "Pancreatic ductal adenocarcinoma (PDAC) is the third leading cause of cancer-related death in the United States. Various epidemiologic studies have shown that obesity increases the risk of PDAC. With rising rates of obesity worldwide, it is imperative that we understand the mechanisms by which obesity promotes PDAC progression. Therefore, to study the effect of obesity on PDAC, we combined a well-established genetic model of obesity (Lepob/ob) with a faithful oncogenic Kras-driven pancreatic cancer model (KC: Pdx1-Cre; KrasLSL-G12D/+) and showed that obese mice had both increased tumor burden and shortened survival compared to their lean counterparts. Strikingly, weight loss (via AAV-leptin rescue or caloric restriction), decreased tumor development, demonstrating that the tumor-promoting effects of obesity can be reversed. Bulk-RNA sequencing of tumors from obese mice exhibited aberrant expression of islet beta-cell genes, including those coding for the peptide hormones cholecystokinin (CCK) and amylin (Iapp). Single-cell RNA sequencing of islet beta-cells from wild-type, high fat diet-fed, and Lepob/ob mice revealed a trajectory of beta-cell adaptation to obesity with dysregulated hormone expression, including downregulation of insulin expression and upregulation of CCK and Iapp, concordant with loss of beta-cell identity transcription factors and beta-cell dysfunction. In silico analyses using dynamic optimal transport (TrajectoryNet) demonstrate that CCK-expressing beta-cells arise from pre-existing insulin low-expressing beta-cells, arguing for baseline beta-cell heterogeneity as a determinant of aberrant hormone expression. Lastly, transgenic expression of CCK or Iapp in beta-cells was sufficient to promote oncogenic Kras-driven pancreatic tumorigenesis, while converse beta-cell ablation impeded tumor progression in mice. Together, these results uncover a novel mechanism of obesity driven PDAC by local hormonal signaling between endocrine islets and exocrine acinar cells and reveal pancreatic endocrine adaptations that could be targeted to halt exocrine tumorigenesis.Citation Format: Cathy C. Garcia, Lauren Lawres, Sherry Agabiti, Jaffarguriqbal Singh, Alex Tong, Aarthi Venkat, Daniel B. Burkhardt, Rebecca Cardone, Richard G. Kibbey, Smita Krishnaswamy, Mandar D. Muzumdar. Elucidating mechanisms of endocrine-exocrine signaling in obesity-driven pancreatic cancer [abstract]. In: Proceedings of the AACR Special Conference on Pancreatic Cancer; 2022 Sep 13-16; Boston, MA. Philadelphia (PA): AACR; Cancer Res 2022;82(22 Suppl):Abstract nr C050.", "publisher": "American Association for Cancer Research", "periodical": "Cancer Research", "keywords": [], "urls": [{"href": "https://aacrjournals.org/cancerres/article/82/22_Supplement/C050/710414/Abstract-C050-Elucidating-mechanisms-of-endocrine"}], "volume": 50, "issue": "22_Supplement", "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:JWITY9-sCbMC", "journal_source": "Cancer Research 82 (22_Supplement), C050-C", "cites": 0}, {"title": "Integrated transcriptome and trajectory analysis of cutaneous T-cell lymphoma identifies putative precancer populations", "type": "Journal Article", "authors": [{"name": ["Jingjing", "Ren"]}, {"name": ["Rihao", "Qu"]}, {"name": ["Nur-Taz", "Rahman"]}, {"name": ["Julia", "M", "Lewis"]}, {"name": ["Amber", "Loren", "Ong", "King"]}, {"name": ["Xiaofeng", "Liao"]}, {"name": ["Fatima", "N", "Mirza"]}, {"name": ["Kacie", "R", "Carlson"]}, {"name": ["Yaqing", "Huang"]}, {"name": ["Scott", "Gigante"]}, {"name": ["Benjamin", "Evans"]}, {"name": ["Barani", "Kumar", "Rajendran"]}, {"name": ["Suzanne", "Xu"]}, {"name": ["Guilin", "Wang"]}, {"name": ["Francine", "M", "Foss"]}, {"name": ["William", "Damsky"]}, {"name": ["Yuval", "Kluger"]}, {"name": ["Smita", "Krishnaswamy"]}, {"name": ["Michael", "Girardi"]}], "year": "2022", "month": "2", "pages": null, "abstract": "Cutaneous T-cell lymphoma (CTCL) incidence increases with age, and blood involvement portends a worse prognosis. To advance our understanding of CTCL development and identify potential therapeutic targets, we performed integrative analyses of paired single-cell RNA and TCR sequencing of peripheral blood CD4+ T-cells from CTCL patients to reveal disease unifying features. The malignant CD4+ T-cells of CTCL show highly diverse transcriptomic profiles across patients, with most displaying a mature Th2 differentiation and T-cell exhaustion phenotype. TCR-CDR3 peptide prediction analysis suggested limited diversity between CTCL samples, consistent with a role for a common antigenic stimulus. PHATE affinity-based transition analysis identified putative precancerous circulating populations characterized by an intermediate stage of gene expression and mutation level between the normal CD4+ T-cells and malignant CTCL cells. We further revealed the therapeutic potential of targeting CD82 and JAK that endow the malignant CTCL cells with survival and proliferation advantages.", "publisher": "American Society of Hematology", "periodical": "Blood Advances", "keywords": [], "urls": [], "volume": 7, "issue": 3, "google_scholar_url": "https://scholar.google.com/citations?view_op=view_citation&hl=en&user=l2Pr9m8AAAAJ&cstart=100&pagesize=100&citation_for_view=l2Pr9m8AAAAJ:nqdriD65xNoC", "journal_source": "Blood Advances, bloodadvances.", "cites": 0}]