[{"name": {"first": "Smita", "last": "Krishnaswamy", "middle": null, "preferred_name": "Smita", "preferred": "Smita"}, "title": "PhD", "image": "/images/members/smita_krishnaswamy.jpeg", "website": "/", "cv": "https://docs.google.com/document/d/1pDm0GNMrXCTxD4E3tDDkYCGE3WUn0V5YPVpVCcAU6cU/edit?usp=sharing", "isAlum": false, "about": "Smita Krishnaswamy is an Associate Professor in the department of Genetics at the Yale School of Medicine and Department of Computer Science in the Yale School of Applied Science and Engineering and a core member of the Program in Applied Mathematics. She is also affiliated with the Yale Center for Biomedical Data Science, Yale Cancer Center, and Program in Interdisciplinary Neuroscience. Smita's research focuses on developing unsupervised machine learning methods (especially graph signal processing and deep-learning) to denoise, impute, visualize and extract structure, patterns and relationships from big, high throughput, high dimensional biomedical data. Her methods have been applied variety of datasets from many systems including embryoid body differentiation, zebrafish development, the epithelial-to-mesenchymal transition in breast cancer, lung cancer immunotherapy, infectious disease data, gut microbiome data and patient data.\nSmita teaches three courses: Machine Learning for Biology (Fall), Deep Learning Theory and applications (spring), Advanced Topics in Machine Learning & Data Mining (Spring). She completed her postdoctoral training at Columbia University in the systems biology department where she focused on learning computational models of cellular signaling from single-cell mass cytometry data. She was trained as a computer scientist with a Ph.D. from the University of Michigan's EECS department where her research focused on algorithms for automated synthesis and probabilistic verification of nanoscale logic circuits. Following her time in Michigan, Smita spent 2 years at IBM's TJ Watson Research  Center as a researcher in the systems division where she worked on automated bug finding and error correction in logic.", "publications": ["Manifold Interpolating Optimal-Transport Flows for Trajectory Inference", "Recovering Gene Interactions from Single-Cell Data Using Data Diffusion", "Geometry Based Data Generation", "TraVeLGAN: Image-to-image Translation by Transformation Vector Learning", "Exploring single-cell data with deep multitasking neural networks", "Visualizing structure and transitions in high-dimensional biological data", "Uncovering axes of variation among single-cell cancer specimens", "Harmonic Alignment", "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics", "Interpretable Neuron Structuring with Graph Spectral Regularization", "Uncovering the Topology of Time-Varying fMRI Data using Cubical Persistence", "Diffusion Earth Mover’s Distance and Distribution Embeddings", "Quantifying the effect of experimental perturbations at single-cell resolution", "Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference", "Multimodal Data Visualization and Denoising with Integrated Diffusion", "MURAL: An Unsupervised Random Forest-Based Embedding for Electronic Health Record Data", "Fixing Bias in Reconstruction-based Anomaly Detection with Lipschitz Discriminators", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Exploring the Geometry and Topology of Neural Network Loss Landscapes", "Mapping Phenotypic Plasticity upon the Cancer Cell State Landscape Using Manifold Learning", "Transformer-based protein generation with regularized latent space optimization", "Single-cell multi-modal GAN reveals spatial patterns in single-cell data from triple-negative breast cancer", "Diffusion Curvature for Estimating Local Curvature in High Dimensional Data", "Molecular Graph Generation via Geometric Scattering", "Time-inhomogeneous diffusion geometry and topology", "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration"], "name_str": "Smita Krishnaswamy"}, {"name": {"first": "Scott", "middle": "E.", "last": "Youlten", "preferred_name": "Scott", "preferred": "Scott"}, "title": null, "image": null, "cv": null, "isAlum": false, "about": null, "publications": ["Single-cell multi-modal GAN reveals spatial patterns in single-cell data from triple-negative breast cancer"], "name_str": "Scott E. Youlten"}, {"name": {"preferred": "Edward", "first": "Edward", "middle": "De", "last": "Brouwer"}, "title": "PhD", "image": "/images/members/edward_de_brouwer.jpg", "cv": null, "isAlum": false, "about": "Edward is a post-doctoral associate at Yale university and joined the Krishnaswamy lab in April 2023. His research combines dynamical systems, geometric deep learning and causality with a strong focus on healthcare applications.\nPreviously, Edward has received his PhD in machine learning for healthcare from KU Leuven, Belgium. During his PhD, he was a visiting fellow at ETH Zürich, the University of Toronto, and MIT. He was also a summer inter at Google X and Microsoft research, where he worked on biomedical applications. He holds a Master in Financial Mathematics and in Electrical Engineering. In his free time, Edward composes music about the Anthropocene and is a part-time undergrad student in philosophy.", "publications": [], "name_str": "Edward De Brouwer"}, {"name": {"preferred": "Xingzhi", "first": "Xingzhi", "last": "Sun", "middle": null}, "title": null, "image": "/images/members/xingzhi_sun.png", "cv": null, "isAlum": false, "about": "Xingzhi is a PhD student of Computer Science at Yale University. His interests lie in deep learning and signal processing for biological problems. He has done research on interpretable machine learning, single-cell label transfer, graph spectral denoising, and neural differential equations for EHR data. He obtained his master's in Statistics and Data Science from Yale and his undergraduate degree in Mathematics and Applied Mathematics from the University of Chinese Academy of Sciences. He also interned at Microsoft Research Asia.", "publications": [], "name_str": "Xingzhi Sun"}, {"name": {"preferred": "Holly", "first": "Holly", "last": "Steach", "middle": null}, "title": "PhD", "image": null, "cv": null, "isAlum": false, "about": null, "publications": [], "name_str": "Holly Steach"}, {"name": {"first": "Oluwadamilola", "last": "Fasina", "middle": null, "preferred_name": "Dami", "preferred": "Dami"}, "title": null, "image": "/images/members/dami_fasina.jpg", "cv": null, "isAlum": false, "about": "Dami is a PhD student in applied mathematics at Yale University. He is broadly interested in methods development in machine learning and numerical analysis to solve problems in the physical sciences. He grew up in Auburn, Alabama and completed his B.S. in Nuclear Engineering from NC State and M.S. in Medical Physics from Duke before coming to Yale. In his free enjoys watching and playing soccer, chess, reading, and travelling.", "publications": ["Manifold Interpolating Optimal-Transport Flows for Trajectory Inference", "Diffusion Curvature for Estimating Local Curvature in High Dimensional Data"], "name_str": "Dami Fasina"}, {"name": {"preferred": "Chen", "first": "Chen", "last": "Liu", "middle": null}, "title": null, "image": "/images/members/chen_liu.jpg", "cv": null, "isAlum": false, "about": "Chen Liu joined the lab as a PhD student in Computer Science at Yale University starting 2022. His research interest is machine learning for healthcare. He primarily worked on radiological images in the past but also enjoys exploring new areas such as computational biology and genomics. He is excited about developing generalizable machine learning techniques that are widely applicable.\nChen grew up in Shanghai, China. He completed his B.S. and M.S. degrees at Bucknell University and Columbia University respectively. Prior to joining Yale, he was a senior Research Scientist at GE Healthcare, working on deep learning in X-ray and MRI data.", "website": "https://www.chenliu1996.com/", "publications": [], "name_str": "Chen Liu"}, {"name": {"preferred": "Danqi", "first": "Danqi", "last": "Liao", "middle": null}, "title": null, "image": "/images/members/danqi_liao.png", "cv": null, "isAlum": false, "about": "Danqi Liao is a Ph.D. student in the Computer Science department at Yale University. Her research interests include geometric, manifold learning, and deep learning. Specifically, she is interested in studying the characteristics that make expressive and generalizable embeddings and developing efficient and principled methods to achieve such representations.\nDanqi graduated Magna Cum Laude from Northwestern University and obtained her master's degree from Princeton University. While at Princeton, she worked on computer perception and video recognition in Dr. Olga Russakovsky's lab. Before graduate school, she worked as a machine learning engineer at Meta for two years. Outside of research, she is a big fan of soccer, tennis, and video games. Her favorite video game series is The Last of Us.", "website": null, "publications": [], "name_str": "Danqi Liao"}, {"name": {"first": "Jessie", "last": "Huang", "middle": null, "preferred_name": "Jessie", "preferred": "Jessie"}, "title": "PhD", "image": "/images/members/jessie_huang.jpg", "website": null, "cv": null, "isAlum": true, "about": "Jessie Huang is a postdoc in the department of computer science at Yale. She is generally interested in machine learning and its applications in medical and biological research. She was previously a postdoc in the Reasoning and Learning Lab at McGill University in Montreal. Her research at McGill focused on developing algorithms to learn robust policies with respect to misspecified rewards in reinforcement learning.\nJessie received her PhD in Mechanical Engineering from the University of Michigan, Ann Arbor. She worked as an engineering consultant at Exponent in the San Francisco bay area for two years before moving to Montreal. Before machine learning, she studied fracture mechanics and statistics and how to utilize the natural failure of materials to develop micro-scale tools for biomedical applications", "publications": ["TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Exploring the Geometry and Topology of Neural Network Loss Landscapes", "Time-inhomogeneous diffusion geometry and topology", "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration"], "name_str": "Jessie Huang"}, {"name": {"first": "Dennis", "last": "Shung", "middle": null, "preferred_name": "Dennis", "preferred": "Dennis"}, "title": null, "image": "/images/members/dennis_shung.jpeg", "website": null, "cv": null, "isAlum": true, "about": "Dennis is a board-certified physician trained in Internal Medicine and  Gastroenterology. He is working on applying unsupervised machine  learning techniques to electronic health record data.\nDennis grew up in Plano, Texas and attended Rice University and Baylor College of Medicine prior to his Internal Medicine residency training at Yale-New Haven Hospital. He is currently completing his clinical fellowship in Gastroenterology & Hepatology with a Master's of Health Science in Clinical Informatics at Yale; in this capacity, he is developing machine learning models for predicting outcomes in acute  gastrointestinal bleeding. His long-term goal is to become a physician data scientist who creates, validates, and tests integrated machine learning models to improve risk stratification for patients.", "publications": ["Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference", "MURAL: An Unsupervised Random Forest-Based Embedding for Electronic Health Record Data", "Multiscale PHATE identifies multimodal signatures of COVID-19"], "name_str": "Dennis Shung"}, {"name": {"first": "Matthew", "last": "Amodio", "middle": null, "preferred_name": "Matt", "preferred": "Matt"}, "title": "PhD", "image": "/images/members/matt_amodio.png", "website": null, "cv": null, "isAlum": true, "about": "Matt Amodio is currently a doctoral candidate at Yale University in the Department of Computer Science. His research interest is in artificial intelligence, specifically deep learning. He enjoys developing new statistical and information theoretical techniques for use in neural networks, as well as practical optimization techniques general to any learning task.\nMatt grew up in a suburb of Cleveland, Ohio. He completed his undergraduate studies at the Ohio State University before working in D.C. for two years. He is an ardent baseball fan as well as a trivia enthusiast.", "publications": ["TraVeLGAN: Image-to-image Translation by Transformation Vector Learning", "Exploring single-cell data with deep multitasking neural networks", "Interpretable Neuron Structuring with Graph Spectral Regularization", "Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference", "Single-cell multi-modal GAN reveals spatial patterns in single-cell data from triple-negative breast cancer"], "name_str": "Matt Amodio"}, {"name": {"first": "Egbert", "last": "Castro", "middle": null, "preferred_name": "Egbert", "preferred": "Egbert"}, "title": null, "image": "/images/members/egbert_castro.jpeg", "website": null, "cv": null, "isAlum": false, "about": "Egbert Castro is a PhD student in the Computational Biology and Bioinformatics track at Yale University. He is interested in methods for learning informative and useful representations of biomolecules. Currently his work in the Krishnaswamy lab focuses on learning latent representations of graph-structured data such as miRNA secondary structure ensembles.\nPreviously he majored in Pharmacological Chemistry with a minor in Mathematics at UC San Diego. While at UC San Diego, he performed research in the lab of Dr. Rommie Amaro applying molecular dynamics and Brownian dynamics in drug discovery. After graduating, he interned at Genentech applying machine learning to chemical property prediction tasks", "publications": ["Transformer-based protein generation with regularized latent space optimization", "Molecular Graph Generation via Geometric Scattering"], "name_str": "Egbert Castro"}, {"name": {"first": "Manik", "last": "Kuchroo", "middle": null, "preferred_name": "Manik", "preferred": "Manik"}, "title": null, "image": "/images/members/manik_kuchroo.png", "website": null, "cv": null, "isAlum": true, "about": "Manik Kuchroo is an MD candidate at Yale School of Medicine and is interested in the intersection of genomics, immunology and oncology. His current projects in the lab include developing a novel manifold based clustering algorithm for single cell genomics data, understanding tumor infiltrating immune cells developmental progression using deep learning and helping characterize interactions in the exoproteome using phage and yeast display technologies in collaboration with the Ring lab.\nManik is originally from Newton, Massachusetts and graduated from Harvard College with a BA in Neurobiology. Manik's interest in the intersection of genomics and immunology was piqued during his time in Aviv Regev's Lab at the Broad Institute and during his time with Phil De Jager and Nikolaos Patsopoulos at Harvard Medical School.\nWhile not in the lab or in the hospital, Manik loves playing cricket and watching TV shows.", "publications": ["Manifold Interpolating Optimal-Transport Flows for Trajectory Inference", "Diffusion Earth Mover’s Distance and Distribution Embeddings", "Multimodal Data Visualization and Denoising with Integrated Diffusion", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Time-inhomogeneous diffusion geometry and topology", "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration"], "name_str": "Manik Kuchroo"}, {"name": {"first": "Aarthi", "last": "Venkat", "middle": null, "preferred_name": "Aarthi", "preferred": "Aarthi"}, "title": null, "image": "/images/members/aarthi_venkat.jpg", "website": null, "cv": null, "isAlum": false, "about": "Aarthi is a PhD student in Computational Biology and Bioinformatics at Yale University. She is interested in developing improved methods to study cancer immunogenomics. To this end, her research focuses on machine learning and graph-based methods that leverage the rich properties of single-cell RNA sequencing data.Aarthi graduated from UC San Diego with a B.S. in Bioengineering: Bioinformatics. While there, she performed resesarch in Dr. Ferhat Ay's lab, where she analyzed Hi-C sequencing data to interpret the conserved organizational features of parasite genomes. She also worked with Dr. Theresa Gaasterland to study cancer genomics and structural variation. Over the summers, Aarthi interned at Auris Health and Regeneron, where she further grew her skillset in synergistic approaches to computer science and biological discovery.", "publications": ["Single-cell multi-modal GAN reveals spatial patterns in single-cell data from triple-negative breast cancer"], "name_str": "Aarthi Venkat"}, {"name": {"preferred": "Monica", "first": "Monica", "last": "Munnangi", "middle": null}, "title": null, "image": "/images/members/monica_munnangi.jpeg", "website": null, "cv": null, "isAlum": true, "about": "Monica is a Postgraduate Researcher at Yale School of Medicine. Her research interest is Machine Learning for Healthcare. She is currently working on time series analysis with deep learning models. Monica has graduated with Masters in Computer Science from University of Massachusetts Amherst where she worked at Information Fusion Lab in the intersection of Medical Imaging and deep Learning. She interned at GE Healthcare during her graduate study where she used Computer Vision algorithms for Chest X-Ray imaging.", "publications": [], "name_str": "Monica Munnangi"}, {"name": {"first": "Dhananjay", "last": "Bhaskar", "middle": null, "preferred_name": "Dhananjay", "preferred": "Dhananjay"}, "title": "PhD", "image": "/images/members/dhananjay_bhaskar.jpg", "website": null, "cv": null, "isAlum": false, "about": "Dhananjay Bhaskar is a postdoc in Genetics at the School of Medicine and a Yale-Boehringer Ingelheim Biomedical Data Science Fellow. His interdisciplinary research combines topological data analysis, machine learning, and mathematical modeling with applications in biophysics and biomedical research. Previously he worked on quantitative analysis of pattern formation and phase transitions in active matter, automated embryo selection for IVF, and unsupervised methods for analyzing cell shape and motility in time-lapse microscopy.Dhananjay received his Ph.D. in Biomedical Engineering and Sc.M. in Data Science from Brown University. Prior to Brown, he studied Computer Science and Applied Mathematics at the University of British Columbia. When he is not busy transforming coffee beans into code, Dhananjay enjoys hiking, swimming, and playing badminton.", "publications": ["Transformer-based protein generation with regularized latent space optimization", "Diffusion Curvature for Estimating Local Curvature in High Dimensional Data", "Molecular Graph Generation via Geometric Scattering"], "name_str": "Dhananjay Bhaskar"}, {"name": {"preferred": "Sasha", "first": "Sasha", "last": "Safonova", "middle": null}, "title": null, "image": "/images/members/sasha_safonova.jpg", "website": null, "cv": null, "isAlum": true, "about": "Sasha is a PhD student in Astronomy at Yale University, working with Smita Krishnaswamy and Nikhil Padmanabhan. Her scientific interests include computational cosmology and the large scale structure of the Universe. She is working on harnessing machine learning to enhance the connection between theory and observations on the largest scales in the Universe. Sasha got her Master's in Physics at Durham University, where she created a mock galaxy catalog from cosmological simulations, working with Prof. Shaun Cole and Dr. Peder Norberg. Prior to Durham, Sasha majored in physics at the University of Arizona and performed research at the SLAC National Accelerator Laboratory, Lawrence Livermore National Laboratory and MIT's Haystack Observatory. She has dedicated many nights to collecting cosmological data at the Kitt Peak National Observatory.", "publications": [], "name_str": "Sasha Safonova"}, {"name": {"preferred": "Andrew", "first": "Andrew", "last": "Benz", "middle": null}, "title": null, "image": "/images/members/andrew_benz.jpg", "website": "https://andrewbe.nz/", "cv": null, "isAlum": true, "about": "Andrew is pursuing a BS/MS degree in math at Yale and has been involved in the Krishnaswamy Lab since 2019. His research interests revolve around applying spectral graph theory to high-dimensional biological data. He spends his spare time reading and playing bass guitar.", "publications": [], "name_str": "Andrew Benz"}, {"name": {"first": "Kincaid", "last": "MacDonald", "middle": null, "preferred_name": "Kincaid", "preferred": "Kincaid"}, "title": null, "image": "/images/members/kincaid_macdonald.jpg", "website": null, "cv": null, "isAlum": true, "about": "Kincaid is an undergraduate at Yale studying mathematics, computer science, philosophy, and exploring their practical intersection in artificial intelligence. He is particularly interested in developing mathematical tools to shine light into the \"black box\" of modern deep neural networks.", "publications": ["Diffusion Earth Mover’s Distance and Distribution Embeddings", "Diffusion Curvature for Estimating Local Curvature in High Dimensional Data"], "name_str": "Kincaid MacDonald"}, {"name": {"first": "Abhinav", "last": "Godavarthi", "middle": null, "preferred_name": "Abhinav", "preferred": "Abhinav"}, "title": null, "image": "/images/members/abhinav_godavarthi.jpeg", "website": null, "cv": null, "isAlum": false, "about": "Abhi is an undergrad studying applied math and chemistry. In the lab he focuses on unsupervised and deep learning methods for multiomics, protein function prediction, and molecular simulation. In his free time he enjoys singing, playing the cello, and losing at ping pong.", "publications": ["Multimodal Data Visualization and Denoising with Integrated Diffusion", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Transformer-based protein generation with regularized latent space optimization"], "name_str": "Abhinav Godavarthi"}, {"name": {"first": "Michał", "last": "Gerasimiuk", "middle": null, "preferred_name": "Michał", "preferred": "Michał"}, "title": null, "image": "/images/members/michał_gerasimiuk.jpg", "website": null, "cv": null, "isAlum": false, "about": "Michał is an undergraduate at Yale studying computer science. His work in the lab includes building unsupervised learning models that handle electronic health records data and exploring deep neural networks as components of brain-computer interfaces. When not in class, you can find him playing in chess tournaments, reading, or practicing taekwondo.", "publications": ["MURAL: An Unsupervised Random Forest-Based Embedding for Electronic Health Record Data"], "name_str": "Michał Gerasimiuk"}, {"name": {"preferred": "Katherine", "first": "Katherine", "last": "Du", "middle": null}, "title": null, "image": "/images/members/katherine_du.png", "website": null, "cv": null, "isAlum": true, "about": "Katherine is an undergrad at Yale studying biology and statistics. In the lab, she is currently working on single-cell RNA sequencing (scRNA-seq) analysis, applying tools developed by Krishnaswamy Lab such as PHATE and MELD. Aside from research, she ice skates with the Yale Collegiate Figure Skating Club and is passionate about mental health advocacy and education.", "publications": [], "name_str": "Katherine Du"}, {"name": {"preferred": "Tom", "first": "Tom", "last": "Wallenstein", "middle": null}, "title": null, "image": "/images/members/tom_wallenstein.jpeg", "website": "https://tomwallenstein.com/", "cv": null, "isAlum": false, "about": "om is an undergraduate at Yale majoring in Computer Science and joined the lab to work on his senior project. He is generally interested in machine learning, specifically reinforcement learning. Outside of his studies, he is a goalkeeper of Yale men's soccer team.", "publications": [], "name_str": "Tom Wallenstein"}, {"name": {"first": "Jackson", "last": "Grady", "middle": null, "preferred_name": "Jackson", "preferred": "Jackson"}, "title": null, "image": "/images/members/jackson_grady.jpg", "website": null, "cv": null, "isAlum": true, "about": "Jackson is an undergrad at Yale studying Computer Science. In the lab, he is interested in thinking about low-dimensional encodings of complex data, and how they can be transformed to generate new data. In his free time, Jackson enjoys singing and cooking!", "publications": ["Molecular Graph Generation via Geometric Scattering"], "name_str": "Jackson Grady"}, {"name": {"first": "Guy", "last": "Wolf", "middle": null, "preferred_name": "Guy", "preferred": "Guy"}, "title": "PhD", "image": "", "website": null, "cv": null, "isAlum": true, "about": "Guy Wolf received the M.Sc. and Ph.D. degrees in computer science from Tel Aviv University in 2009 and 2014, respectively. During his M.Sc. studies he served in the Israeli Defense Forces in software design and development roles. Between the years 2013 and 2015 he was a post-doctoral researcher in the Computer Science Department at Ècole Normale Supérieure in Paris. Since 2015, he is a Gibbs Assistant Professor in the Applied Math Program at Yale University. One of the main goals of his current research at Yale is to create meaningful interaction between data analysis aspects of machine learning, applied mathematics, and computational sciences, especially in Big Data applications. His research interests include exploratory & high-dimensional data analysis, manifold learning, diffusion geometries, machine learning, and deep learning. He now has his own lab at the University of Montreal.", "publications": ["Manifold Interpolating Optimal-Transport Flows for Trajectory Inference", "Recovering Gene Interactions from Single-Cell Data Using Data Diffusion", "Geometry Based Data Generation", "Exploring single-cell data with deep multitasking neural networks", "Visualizing structure and transitions in high-dimensional biological data", "Uncovering axes of variation among single-cell cancer specimens", "Harmonic Alignment", "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics", "Interpretable Neuron Structuring with Graph Spectral Regularization", "Uncovering the Topology of Time-Varying fMRI Data using Cubical Persistence", "Diffusion Earth Mover’s Distance and Distribution Embeddings", "Quantifying the effect of experimental perturbations at single-cell resolution", "Multimodal Data Visualization and Denoising with Integrated Diffusion", "MURAL: An Unsupervised Random Forest-Based Embedding for Electronic Health Record Data", "Fixing Bias in Reconstruction-based Anomaly Detection with Lipschitz Discriminators", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Exploring the Geometry and Topology of Neural Network Loss Landscapes", "Time-inhomogeneous diffusion geometry and topology", "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration"], "name_str": "Guy Wolf"}, {"name": {"first": "David", "middle": "van", "last": "Dijk", "preferred_name": "David", "preferred": "David"}, "title": "PhD", "image": "", "website": null, "cv": null, "isAlum": true, "about": "Previously, David was a postdoc in the Krishnaswamy lab where he developed new machine learning tools for biomedical data analysis. David co-developed tools such as MAGIC, PHATE, and SAUCIE. David is now an Assistant Professor and started his own lab at Yale.", "publications": ["Recovering Gene Interactions from Single-Cell Data Using Data Diffusion", "Exploring single-cell data with deep multitasking neural networks", "Visualizing structure and transitions in high-dimensional biological data", "Uncovering axes of variation among single-cell cancer specimens", "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics", "Interpretable Neuron Structuring with Graph Spectral Regularization", "Quantifying the effect of experimental perturbations at single-cell resolution", "Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference"], "name_str": "David van Dijk"}, {"name": {"first": "Jay", "middle": "S.", "last": "Stanley", "preferred_name": "Jay", "preferred": "Jay"}, "title": "PhD", "image": "", "website": null, "cv": null, "isAlum": true, "about": "Jay Stanley was born in Arkansas. He graduated with his BA in Biology from Hendrix College in 2016. At Yale, Jay is working on his PhD in Computational Biology and Bioinformatics. His research interests are Spectral Graph Theory, Signal Processing, Dimensionality reduction, data visualization. Jay is currently pursing a postdoctoral fellowship at Yale University.\nJay is an avid music enthusiast, rock climber, and whitewater kayaker.", "publications": ["Geometry Based Data Generation", "Harmonic Alignment", "Interpretable Neuron Structuring with Graph Spectral Regularization", "Quantifying the effect of experimental perturbations at single-cell resolution"], "name_str": "Jay S. Stanley"}, {"name": {"preferred": "Ngan", "first": "Ngan", "last": "Vu", "middle": null}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "NV joined the lab as a senior in Yale College pursuing a combined B.S./M.S. in Computer Science and a B.A. in Statistics and Data Science. She is focused on studying and developing graph-based and deep learning methods. She is also interested in creating good platforms and tools for researchers, which was what she worked on while interning at Google Research and Facebook Feed Machine Learning. NV is currently working on speeding up kernel methods, including ones developed by Krishnaswamy Lab such as MAGIC and PHATE. While not coding, she spends lots of time ice skating with Yale Collegiate Figure Skating Club and playing percussion for Davenport Pops Orchestra. NV is currently a researcher at Google Brain.", "publications": [], "name_str": "Ngan Vu"}, {"name": {"first": "Ofir", "last": "Lindenbaum", "middle": null, "preferred_name": "Ofir", "preferred": "Ofir"}, "title": "PhD", "image": "", "website": null, "cv": null, "isAlum": true, "about": "Ofir Lindenbaum completed a postdoctoral fellowship in the Krishnaswamy Lab from 2017 to 2018, and is now a Gibbs Assistant Professor in the Yale University Applied Mathematics Program. Ofir’s areas of interest include machine learning, applied and computational harmonic analysis, musical signals analysis.", "publications": ["Geometry Based Data Generation"], "name_str": "Ofir Lindenbaum"}, {"name": {"first": "Kevin", "middle": "R.", "last": "Moon", "preferred_name": "Kevin", "preferred": "Kevin"}, "title": "PhD", "image": "", "website": null, "cv": null, "isAlum": true, "about": "Kevin completed a postdoctoral fellowship in the Krishnaswamy Lab from 2016 to 2018, and is now an Assistant Professor in the Department of Mathematics and Statistics at Utah State University, where he focuses on the development of theory and applications in machine learning.", "publications": ["Recovering Gene Interactions from Single-Cell Data Using Data Diffusion", "Exploring single-cell data with deep multitasking neural networks", "Visualizing structure and transitions in high-dimensional biological data"], "name_str": "Kevin R. Moon"}, {"name": {"preferred": "Alexander", "first": "Alexander", "last": "Strzalkowski", "middle": null}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Alexander completed his undergraduate thesis in Applied Mathematics with the Krishnaswamy Lab in 2017. He is currently a PhD student in the Department of Computer Science at Princeton University, where he is focusing on utilizing Probabilistic Graphical Models to extract structure from Electronic Healthcare Records.", "publications": [], "name_str": "Alexander Strzalkowski"}, {"name": {"first": "Krishnan", "last": "Srinivasan", "middle": null, "preferred_name": "Krishnan", "preferred": "Krishnan"}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Krishnan completed his undergraduate thesis in the Krishnaswamy Lab in 2016 and 2017, and is now a PhD Student in the Computer Science Department at Stanford University, where he's researching reinforcement learning and its applications to robot learning.", "publications": ["Exploring single-cell data with deep multitasking neural networks"], "name_str": "Krishnan Srinivasan"}, {"name": {"preferred": "Jad", "first": "Jad", "last": "Habouch", "middle": null}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Jad completed a Computational Biology Lab Rotation with the Krishnaswamy Lab in 2017 and 2018, and is now a Masters' Student at Yale University, where he's working on the intersection of Microbiology, Immunology, and Environmental Science research.", "publications": [], "name_str": "Jad Habouch"}, {"name": {"preferred": "Will", "first": "Will", "last": "Chen", "middle": null}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "William Chen was an MD candidate at the Yale School of Medicine. He graduated with distinction from Stanford University with a B.S. in Computer Science and is most interested in computational cancer genomics. He worked on investigating the effects of various small-molecule inhibitors on epithelial-to-mesenchymal transition (EMT) in breast cancer using mass cytometry in the lab. He is now pursuing residency at UCSF.", "publications": [], "name_str": "Will Chen"}, {"name": {"preferred": "Alex", "first": "Alex", "last": "Gonopolskiy", "middle": null}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Alex Gonopolskiy was a software developer associated with the lab and worked on developing novel algorithms for the analysis of biological data. Prior to that he has worked in algorithmic trading for several years. He graduated from the University of Michigan in 2007 obtained and his MA degree in Computer Science specializing in Intelligent Systems. He is currently a Data engineer at QuantCo.", "publications": [], "name_str": "Alex Gonopolskiy"}, {"name": {"first": "Daniel", "middle": "B.", "last": "Burkhardt", "preferred_name": "Daniel", "preferred": "Daniel"}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Daniel earned his B.S. in Microbiology at the University of Massachusetts, Amherst in 2015. He studied the effects of simulated climate warming on soil microbial communities with Dr. Kristen DeAngelis, and this work became the focus of his senior thesis. Daniel joined the PhD program in Genetics at Yale University in 2015. Under the mentorship of Smita Krishnaswamy, Daniel has worked on developing unsupervised machine learning algorithms for analysis of high dimensional biomedical data. Previous projects include manifold learning methods for dimensionality reduction and analysis of experimental perturbations and a neural network for archetypal analysis.", "publications": ["Visualizing structure and transitions in high-dimensional biological data", "Quantifying the effect of experimental perturbations at single-cell resolution", "Generating hard-to-obtain information from easy-to-obtain information: Applications in drug discovery and clinical inference", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Mapping Phenotypic Plasticity upon the Cancer Cell State Landscape Using Manifold Learning"], "name_str": "Daniel B. Burkhardt"}, {"name": {"first": "Scott", "middle": "A.", "last": "Gigante", "preferred_name": "Scott", "preferred": "Scott"}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Scott was a PhD student in Computational Biology and Bioinformatics, and jointly advised by Smita Krishnaswamy and Ronald Coifman. His research interests include deep learning and graph-based methods for the analysis of single-cell genomics data.\nScott completed his Bachelor of Science in Mathematics & Statistics at the University of Melbourne, Australia. Before coming to Yale, Scott was a research technician at the Walter and Eliza Hall Institute of Medical Research, where he developed computational methods for detecting and analysing epigenetic modifications to DNA in nanopore sequencing.\nScott is passionate about open, reproducible science and open source software. In his spare time, Scott enjoys singing with the Yale Camerata and cycling with the Yale Cycling Team.", "publications": ["Visualizing structure and transitions in high-dimensional biological data", "Harmonic Alignment", "Quantifying the effect of experimental perturbations at single-cell resolution", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration"], "name_str": "Scott A. Gigante"}, {"name": {"preferred": "Feng", "first": "Feng", "last": "Gao", "middle": null}, "title": null, "image": "", "website": null, "cv": null, "isAlum": true, "about": "Feng Gao was a postdoc in the Department of Genetics at the Yale School of Medicine. His research interests lie in machine learning, deep learning and their applications in biomedical research. Feng received his PhD in Computational Science and Environmental Toxicology from Michigan State University in 2019. During his PhD study, Feng studied geometric scattering transform for graphs and manifolds as well as molecular dynamics simulation of complex environmental systems. In his spare time, he likes travelling and photography.", "publications": [], "name_str": "Feng Gao"}, {"name": {"first": "Alexander", "middle": "Y.", "last": "Tong", "preferred_name": "Alexander", "preferred": "Alexander"}, "title": null, "image": "/images/members/alex_tong.jpg", "website": "https://alextong.net/", "cv": null, "isAlum": true, "about": "Alex, now at MILA, was a computer science PhD student at Yale University.  His research interests are in machine learning and algorithms. Currently, he is working on optimal transport methods for single-cell data using a combination of graph and deep learning methods.\nAlex grew up in Seattle, Washington. He completed B.S. and M.S. degrees in computer science from Tufts University in 2017. He splits his spare time between racing sailboats and trail running.", "publications": ["Manifold Interpolating Optimal-Transport Flows for Trajectory Inference", "TrajectoryNet: A Dynamic Optimal Transport Network for Modeling Cellular Dynamics", "Interpretable Neuron Structuring with Graph Spectral Regularization", "Diffusion Earth Mover’s Distance and Distribution Embeddings", "Quantifying the effect of experimental perturbations at single-cell resolution", "Multimodal Data Visualization and Denoising with Integrated Diffusion", "MURAL: An Unsupervised Random Forest-Based Embedding for Electronic Health Record Data", "Fixing Bias in Reconstruction-based Anomaly Detection with Lipschitz Discriminators", "Multiscale PHATE identifies multimodal signatures of COVID-19", "Time-inhomogeneous diffusion geometry and topology", "Topological analysis of single-cell hierarchy reveals inflammatory glial landscape of macular degeneration"], "name_str": "Alexander Y. Tong"}]