[
    {
      "title": "Data Geometry and Topology",
      "about": "Following the manifold hypothesis we develop and employ methodologies \nfor understanding the topology of high dimensional data in it's native space. Our techniques span from the application of the diffusion operator to neural manifold learning",
      "examples": [
        {
          "text": "MAGIC",
          "href": "/projects/magic"
        },
        {
          "text": "MAGAN",
          "href": "/projects/magan"
        }
      ],
      "image": "/images/heroes/bio.png"
    },
    {
      "title": "Learning Embeddings and Representations",
      "about": "Sculpting the coarse readout of experimentation towards a useful embedding preserving the data's characteristics is a fundamental problem we undertake. Our methods provide the foundations of analyzing molecules for drug discovery, images for dynamic characterization, and networks for gaining insight from knowledge graphs. \n            ",
      "examples": [
        {
          "text": "PHATE",
          "href": "/projects/phate"
        },
        {
          "text": "MSPHATE",
          "href": "/projects/multiscale_phate"
        },
        {
          "text": "SAUCIE",
          "href": "/projects/saucie"
        }
      ],
      "image": "/images/heroes/geometric_5.png"
    },
    {
      "title": "Dynamics Characterization",
      "about": "How data is acquist often limits insights which can be gleaned. For example the\nstatic snapshots of data for an otherwise continuous process. We specialize in \ncharacterizing data representations to provide more holistic analyses e.g. constructing a singular representation of these static snapshots that temporally respects the entire process.\n            ",
      "examples": [
        {
          "text": "MIOFlow",
          "href": "/projects/mioflow"
        },
        {
          "text": "TrajectoryNet",
          "href": "/projects/trajectory_net"
        },
        {
          "text": "DyMoN",
          "href": "/projects/dymon"
        }
      ],
      "image": "/images/heroes/geometric_2.png"
    },
    {
      "title": "Learning on Graphs",
      "about": "Construction of and learning from data graphs are core component of truly understanding \"Big Data\". We leverage a swath of techniques from signal processing to optimal transport to know how our data thoroughly inside and out so that we can denoise, impute, and study our data.",
      "examples": [
        {
          "text": "MAGIC",
          "href": "/projects/magic"
        }
      ],
      "image": "/images/heroes/data.png"
    },
    {
      "title": "Biomedical Systems Applications",
      "about": "Combining all our prior efforts - understanding data topology, producing useful data embeddings, characterizing data dynamics - we produce state-of-the-art pipelines for biological insight. Whether it's cancers, immunology, or developmental biology we continue to unravel mysteries of biological systems.",
      "examples": [
        {
          "text": "PhEMD",
          "href": "/projects/phemd"
        },
        {
          "text": "MELD",
          "href": "/projects/meld"
        }
      ],
      "image": "/images/heroes/karyotype.png"
    }
  ]